{"pageProps":{"note":{"id":"0yfpmcy044f4ynwmi8eyr9e","title":"Get your work recognized: write a brag document","desc":"","updated":1668056462456,"created":1668055835997,"custom":{},"fname":"writing.dev.brag-documents","type":"note","vault":{"fsPath":"vault"},"contentHash":"a35f980666652ea88b712f7f623835bc","links":[{"from":{"fname":"dev.journal.genoplan","id":"djdvoLLYDZe9TkgbPbnIt","vaultName":"vault"},"type":"backlink","position":{"start":{"line":2,"column":1,"offset":1},"end":{"line":2,"column":31,"offset":31},"indent":[]},"value":"writing.dev.brag-documents"}],"anchors":{"you-dont-remember-everything-you-did":{"type":"header","text":"you don’t remember everything you did","value":"you-dont-remember-everything-you-did","line":16,"column":0,"depth":2},"your-manager-doesnt-remember-everything-you-did":{"type":"header","text":"your manager doesn’t remember everything you did","value":"your-manager-doesnt-remember-everything-you-did","line":28,"column":0,"depth":2},"heres-the-tactic-write-a-document-listing-your-accomplishments":{"type":"header","text":"here’s the tactic: write a document listing your accomplishments","value":"heres-the-tactic-write-a-document-listing-your-accomplishments","line":32,"column":0,"depth":2},"share-your-brag-document-with-your-manager":{"type":"header","text":"share your brag document with your manager","value":"share-your-brag-document-with-your-manager","line":42,"column":0,"depth":2},"share-it-with-your-peer-reviewers":{"type":"header","text":"share it with your peer reviewers","value":"share-it-with-your-peer-reviewers","line":50,"column":0,"depth":2},"explain-the-big-picture":{"type":"header","text":"explain the big picture","value":"explain-the-big-picture","line":56,"column":0,"depth":2},"use-your-brag-document-to-notice-patterns":{"type":"header","text":"use your brag document to notice patterns","value":"use-your-brag-document-to-notice-patterns","line":62,"column":0,"depth":2},"dont-forget-to-include-the-fuzzy-work":{"type":"header","text":"don’t forget to include the fuzzy work","value":"dont-forget-to-include-the-fuzzy-work","line":72,"column":0,"depth":2},"encourage-each-other-to-celebrate-accomplishments":{"type":"header","text":"encourage each other to celebrate accomplishments","value":"encourage-each-other-to-celebrate-accomplishments","line":89,"column":0,"depth":2},"the-brag-workshop-help-people-list-their-accomplishments":{"type":"header","text":"the brag workshop: help people list their accomplishments","value":"the-brag-workshop-help-people-list-their-accomplishments","line":91,"column":0,"depth":2},"biweekly-brag-document-writing-session":{"type":"header","text":"biweekly brag document writing session","value":"biweekly-brag-document-writing-session","line":99,"column":0,"depth":2},"thanks":{"type":"header","text":"thanks","value":"thanks","line":101,"column":0,"depth":3},"appendix-brag-document-template":{"type":"header","text":"Appendix: brag document template","value":"appendix-brag-document-template","line":109,"column":0,"depth":2},"goals-for-this-year":{"type":"header","text":"Goals for this year:","value":"goals-for-this-year","line":115,"column":0,"depth":3},"goals-for-next-year":{"type":"header","text":"Goals for next year","value":"goals-for-next-year","line":119,"column":0,"depth":3},"projects":{"type":"header","text":"Projects","value":"projects","line":123,"column":0,"depth":3},"collaboration--mentorship":{"type":"header","text":"Collaboration & mentorship","value":"collaboration--mentorship","line":132,"column":0,"depth":3},"design--documentation":{"type":"header","text":"Design & documentation","value":"design--documentation","line":146,"column":0,"depth":3},"company-building":{"type":"header","text":"Company building","value":"company-building","line":153,"column":0,"depth":3},"what-you-learned":{"type":"header","text":"What you learned","value":"what-you-learned","line":160,"column":0,"depth":3},"outside-of-work":{"type":"header","text":"Outside of work","value":"outside-of-work","line":175,"column":0,"depth":3},"general-prompts":{"type":"header","text":"General prompts","value":"general-prompts","line":188,"column":0,"depth":3}},"children":[],"parent":"oh8e9q4cqrtq675kxu2j0c9","data":{}},"body":"<h1 id=\"get-your-work-recognized-write-a-brag-document\">Get your work recognized: write a brag document<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#get-your-work-recognized-write-a-brag-document\"></a></h1>\n<blockquote>\n<p><a href=\"https://jvns.ca/blog/brag-documents/\">https://jvns.ca/blog/brag-documents/</a></p>\n</blockquote>\n<p>There’s this idea that, if you do great work at your job, people will (or should!) automatically recognize that work and reward you for it with promotions / increased pay. In practice, it’s often more complicated than that – some kinds of important work are more visible/memorable than others. It’s frustrating to have done something really important and later realize that you didn’t get rewarded for it just because the people making the decision didn’t understand or remember what you did. So I want to talk about a tactic that I and lots of people I work with have used!</p>\n<p>This blog post isn’t just about being promoted or getting raises though. The ideas here have actually been more useful to me to help me reflect on themes in my work, what’s important to me, what I’m learning, and what I’d like to be doing differently. But they’ve definitely helped with promotions!</p>\n<p>You can also <a href=\"https://jvns.ca/blog/brag-documents/#template\">skip to the brag document template at the end</a>.</p>\n<h2 id=\"you-dont-remember-everything-you-did\">you don’t remember everything you did<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#you-dont-remember-everything-you-did\"></a></h2>\n<p>One thing I’m always struck by when it comes to performance review time is a feeling of “wait, what <em>did</em> I do in the last 6 months?“. This is a kind of demoralizing feeling and it’s usually not based in reality, more in “I forgot what cool stuff I actually did”.</p>\n<p>I invariably end up having to spend a bunch of time looking through my pull requests, tickets, launch emails, design documents, and more. I always end up finding small (and sometimes not-so-small) things that I completely forgot I did, like:</p>\n<ul>\n<li>mentored an intern 5 months ago</li>\n<li>did a small-but-important security project</li>\n<li>spent a few weeks helping get an important migration over the line</li>\n<li>helped X put together this design doc</li>\n<li>etcetera!</li>\n</ul>\n<h2 id=\"your-manager-doesnt-remember-everything-you-did\">your manager doesn’t remember everything you did<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#your-manager-doesnt-remember-everything-you-did\"></a></h2>\n<p>...</p>\n<h2 id=\"heres-the-tactic-write-a-document-listing-your-accomplishments\">here’s the tactic: write a document listing your accomplishments<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#heres-the-tactic-write-a-document-listing-your-accomplishments\"></a></h2>\n<p>The tactic is pretty simple! Instead of trying to remember everything you did with your brain, maintain a “brag document” that lists everything so you can refer to it when you get to performance review season!</p>\n<p>...</p>\n<p>Where I work we call this a “brag document” but I’ve heard other names for the same concept like “hype document” or “list of stuff I did” :).</p>\n<p>There’s a basic template for a brag document at the end of this post.</p>\n<h2 id=\"share-your-brag-document-with-your-manager\">share your brag document with your manager<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#share-your-brag-document-with-your-manager\"></a></h2>\n<p>When I first wrote a brag document I was kind of nervous about sharing it with my manager. It felt weird to be like “hey, uh, look at all the awesome stuff I did this year, I wrote a long document listing everything”. But my manager was really thankful for it – I think his perspective was “this makes my job way easier, now I can look at the document when writing your perf review instead of trying to remember what happened”.</p>\n<p>Giving them a document that explains your accomplishments will really help your manager advocate for you in discussions about your performance and come to any meetings they need to have prepared.</p>\n<p>Brag documents also <strong>really</strong> help with manager transitions – if you get a new manager 3 months before an important performance review that you want to do well on, giving them a brag document outlining your most important work &#x26; its impact will help them understand what you’ve been doing even though they may not have been aware of any of your work before.</p>\n<h2 id=\"share-it-with-your-peer-reviewers\">share it with your peer reviewers<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#share-it-with-your-peer-reviewers\"></a></h2>\n<p>Similarly, if your company does peer feedback as part of the promotion/perf process – share your brag document with your peer reviewers!! Every time someone shares their doc with me I find it SO HELPFUL with writing their review for much the same reasons it’s helpful to share it with your manager – it reminds me of all the amazing things they did, and when they list their goals in their brag document it also helps me see what areas they might be most interested in feedback on.</p>\n<p>On some teams at work it’s a team norm to share a brag document with peer reviewers to make it easier for them.</p>\n<h2 id=\"explain-the-big-picture\">explain the big picture<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#explain-the-big-picture\"></a></h2>\n<p>In addition to just listing accomplishments, in your brag document you can write the narrative explaining the big picture of your work. Have you been really focused on security? On building your product skills &#x26; having really good relationships with your users? On building a strong culture of code review on the team?</p>\n<p>In my brag document, I like to do this by making a section for areas that I’ve been focused on (like “security”) and listing all the work I’ve done in that area there. This is especially good if you’re working on something fuzzy like “building a stronger culture of code review” where all the individual actions you do towards that might be relatively small and there isn’t a big shiny ship.</p>\n<h2 id=\"use-your-brag-document-to-notice-patterns\">use your brag document to notice patterns<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#use-your-brag-document-to-notice-patterns\"></a></h2>\n<p>In the past I’ve found the brag document useful not just to hype my accomplishments, but also to reflect on the work I’ve done. Some questions it’s helped me with:</p>\n<ul>\n<li>What work do I feel most proud of?</li>\n<li>Are there themes in these projects I should be thinking about? What’s the big picture of what I’m working on? (am I working a lot on security? localization?).</li>\n<li>What do I wish I was doing more / less of?</li>\n<li>Which of my projects had the effect I wanted, and which didn’t? Why might that have been?</li>\n<li>What could have gone better with project X? What might I want to do differently next time?</li>\n</ul>\n<h2 id=\"dont-forget-to-include-the-fuzzy-work\">don’t forget to include the fuzzy work<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#dont-forget-to-include-the-fuzzy-work\"></a></h2>\n<p>A lot of us work on fuzzy projects that can feel hard to quantify, like:</p>\n<ul>\n<li>improving code quality on the team / making code reviews a little more in depth</li>\n<li>making on call easier</li>\n<li>building a more fair interview process / performance review system</li>\n<li>refactoring / driving down technical debt</li>\n</ul>\n<p>A lot of people will leave this kind of work out because they don’t know how to explain why it’s important. But I think this kind of work is especially important to put into your brag document because it’s the most likely to fall under the radar! One way to approach this is to, for each goal:</p>\n<ol>\n<li>explain your goal for the work (why do you think it’s important to refactor X piece of code?)</li>\n<li>list some things you’ve done towards that goal</li>\n<li>list any effects you’ve seen of the work, even if they’re a little indirect</li>\n</ol>\n<p>If you tell your coworkers this kind of work is important to you and tell them what you’ve been doing, maybe they can also give you ideas about how to do it more effectively or make the effects of that work more obvious!</p>\n<h2 id=\"encourage-each-other-to-celebrate-accomplishments\">encourage each other to celebrate accomplishments<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#encourage-each-other-to-celebrate-accomplishments\"></a></h2>\n<h2 id=\"the-brag-workshop-help-people-list-their-accomplishments\">the brag workshop: help people list their accomplishments<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-brag-workshop-help-people-list-their-accomplishments\"></a></h2>\n<p>We did this by running a “brag workshop” just before performance review season. The format of the workshop is like this:</p>\n<p><strong>Part 1: write the document: 1-2 hours</strong>. Everybody sits down with their laptop, starts looking through their pull requests, tickets they resolved, design docs, etc, and puts together a list of important things they did in the last 6 months.</p>\n<p><strong>Part 2: pair up and make the impact of your work clearer: 1 hour</strong>. The goal of this part is to pair up, review each other’s documents, and identify places where people haven’t bragged “enough” – maybe they worked on an extremely critical project to the company but didn’t highlight how important it was, maybe they improved test performance but didn’t say that they made the tests 3 times faster and that it improved everyone’s developer experience. It’s easy to accidentally write “I shipped $feature” and miss the follow up (“… which caused $thing to happen”). Another person reading through your document can help you catch the places where you need to clarify the impact.</p>\n<h2 id=\"biweekly-brag-document-writing-session\">biweekly brag document writing session<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#biweekly-brag-document-writing-session\"></a></h2>\n<h3 id=\"thanks\">thanks<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#thanks\"></a></h3>\n<p>...</p>\n<p>I’d also recommend the blog post <a href=\"http://blog.aashni.me/2019/01/hype-yourself-youre-worth-it/\">Hype Yourself! You’re Worth It!</a> by Aashni Shah which talks about a similar approach.</p>\n<hr>\n<h2 id=\"appendix-brag-document-template\">Appendix: brag document template<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#appendix-brag-document-template\"></a></h2>\n<p>Here’s a template for a brag document! Usually I make one brag document per year. (“Julia’s 2017 brag document”). I think it’s okay to make it quite long / comprehensive – 5-10 pages or more for a year of work doesn’t seem like too much to me, especially if you’re including some graphs/charts / screenshots to show the effects of what you did.</p>\n<p>One thing I want to emphasize, for people who don’t like to brag, is – <strong>you don’t have to try to make your work sound better than it is</strong>. Just make it sound <strong>exactly as good as it is</strong>! For example “was the primary contributor to X new feature that’s now used by 60% of our customers and has gotten Y positive feedback”.</p>\n<h3 id=\"goals-for-this-year\">Goals for this year:<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#goals-for-this-year\"></a></h3>\n<ul>\n<li>List your major goals here! Sharing your goals with your manager &#x26; coworkers is really nice because it helps them see how they can support you in accomplishing those goals!</li>\n</ul>\n<h3 id=\"goals-for-next-year\">Goals for next year<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#goals-for-next-year\"></a></h3>\n<ul>\n<li>If it’s getting towards the end of the year, maybe start writing down what you think your goals for next year might be.</li>\n</ul>\n<h3 id=\"projects\">Projects<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#projects\"></a></h3>\n<p>For each one, go through:</p>\n<ul>\n<li>What your contributions were (did you come up with the design? Which components did you build? Was there some useful insight like “wait, we can cut scope and do what we want by doing way less work” that you came up with?)</li>\n<li>The impact of the project – who was it for? Are there numbers you can attach to it? (saved X dollars? shipped new feature that has helped sell Y big deals? Improved performance by X%? Used by X internal users every day?). Did it support some important non-numeric company goal (required to pass an audit? helped retain an important user?)</li>\n</ul>\n<p>Remember: don’t forget to explain what the results of you work actually were! It’s often important to go back a few months later and fill in what actually happened after you launched the project.</p>\n<h3 id=\"collaboration--mentorship\">Collaboration &#x26; mentorship<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#collaboration--mentorship\"></a></h3>\n<p>Examples of things in this category:</p>\n<ul>\n<li>Helping others in an area you’re an expert in (like “other engineers regularly ask me for one-off help solving weird bugs in their CSS” or “quoting from the C standard at just the right moment”)</li>\n<li>Mentoring interns / helping new team members get started</li>\n<li>Writing really clear emails/meeting notes</li>\n<li>Foundational code that other people built on top of</li>\n<li>Improving monitoring / dashboards / on call</li>\n<li>Any code review that you spent a particularly long time on / that you think was especially important</li>\n<li>Important questions you answered (“helped Risha from OTHER_TEAM with a lot of questions related to Y”)</li>\n<li>Mentoring someone on a project (“gave Ben advice from time to time on leading his first big project”)</li>\n<li>Giving an internal talk or workshop</li>\n</ul>\n<h3 id=\"design--documentation\">Design &#x26; documentation<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#design--documentation\"></a></h3>\n<p>List design docs &#x26; documentation that you worked on</p>\n<ul>\n<li>Design docs: I usually just say “wrote design for X” or “reviewed design for X”</li>\n<li>Documentation: maybe briefly explain the goal behind this documentation (for example “we were getting a lot of questions about X, so I documented it and now we can answer the questions more quickly”)</li>\n</ul>\n<h3 id=\"company-building\">Company building<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#company-building\"></a></h3>\n<p>This is a category we have at work – it basically means “things you did to help the company overall, not just your project / team”. Some things that go in here:</p>\n<ul>\n<li>Going above &#x26; beyond with interviewing or recruiting (doing campus recruiting, etc)</li>\n<li>Improving important processes, like the interview process or writing better onboarding materials</li>\n</ul>\n<h3 id=\"what-you-learned\">What you learned<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#what-you-learned\"></a></h3>\n<p>My friend Julian suggested this section and I think it’s a great idea – try listing important things you learned or skills you’ve acquired recently! Some examples of skills you might be learning or improving:</p>\n<ul>\n<li>how to do performance analysis &#x26; make code run faster</li>\n<li>internals of an important piece of software (like the JVM or Postgres or Linux)</li>\n<li>how to use a library (like React)</li>\n<li>how to use an important tool (like the command line or Firefox dev tools)</li>\n<li>about a specific area of programming (like localization or timezones)</li>\n<li>an area like product management / UX design</li>\n<li>how to write a clear design doc</li>\n<li>a new programming language</li>\n</ul>\n<p>It’s really easy to lose track of what skills you’re learning, and usually when I reflect on this I realize I learned a lot more than I thought and also notice things that I’m <em>not</em> learning that I wish I was.</p>\n<h3 id=\"outside-of-work\">Outside of work<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#outside-of-work\"></a></h3>\n<p>It’s also often useful to track accomplishments outside of work, like:</p>\n<ul>\n<li>blog posts</li>\n<li>talks/panels</li>\n<li>open source work</li>\n<li>Industry recognition</li>\n</ul>\n<p>I think this can be a nice way to highlight how you’re thinking about your career outside of strictly what you’re doing at work.</p>\n<p>This can also include other non-career-related things you’re proud of, if that feels good to you! Some people like to keep a combined personal + work brag document.</p>\n<h3 id=\"general-prompts\">General prompts<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#general-prompts\"></a></h3>\n<p>If you’re feeling stuck for things to mention, try:</p>\n<ul>\n<li>If you were trying to convince a friend to come join your company/team, what would you tell them about your work?</li>\n<li>Did anybody tell you that you did something well recently?</li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/notes/djdvoLLYDZe9TkgbPbnIt\">Genoplan</a></li>\n</ul>","noteIndex":{"id":"Iy0MoL0KnL55Br3AfTS2C","title":"Luke","desc":"","updated":1766965759366,"created":1644449449778,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"a724de3efd251cf89fe82a5860d9008b","links":[{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"life-tips","position":{"start":{"line":43,"column":5,"offset":2710},"end":{"line":43,"column":29,"offset":2734},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"life-tips","anchorHeader":"wodenokoto"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2026.articles","alias":"What I read in 2026","position":{"start":{"line":72,"column":3,"offset":4440},"end":{"line":72,"column":45,"offset":4482},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2026.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2025.articles","alias":"2025","position":{"start":{"line":73,"column":5,"offset":4487},"end":{"line":73,"column":32,"offset":4514},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2025.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2024.articles","alias":"2024","position":{"start":{"line":74,"column":5,"offset":4519},"end":{"line":74,"column":32,"offset":4546},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2024.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2023.articles","alias":"2023","position":{"start":{"line":75,"column":5,"offset":4551},"end":{"line":75,"column":32,"offset":4578},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2023.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2022.articles","alias":"2022","position":{"start":{"line":76,"column":5,"offset":4583},"end":{"line":76,"column":32,"offset":4610},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2022.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"journal.what-i-struggled-brag-in","position":{"start":{"line":82,"column":3,"offset":4746},"end":{"line":82,"column":39,"offset":4782},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"journal.what-i-struggled-brag-in"}}],"anchors":{"what-i-read-in-past":{"type":"header","text":"What I read in past","value":"what-i-read-in-past","line":76,"column":0,"depth":2}},"children":["zd4mq442jike0pr0wba1u3m","6hzeqsofq67gdk88flxlkhp","778ijii93yu5uwnrwmn5zi4","g1fngdjl25nes6fs3lip602","ZbdkdApFqLdks4Moq92R9","uoc5hhki3o4py15cesddu8q","9qf7j06jtdkm6rnx9ymvwb0","5zn10cvj7ajy2gh2is5nqmg","4qo9ma0z0yu1czns6pxl7y5","ok0e729ho7o09xetujkxc0m","GR5x8HnNFEN6fU2UBSEIK","yirtnlj8q24yutcf3ss1xqy","eq0wc6t7wl2wv221yb68ro4","7x2fnv4j6gxts08qk0jguny","ettkt3iClONnxpbGwBVLl","7l4knev6v613tbuoskvmbdg","hvh5bud6yp7dc89tuh95tr9","4fvoqrplw0cweo554usbjos","f8qsfql0a9v8thpeo82udfa","1swsbrhqi9jk41v9eodyi5q","SQqYupi6EFddTerBA8RRD","hjNeNc1F2JUh0lTWanH4h","qf0l4wbrc9jgooyzexmbq5v","o7xruzrah5wzqetottecss7","z1zo2mp6ddji5p317i4x9xw","v06c2tjelh341x4resa50fh","0yqesk4rcffwgyuab5x8rfa","sy2vkbtyu671chkvgn1yt8j","ufixpmxoydiccoh59kphrib","alswadkx4wb05y1z9iwfzfv","1daut9dpw70xd0zh5a7j5p4"],"parent":null,"data":{},"body":"\nHi there 👋. I'm a Front-end developer.\n\n---\n\n- 현실은 인간의 연산으로 완전히 파악할 수 없는 복잡계. 주어진 상황과 능력으로 할 수 있는 최선의 적응은 단순함과 꾸준함.\n\n  - 파산을 면하는 선에서 여러가지를 해보고 자신에게 맞는 걸 위주로 꾸준히. 그를 위해 단순, 편안, 쾌적함이 필요.\n\n- 🥱 -> 🤔💡🌱 - [On The Death of Daydreaming](https://www.afterbabel.com/p/on-the-death-of-daydreaming)\n  - boredom -> easy fun -> art -> profit?\n\n> I've often described my motivation for building software to others using imagery: I like to go find a secluded beach, build a large, magnificent sand castle, and then walk away. Will anyone notice? Probably not. Will the waves eventually destroy it? Yep. Did I still get immense satisfaction? Absolutely. - [aliasxneo](https://news.ycombinator.com/item?id=41497113)\n\n> We love to see the process, not just the result. The imperfections in your work can be beautiful if they show your struggle for perfection, not a lack of care. - [ralphammer](https://ralphammer.com/is-perfection-boring/)\n\n> Simplicity, even if it sacrifices some ideal functionality has better survival characteristics than the-right-thing. - [The Rise of Worse is Better](https://www.dreamsongs.com/RiseOfWorseIsBetter.html)\n\n> [Roberto Blake was talking about making 100 crappy videos](https://www.youtube.com/watch?v=OnUBaQ1Sp_E) to get better over time. Putting in the reps and improving a little bit each time.\n>\n> Putting in the work without expecting any external reward at first (eg views, followers, likes, etc) will pay off in the long run. - [100 Scrappy Things](https://www.florin-pop.com/blog/100-scrappy-things/)\n\n> Make the difficult habitual, the habitual easy, and the easy beautiful. - [Constantin S. Stanislavski](https://www.goodreads.com/quotes/7102271-make-the-difficult-habitual-the-habitual-easy-and-the-easy)\n\n> A good match is a **structured** dance, where players aim to **score** while they are following well-defined **rules**. This **freedom within a structure** is what makes it fun. - [ralphammer](https://ralphammer.com/how-to-get-started/)\n\n- [Pivot Points](https://longform.asmartbear.com/pivot-points/)\n\n  - non-judgmental aspects of personality that can be strengths in some contexts and weaknesses in others\n  - Pivot Points are fixed in the short term\n\n- [Hedged Bets](https://longform.asmartbear.com/predict-the-future/#hedged-bets)\n  - trading slightly less maximum upside for predictable, net-positive outcomes.\n\n> “Motivation often comes after starting, not before. Action produces momentum.”\n> [When you start a new habit, it should take less than two minutes to do.](https://jamesclear.com/how-to-stop-procrastinating)\n>\n> - James Clear\n\n> Focus is more about **not** keeping busy when you need to wait for something.  \n> Eat the boredom for a minute.\n>\n> - [[life-tips#wodenokoto]]\n\n> [4 minutes run hard enough to push heart rate to 90%, 3 minutes recover, repeat 4 times](https://news.ycombinator.com/item?id=34213181)\n>\n> - https://www.ntnu.edu/cerg/advice\n> - [Get running with Couch to 5K](https://www.nhs.uk/live-well/exercise/running-and-aerobic-exercises/get-running-with-couch-to-5k/)\n\n> [recommended routine - bodyweightfitness](https://www.reddit.com/r/bodyweightfitness/wiki/kb/recommended_routine/) - I Don't Have This Much Time!\n>\n> - Don't workout at all (saves anywhere from 20 to 60 minutes, but really, really, really, really, really, really, really, really, really not recommended)\n\n> 도무지 읽히지 않는 책 앞에서 내가 택한 방법은 펼쳐진 페이지 앞에서 멍때리기이다. 다르게 표현하면 이렇다. 펼쳐진 두 페이지 앞에서 오래 머물기.\n>\n> 책을 펼쳐놓는 것으로 충분하다. 읽지 못해도 좋다. 매일 정해진 진도를 나가야 하는 학교 수업이 아니니까. 하지만 읽지 않아도 괜찮다고 해서 펼쳐두지조차 않으면 곤란하다. 가능한 한 자주 책을 펼쳐두도록 하자. 전혀 읽지 않고 멍하니 바라보고 있다가 다시 덮게 되더라도\n>\n> - 막막한 독서. 시로군. P.10~13\n\n> I think it should be everyone's primary focus to sleep well, drink water, get outside, get active, and eat generally decently. I hate to say it, but if you're not eating a good amount of vegetables and fruit, decent protein, sleep, etc, no amount of XYZ will catch up to that detriment. - [CE02](https://news.ycombinator.com/item?id=35056071)\n\n> My real battle is doing good versus doing nothing. - [Deirdre Sullivan](https://www.npr.org/2005/08/08/4785079/always-go-to-the-funeral)\n\n[Kind Engineering](https://kind.engineering/) - How To Engineer Kindness\n\n> Sometimes magic is just someone spending more time on something than anyone else might reasonably expect. - [Teller](https://www.goodreads.com/quotes/6641527-sometimes-magic-is-just-someone-spending-more-time-on-something)\n\n---\n\n## What I read in past\n\n- [[What I read in 2026|read.2026.articles]]\n  - [[2025|read.2025.articles]]\n  - [[2024|read.2024.articles]]\n  - [[2023|read.2023.articles]]\n  - [[2022|read.2022.articles]]\n- 📝 [Gists](https://gist.github.com/Luke-SNAW)\n- 📜 [Journals](https://luke-snaw.github.io/Luke-SNAW__netlify-CMS.github.io/)\n\n---\n\n- [[journal.what-i-struggled-brag-in]]\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":false,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.115.0","enableFullHierarchyNoteTitle":false,"enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Luke SNAW","description":"Personal knowledge space"},"github":{"enableEditLink":false,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","siteUrl":"https://luke-snaw.github.io/","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}