{"pageProps":{"note":{"id":"4v2zmp2upozgjv4n665bz5r","title":"SaaS Payment vs. SaaS Billing - What Those Terms Mean and What the Differences Are","desc":"","updated":1712029042365,"created":1712028922525,"custom":{},"fname":"dev.saas-payment-vs-saas-billing","type":"note","vault":{"fsPath":"vault"},"contentHash":"81bb5b8e161b638804c1366d12db9a82","links":[],"anchors":{"billing-the-invoicing-and-revenue-management-process-in-saas":{"type":"header","text":"Billing: The Invoicing and Revenue Management Process in SaaS","value":"billing-the-invoicing-and-revenue-management-process-in-saas","line":32,"column":0,"depth":2},"payment-the-transaction-process-in-saas":{"type":"header","text":"Payment: The Transaction Process in SaaS","value":"payment-the-transaction-process-in-saas","line":68,"column":0,"depth":2},"what-to-look-for-in-a-payment-processor-for-saas":{"type":"header","text":"What to Look for in a Payment Processor for SaaS","value":"what-to-look-for-in-a-payment-processor-for-saas","line":90,"column":0,"depth":2},"top-payment-processors-for-saas-companies":{"type":"header","text":"Top Payment Processors for SaaS Companies","value":"top-payment-processors-for-saas-companies","line":108,"column":0,"depth":2},"what-to-look-for-in-a-billing-provider-for-saas":{"type":"header","text":"What to Look for in a Billing Provider for SaaS","value":"what-to-look-for-in-a-billing-provider-for-saas","line":125,"column":0,"depth":2},"top-saas-billing-providers":{"type":"header","text":"Top SaaS Billing Providers","value":"top-saas-billing-providers","line":146,"column":0,"depth":2},"multi-currency-billing-offering-pricing-flexibility-to-customers":{"type":"header","text":"Multi-Currency Billing: Offering Pricing Flexibility to Customers","value":"multi-currency-billing-offering-pricing-flexibility-to-customers","line":170,"column":0,"depth":2},"multi-currency-payments-streamlining-transactions-across-currencies":{"type":"header","text":"Multi-Currency Payments: Streamlining Transactions Across Currencies","value":"multi-currency-payments-streamlining-transactions-across-currencies","line":178,"column":0,"depth":2},"conclusion":{"type":"header","text":"Conclusion","value":"conclusion","line":193,"column":0,"depth":2}},"children":[],"parent":"ZbdkdApFqLdks4Moq92R9","data":{}},"body":"<h1 id=\"saas-payment-vs-saas-billing---what-those-terms-mean-and-what-the-differences-are\">SaaS Payment vs. SaaS Billing - What Those Terms Mean and What the Differences Are<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#saas-payment-vs-saas-billing---what-those-terms-mean-and-what-the-differences-are\"></a></h1>\n<blockquote>\n<p><a href=\"https://www.wingback.com/blog/saas-payment-vs-saas-billing\">https://www.wingback.com/blog/saas-payment-vs-saas-billing</a></p>\n</blockquote>\n<p>Running a successful SaaS business today requires a deep understanding of the industry's tools and software, and to be able to do so effectively, this also means knowing the key terminology. Two terms that often get confused when talking about SaaS subscriptions are \"payment\" and \"billing.\" Although they might seem similar, they have distinct meanings and implications for your product and the tech stack you implement.</p>\n<p>We'll dive in to the core differences between payments and billing, as well as cover what SaaS payment processing does, what billing systems do, how a payment gateway provider fits into all this, and what to look for in these tools.</p>\n<p><strong>Cheat Code: Billing vs Payment</strong></p>\n<p>It can seem a bit like a chicken-or-egg situation, and often it is once you're in the throes of collecting payments, issuing invoices, rinse and repeat. But the simplest way to think about it — and how we'll break it down below — is this: You as the business do the billing. Your customer does the payment.</p>\n<p>But of course, it's not quite that straightforward. To make matters more confusing, people often just say \"billing\" as shorthand for \"the billing process or billing system.\" This is basically a context difference or matter of semantics. To avoid and dispel the confusion, here's how this looks:</p>\n<p>Bill (noun): the physical or digital invoice or document that details what one owes for goods and services provided<br>\nTo bill (verb): to issue this invoice to request payment for those goods and services<br>\nBilling system (\"collective\" noun), AKA Billing: The whole enchilada that encompasses the entire process of managing payments, bills, and invoices to ensure you've been paid what you're owed.</p>\n<p>So both billing (literally issuing bills) and payments are part of the Billing System.</p>\n<p>Payment focuses on the actual transaction of exchanging money and involves the secure processing of customer payment information.<br>\nBilling (as a system) includes generating invoices, setting up billing cycles, and tracking outstanding payments.<br>\nBilling management involves specialized billing software to automate and streamline the invoicing and management processes.</p>\n<h2 id=\"billing-the-invoicing-and-revenue-management-process-in-saas\">Billing: The Invoicing and Revenue Management Process in SaaS<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#billing-the-invoicing-and-revenue-management-process-in-saas\"></a></h2>\n<p>Billing processes encompass the entire flow of creating, sending, and managing invoices for your SaaS product. This includes setting up pricing plans, billing cycles, generating invoices, automating invoices, and tracking outstanding unpaid invoices. You might think that Billing’s job is done once the bill is generated and that it not explicitly include the payment process, but in practice, it does.</p>\n<p>In SaaS, billing processes can be far more complex than you'd expect, and much of this is simply due to the nature of emerging subscription-based billing models. Customers may be billed on a monthly or annual subscription term, with different pricing tiers, usage limits, add-ons, and discounts to consider. Additionally, billing may need to account for mid-term changes in subscription plans, cancellations, or refunds. Some customers might even require specific <a href=\"https://www.wingback.com/blog/what-are-invoice-line-items\">line items on invoices</a>. When all is said and done, there may be dozens of configurations going into a single invoice for a single billing period.</p>\n<p>For SaaS subscriptions it is useful to think about billing as being of three types:</p>\n<p>Billing in Advance<br>\nMost SaaS subscriptions require that you pay in advance for your subscription term. So if you have a monthly subscription for 10 seats at a total of $100 then you are invoiced for that <em>before</em> the month starts. This minimizes the risk for the SaaS company, ensuring that payments are in the bank before service is extended to the customer.</p>\n<p><a href=\"https://assets-global.website-files.com/64037317422e3a2291bd4bca/65cfb711dce0000f7ec66c59_unnamed-11.png\">An illustration of two common SaaS subscription billing models: ‘Billing in advance’ and ‘Billing in arrears’. A timeline is shown left to right with the prior month on the left and the next month on the right. A vertical line descends from the center labeled ‘Now’. A box with an amount of $100.00 appears extending from the Now line to the right into the next month, it is labeled 'Billing in advance - subscription fee for next month'. Another box with an amount of $12.34 appears beneath this extending from the Now line but this time extending to the left into the past month, it is labeled 'Billing in arrears - usage fees for prior month'. Both boxes are combined below into a single invoice document dated March 1, 2024, with two invoice line items: 'Monthly subscription for March, at $100.00', and 'Usage fees for February at $12.34'. Then an 'Invoice Total of $112.34' is displayed. This shows how the different billing models for both in-advance billing and in-arrears billing can be combined in a single invoice.</a></p>\n<p>Billing in Arrears<br>\nSometimes you cannot bill in advance because you don’t know how much to charge. SaaS companies run into this when they have usage-based pricing models, like $0.02 per Gb of storage used per month. You don’t know how much to charge for this until the month is over and you can see how much your customer actually used.</p>\n<p>So for usage pricing models in SaaS the norm is to produce an invoice that charges in advance for predictable fees like users-based pricing for the upcoming month, combined with usage based fees in arrears for the month just completed.</p>\n<p>Prepaid Billing<br>\nA potential problem with the Billing in Arrears model for usage is that you are in fact extending credit to your customers: you are providing them with service before you collect the payment. If they are unable to pay their bill then you have incurred costs for delivering service that you will be unable to recoup.</p>\n<p>If this risk manifests often due to the nature of your customer base then you should consider using a Prepaid Billing model. This essentially switches everything to a strict Billing in Advance approach but it appears differently to your customer.</p>\n<p>You can handle this by either:</p>\n<ul>\n<li>Service credits: Allow your customers to purchase credits for a usage-based service. For example they could buy Storage Service Credits in blocks of 1,000 credits for $20. As they use the storage service you deduct from this credit balance in near real-time.</li>\n<li>Monetary credits: Your customer maintains a monetary balance with you like in a wallet. Recurring and usage charges are deducted from this monetary balance in near real-time.</li>\n</ul>\n<p>If the credit balance gets to zero then you stop service to the customer. The customer can always top-up their balance at any time, and it is a good idea to give customers a portal where they can view their usage and their balance in near real-time, and to issue alerts to the customer when their balance is getting low and they need to top-up to avoid service interruption.</p>\n<p><a href=\"https://assets-global.website-files.com/64037317422e3a2291bd4bca/65cfb76c41e71476ff0e0601_unnamed-12.png\">An illustration of a prepaid billing model. A timeline is shown left to right with a set of boxes like a vertical bar graph. At the left is a box symbolizing a prepaid balance showing $200. Then a box for a usage charge decrements this balance by $20. Next the resulting prepaid balance is shown to now be $180. Similarly another usage charge decrements the balance again by $30 so the balance is now $150. Then both a usage charge of $40 and a subscription charge of $80 reduce the prepaid balance to $30. Then the customer tops-up their account by $100 and the last box for the prepaid balance on the right of the diagram shows the amount now at $130.</a></p>\n<p>Your billing system should work hard to make clear on your invoices the different nature of these three billing models and the periods covered so that your customers can understand what is happening and therefore pay their bills on time without disputing them.</p>\n<p>That's why implementing a foolproof SaaS billing system that ensures accuracy and can accommodate all of these different variations is key to success.</p>\n<h2 id=\"payment-the-transaction-process-in-saas\">Payment: The Transaction Process in SaaS<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#payment-the-transaction-process-in-saas\"></a></h2>\n<p>Payment refers to the actual process of exchanging money for a product or service. In the context of digital products and services, SaaS payment processing usually means the customer paying a subscription and other associated fees to access your software and any additional services or products therein.</p>\n<p>Payments for a standard SaaS subscription business can be broken into two categories:</p>\n<p><strong>Automatic pull payments:</strong> your customer has agreed to have you debit their chosen payment method automatically and immediately for each invoice that you issue. This typically means that they have given you their credit or debit card details securely when they first setup their subscription and you can keep this on-file for future payments. Bank account direct debit arrangements (like US ACH Direct Debits and SEPA Direct Debits in Europe) also fall into this category: your customer gives you a mandate to collect payments directly from their bank account.</p>\n<p><a href=\"https://assets-global.website-files.com/64037317422e3a2291bd4bca/65cfb7a715b1da19a12e97dd_unnamed-13.png\">A sequence diagram showing SaaS subscription pull payments. It displays interactions between a customer’s bank, the customer and a SaaS Business. It starts with the Customer signing up to the SaaS Business. Then they Provide the payment method and recurring debit authorization, e.g., card or bank debit mandate. Later the SaaS Business issues an invoice to the Customer. Then they debit the payment method on file directly to the customer’s bank. This is a Pull payment because it is initiated by the SaaS Business who decides when to pull the payment from the customer’s payment method.</a></p>\n<p><strong>Customer-initiated push payments:</strong> in SaaS you often need to support this kind of payment when you start doing more large enterprise deals. Often larger customers do not want to allow you to automatically pull payments from them. Instead they want to push payments to you. They may have an internal workflow where they receive your invoice, send it to someone internally to be approved, then check the payment terms on your invoice (e.g., Net 30 or Net 90, meaning that payment is due 30 or 90 days after the invoice date) and actually perform the payment as late as possible so that they optimize their internal cash management. The payment method used in push payments like this is typically that the customer will do a bank transfer to send you the payment, or sometimes they may do a one-time card payment or pay from an online wallet.</p>\n<p><a href=\"https://assets-global.website-files.com/64037317422e3a2291bd4bca/65cfb8134cea1751a8c673d4_unnamed-14.png\">A sequence diagram showing SaaS subscription push payments. It displays interactions between a customer’s bank, the customer and a SaaS Business. It starts with the Customer signing up to the SaaS Business. Note that they do not provide a payment at this time that the SaaS Business can keep on file. Later the SaaS Business issues an invoice to the Customer including payment terms and remittance instructions. The customer is in control and can decide when to pay the invoice and instructs their bank to make the payment, e.g., via bank transfer. The customer’s bank then sends the payment to the SaaS Business. This is a Push payment because it is initiated by the Customer who decides when to push the payment to the SaaS Business.</a></p>\n<p>The diversity of the payment methods used in these two categories varies widely depending on country and customer preference: credit and debit cards, local card schemes like Cartes Bancaires in France, different bank transfer methods, online digital wallets like PayPal, Apple Pay, Venmo, or Zelle. . When your business goes global you have to support global payment methods; for example, <a href=\"https://www.wingback.com/\">Wingback</a> supports bank transfers for multiple currencies and for U.S. and E.U. banks.</p>\n<p>This single transaction involves several moving parts: the customer who is being charged, the SaaS company charging the customer, a payment gateway, and the customer's financial institution or payment method. The payment gateway acts as an intermediary, securely transmitting the customer's payment information to the appropriate financial institution for processing. For physical goods in the USA, many vendors might use Square, but for SaaS payment processing, the industry standard is Stripe.</p>\n<p>Whatever you use, the important thing is to make sure whatever SaaS payment solution is being used is secure, compliant, reliable, and offers multiple payment options.</p>\n<p>Where things can get confusing fast is distinguishing between the payment gateway like Stripe,  from the payment itself like a debit card issued by the customer’s bank, and from the billing solution and its moving parts. But all of these are part of the overall SaaS billing process.</p>\n<h2 id=\"what-to-look-for-in-a-payment-processor-for-saas\">What to Look for in a Payment Processor for SaaS<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#what-to-look-for-in-a-payment-processor-for-saas\"></a></h2>\n<p>Choosing the right payment processor for your SaaS business is crucial to ensure smooth and secure transactions (which means reliable cash flow for you) as well as a seamless experience for your customers. Here are some key features to look for in a payment processor:</p>\n<p>Multi-currency support<br>\nAs SaaS companies often cater to a global audience, a payment processor that supports multiple currencies can help streamline transactions and provide a better customer experience since customers can see prices and invoices in their local currency.</p>\n<p>Security and compliance<br>\nEnsure that the payment processor adheres to industry security standards, such as PCI-DSS, and complies with data protection regulations like GDPR.</p>\n<p>Competitive pricing and fees<br>\nPayment processing is expensive (more expensive than billing), so you should evaluate the pricing structure and transaction fees of different payment processors to find one that aligns with your budget and needs.</p>\n<p>Different payment methods have widely differing rates too, and sometimes regulators in different countries impose rate caps. So as you grow it can be worth shopping around, comparing rates, steering your customers towards lower-cost payment methods and choosing your payment providers wisely. For example, as a SaaS billing solution, Wingback connects to multiple payment processors to allow you to have choice on where you route your payment transactions.</p>\n<p>Customer support<br>\nLook for a payment processor that offers reliable customer support, as this can be crucial in resolving payment-related issues quickly. Not having good support can lead to increasing churn rates.</p>\n<h2 id=\"top-payment-processors-for-saas-companies\">Top Payment Processors for SaaS Companies<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#top-payment-processors-for-saas-companies\"></a></h2>\n<p>Stripe<br>\nStripe is a popular payment processor for SaaS companies, offering a suite of tools specifically designed for subscription-based businesses. Stripe Billing supports recurring payments, multi-currency transactions, and integration with popular SaaS billing software.</p>\n<p>Braintree<br>\nOwned by PayPal, Braintree is another widely used payment processor for SaaS businesses. It supports subscription billing, multi-currency transactions, and various payment methods, including credit cards, PayPal, Apple Pay, and Google Pay.</p>\n<p>Adyen<br>\nAdyen is a global payment processor that caters to businesses of all sizes, including SaaS companies. It supports subscription billing, multi-currency transactions, and a wide range of payment methods.</p>\n<p>Razorpay<br>\nRazorpay is a payment gateway designed specifically for businesses in India, offering a comprehensive suite of payment solutions, including subscription billing and support for multiple currencies.</p>\n<p>Authorize.Net<br>\nAuthorize.Net, a subsidiary of Visa, is a well-established payment gateway that supports businesses of all sizes, including SaaS companies. It offers subscription billing, multi-currency transactions, and a wide range of payment methods, such as credit cards, e-checks, and digital wallets like Apple Pay and Google Pay.</p>\n<h2 id=\"what-to-look-for-in-a-billing-provider-for-saas\">What to Look for in a Billing Provider for SaaS<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#what-to-look-for-in-a-billing-provider-for-saas\"></a></h2>\n<p>Choosing the right SaaS billing solution is essential for streamlining your billing process, managing revenue effectively, and ensuring a seamless experience for your customers. Here are some key features to look for in a billing provider, particularly for modern startups with sophisticated needs:</p>\n<p>Support for your desired pricing model<br>\nA good SaaS billing solution should support various pricing models, including usage-based pricing, per-seat pricing, and any combination of hybrid pricing models, to cater to your customers' long-term needs and preferences. Ask the billing providers if they really support the pricing model you desire and let them show you in a sandbox environment what it would look like if your pricing plans were rolled out using the product.</p>\n<p>Out-of-the-box frontend components<br>\nTo help your engineering team focus on your product's core features, look for billing tools that offer state-of-the-art frontend components, such as pricing pages, signup flows and customer billing portals, as part of their offering.</p>\n<p>Support for different payment gateways<br>\nIf your business requires different payment gateways for various geographical locations or specific payment methods, ensure that your billing tool is compatible with the payment gateways you need.</p>\n<p>Note that many of the subscription billing tools offered by companies that are themselves payment gateways, like Stripe, lock you in to always processing payments through their in-house payment gateway. This is an important consideration to bear in mind if you might need choice on payment gateways to cover different global payment methods, or just for price negotiation leverage.</p>\n<p>APIs for seamless integration with your sales stack<br>\nYour billing provider should offer APIs that enable seamless integration with the rest of your sales stack, as many providers may not provide this level of compatibility.</p>\n<p>Supreme customer management capabilities<br>\nChoose a billing platform that allows you to grant custom discounts, manage customer-specific plans, and offer other advanced customer management features. Many legacy systems may not provide the level of flexibility and functionality required in this area.</p>\n<h2 id=\"top-saas-billing-providers\">Top SaaS Billing Providers<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#top-saas-billing-providers\"></a></h2>\n<p>All of these providers offer the following general features as standard; the real difference lies in their approach and the kinds of SaaS businesses they're designed to support.</p>\n<ul>\n<li>Flexible pricing model support</li>\n<li>Multi-currency support</li>\n<li>Subscription management</li>\n<li>Integration with multiple payment gateways</li>\n<li>Tax compliance</li>\n<li>Revenue recognition</li>\n<li>Reporting and analytics</li>\n</ul>\n<p>Stripe Billing<br>\nAs an add-on to Stripe as a payment provider, this feature from the payments giant enables you to accomplish straightforward recurring billing.</p>\n<p>Recurly and Chargebee<br>\nRecurly and Chargebee are both considered legacy billing providers designed to manage standard recurring subscriptions and effectively bill for those accounts. For example: a flat recurring $19.99 subscription fee.</p>\n<p>Zuora<br>\nZuora is another legacy billing provider, but designed specifically for subscription-based businesses with more of a focus on flexible pricing and serves medium to large enterprise customers with complex needs.</p>\n<p>Wingback<br>\nWingback is one of the next-generation billing platforms that focuses solely on the needs of B2B SaaS companies and is designed specifically for complex and <a href=\"https://www.wingback.com/blog/hybrid-pricing-explained\">hybrid pricing plans</a>, such as offering per-seat plans combined with <a href=\"https://www.wingback.com/blog/the-different-kinds-of-usage-based-pricing-models\">any kind of usage pricing</a> and usage limits.</p>\n<h2 id=\"multi-currency-billing-offering-pricing-flexibility-to-customers\">Multi-Currency Billing: Offering Pricing Flexibility to Customers<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#multi-currency-billing-offering-pricing-flexibility-to-customers\"></a></h2>\n<p>Multi-currency billing refers to the practice of providing your customers with the option to be billed in their local currency. This can be an attractive feature for your customers, as it allows them to better understand the cost and value of your product and avoid potential currency conversion fees. Both of these can translate to faster payment completion.</p>\n<p>In a global SaaS market, offering multi-currency billing can help your business cater to customers in different regions and expand your reach. To implement multi-currency billing, you'll need to determine the appropriate pricing for each currency based on factors like market conditions, exchange rates, and local purchasing power.</p>\n<p>When using a specialized billing software, multi-currency billing can often be easily set up and managed. The software can automatically handle currency conversions, generate invoices in the chosen currency, and even account for fluctuations in exchange rates.</p>\n<h2 id=\"multi-currency-payments-streamlining-transactions-across-currencies\">Multi-Currency Payments: Streamlining Transactions Across Currencies<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#multi-currency-payments-streamlining-transactions-across-currencies\"></a></h2>\n<p>While multi-currency billing focuses on invoicing customers in their local currency, multi-currency payments refer to the process of accepting and processing payments in multiple currencies. This enables customers to pay for your SaaS product in their preferred currency, making the transaction process more seamless and user-friendly.</p>\n<p>To support multi-currency payments, your SaaS payment processing gateway must be able to accept and process transactions in multiple currencies. This involves working with your payment provider to enable the desired currencies and ensure accurate currency conversion rates.</p>\n<p>Additionally, when dealing with multi-currency payments, it's essential to consider the impact of currency fluctuations on your business revenue. You may need to implement strategies to manage foreign exchange risk, such as using currency hedging tools or working with a foreign exchange specialist.</p>\n<p>Understanding the Differences<br>\nWhile both multi-currency billing and multi-currency payments involve dealing with multiple currencies, their roles and implications differ:</p>\n<ul>\n<li>Multi-currency billing focuses on invoicing customers in their local currency, allowing them to better understand the cost of your SaaS product and avoid conversion fees.</li>\n<li>Multi-currency payments involve accepting and processing transactions in multiple currencies and supporting local payment methods in different countries, providing a seamless payment experience for customers and potentially increasing your global reach.</li>\n<li>Implementing multi-currency billing requires determining appropriate pricing for each currency and using billing software that supports multi-currency invoicing, while multi-currency payments require a payment gateway that can accept and process transactions in multiple currencies and manage foreign exchange risk.</li>\n</ul>\n<h2 id=\"conclusion\">Conclusion<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#conclusion\"></a></h2>\n<p>Any successful SaaS company today requires a strong foundation in understanding both payments, payment processing, billing, and billing management systems. Before signing up for any sort of billing tools or payment providers, make sure they check all the boxes for your specific requirements.</p>","noteIndex":{"id":"Iy0MoL0KnL55Br3AfTS2C","title":"Luke","desc":"","updated":1766965759366,"created":1644449449778,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"a724de3efd251cf89fe82a5860d9008b","links":[{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"life-tips","position":{"start":{"line":43,"column":5,"offset":2710},"end":{"line":43,"column":29,"offset":2734},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"life-tips","anchorHeader":"wodenokoto"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2026.articles","alias":"What I read in 2026","position":{"start":{"line":72,"column":3,"offset":4440},"end":{"line":72,"column":45,"offset":4482},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2026.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2025.articles","alias":"2025","position":{"start":{"line":73,"column":5,"offset":4487},"end":{"line":73,"column":32,"offset":4514},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2025.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2024.articles","alias":"2024","position":{"start":{"line":74,"column":5,"offset":4519},"end":{"line":74,"column":32,"offset":4546},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2024.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2023.articles","alias":"2023","position":{"start":{"line":75,"column":5,"offset":4551},"end":{"line":75,"column":32,"offset":4578},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2023.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2022.articles","alias":"2022","position":{"start":{"line":76,"column":5,"offset":4583},"end":{"line":76,"column":32,"offset":4610},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2022.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"journal.what-i-struggled-brag-in","position":{"start":{"line":82,"column":3,"offset":4746},"end":{"line":82,"column":39,"offset":4782},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"journal.what-i-struggled-brag-in"}}],"anchors":{"what-i-read-in-past":{"type":"header","text":"What I read in past","value":"what-i-read-in-past","line":76,"column":0,"depth":2}},"children":["zd4mq442jike0pr0wba1u3m","6hzeqsofq67gdk88flxlkhp","778ijii93yu5uwnrwmn5zi4","g1fngdjl25nes6fs3lip602","ZbdkdApFqLdks4Moq92R9","uoc5hhki3o4py15cesddu8q","9qf7j06jtdkm6rnx9ymvwb0","5zn10cvj7ajy2gh2is5nqmg","4qo9ma0z0yu1czns6pxl7y5","ok0e729ho7o09xetujkxc0m","GR5x8HnNFEN6fU2UBSEIK","yirtnlj8q24yutcf3ss1xqy","eq0wc6t7wl2wv221yb68ro4","7x2fnv4j6gxts08qk0jguny","ettkt3iClONnxpbGwBVLl","7l4knev6v613tbuoskvmbdg","hvh5bud6yp7dc89tuh95tr9","4fvoqrplw0cweo554usbjos","f8qsfql0a9v8thpeo82udfa","1swsbrhqi9jk41v9eodyi5q","SQqYupi6EFddTerBA8RRD","hjNeNc1F2JUh0lTWanH4h","qf0l4wbrc9jgooyzexmbq5v","o7xruzrah5wzqetottecss7","z1zo2mp6ddji5p317i4x9xw","v06c2tjelh341x4resa50fh","0yqesk4rcffwgyuab5x8rfa","sy2vkbtyu671chkvgn1yt8j","ufixpmxoydiccoh59kphrib","alswadkx4wb05y1z9iwfzfv","1daut9dpw70xd0zh5a7j5p4"],"parent":null,"data":{},"body":"\nHi there 👋. I'm a Front-end developer.\n\n---\n\n- 현실은 인간의 연산으로 완전히 파악할 수 없는 복잡계. 주어진 상황과 능력으로 할 수 있는 최선의 적응은 단순함과 꾸준함.\n\n  - 파산을 면하는 선에서 여러가지를 해보고 자신에게 맞는 걸 위주로 꾸준히. 그를 위해 단순, 편안, 쾌적함이 필요.\n\n- 🥱 -> 🤔💡🌱 - [On The Death of Daydreaming](https://www.afterbabel.com/p/on-the-death-of-daydreaming)\n  - boredom -> easy fun -> art -> profit?\n\n> I've often described my motivation for building software to others using imagery: I like to go find a secluded beach, build a large, magnificent sand castle, and then walk away. Will anyone notice? Probably not. Will the waves eventually destroy it? Yep. Did I still get immense satisfaction? Absolutely. - [aliasxneo](https://news.ycombinator.com/item?id=41497113)\n\n> We love to see the process, not just the result. The imperfections in your work can be beautiful if they show your struggle for perfection, not a lack of care. - [ralphammer](https://ralphammer.com/is-perfection-boring/)\n\n> Simplicity, even if it sacrifices some ideal functionality has better survival characteristics than the-right-thing. - [The Rise of Worse is Better](https://www.dreamsongs.com/RiseOfWorseIsBetter.html)\n\n> [Roberto Blake was talking about making 100 crappy videos](https://www.youtube.com/watch?v=OnUBaQ1Sp_E) to get better over time. Putting in the reps and improving a little bit each time.\n>\n> Putting in the work without expecting any external reward at first (eg views, followers, likes, etc) will pay off in the long run. - [100 Scrappy Things](https://www.florin-pop.com/blog/100-scrappy-things/)\n\n> Make the difficult habitual, the habitual easy, and the easy beautiful. - [Constantin S. Stanislavski](https://www.goodreads.com/quotes/7102271-make-the-difficult-habitual-the-habitual-easy-and-the-easy)\n\n> A good match is a **structured** dance, where players aim to **score** while they are following well-defined **rules**. This **freedom within a structure** is what makes it fun. - [ralphammer](https://ralphammer.com/how-to-get-started/)\n\n- [Pivot Points](https://longform.asmartbear.com/pivot-points/)\n\n  - non-judgmental aspects of personality that can be strengths in some contexts and weaknesses in others\n  - Pivot Points are fixed in the short term\n\n- [Hedged Bets](https://longform.asmartbear.com/predict-the-future/#hedged-bets)\n  - trading slightly less maximum upside for predictable, net-positive outcomes.\n\n> “Motivation often comes after starting, not before. Action produces momentum.”\n> [When you start a new habit, it should take less than two minutes to do.](https://jamesclear.com/how-to-stop-procrastinating)\n>\n> - James Clear\n\n> Focus is more about **not** keeping busy when you need to wait for something.  \n> Eat the boredom for a minute.\n>\n> - [[life-tips#wodenokoto]]\n\n> [4 minutes run hard enough to push heart rate to 90%, 3 minutes recover, repeat 4 times](https://news.ycombinator.com/item?id=34213181)\n>\n> - https://www.ntnu.edu/cerg/advice\n> - [Get running with Couch to 5K](https://www.nhs.uk/live-well/exercise/running-and-aerobic-exercises/get-running-with-couch-to-5k/)\n\n> [recommended routine - bodyweightfitness](https://www.reddit.com/r/bodyweightfitness/wiki/kb/recommended_routine/) - I Don't Have This Much Time!\n>\n> - Don't workout at all (saves anywhere from 20 to 60 minutes, but really, really, really, really, really, really, really, really, really not recommended)\n\n> 도무지 읽히지 않는 책 앞에서 내가 택한 방법은 펼쳐진 페이지 앞에서 멍때리기이다. 다르게 표현하면 이렇다. 펼쳐진 두 페이지 앞에서 오래 머물기.\n>\n> 책을 펼쳐놓는 것으로 충분하다. 읽지 못해도 좋다. 매일 정해진 진도를 나가야 하는 학교 수업이 아니니까. 하지만 읽지 않아도 괜찮다고 해서 펼쳐두지조차 않으면 곤란하다. 가능한 한 자주 책을 펼쳐두도록 하자. 전혀 읽지 않고 멍하니 바라보고 있다가 다시 덮게 되더라도\n>\n> - 막막한 독서. 시로군. P.10~13\n\n> I think it should be everyone's primary focus to sleep well, drink water, get outside, get active, and eat generally decently. I hate to say it, but if you're not eating a good amount of vegetables and fruit, decent protein, sleep, etc, no amount of XYZ will catch up to that detriment. - [CE02](https://news.ycombinator.com/item?id=35056071)\n\n> My real battle is doing good versus doing nothing. - [Deirdre Sullivan](https://www.npr.org/2005/08/08/4785079/always-go-to-the-funeral)\n\n[Kind Engineering](https://kind.engineering/) - How To Engineer Kindness\n\n> Sometimes magic is just someone spending more time on something than anyone else might reasonably expect. - [Teller](https://www.goodreads.com/quotes/6641527-sometimes-magic-is-just-someone-spending-more-time-on-something)\n\n---\n\n## What I read in past\n\n- [[What I read in 2026|read.2026.articles]]\n  - [[2025|read.2025.articles]]\n  - [[2024|read.2024.articles]]\n  - [[2023|read.2023.articles]]\n  - [[2022|read.2022.articles]]\n- 📝 [Gists](https://gist.github.com/Luke-SNAW)\n- 📜 [Journals](https://luke-snaw.github.io/Luke-SNAW__netlify-CMS.github.io/)\n\n---\n\n- [[journal.what-i-struggled-brag-in]]\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":false,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.115.0","enableFullHierarchyNoteTitle":false,"enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Luke SNAW","description":"Personal knowledge space"},"github":{"enableEditLink":false,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","siteUrl":"https://luke-snaw.github.io/","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}