{"pageProps":{"note":{"id":"5rogevg8i90bq52acpx8kny","title":"A receipt printer cured my procrastination","desc":"","updated":1749977162597,"created":1749781810153,"tags":"test","custom":{},"fname":"life-tips.a-thermal-receipt-printer-cured-my-procrastination","type":"note","vault":{"fsPath":"vault"},"contentHash":"43f33b2303ebea2070a02d5264228db1","links":[{"type":"frontmatterTag","from":{"fname":"life-tips.a-thermal-receipt-printer-cured-my-procrastination","id":"5rogevg8i90bq52acpx8kny","vaultName":"vault"},"value":"tags.test","alias":"test","xvault":false,"to":{"fname":"tags.test"}},{"from":{"fname":"diary.2025","id":"npakrnxm9grrjyyt6jzgjxp","vaultName":"vault"},"type":"backlink","position":{"start":{"line":455,"column":21,"offset":9776},"end":{"line":455,"column":128,"offset":9883},"indent":[]},"value":"life-tips.a-thermal-receipt-printer-cured-my-procrastination"}],"anchors":{"my-fight-against-procrastination":{"type":"header","text":"My fight against procrastination","value":"my-fight-against-procrastination","line":35,"column":0,"depth":2},"why-video-games-hook-us":{"type":"header","text":"Why video games hook us","value":"why-video-games-hook-us","line":45,"column":0,"depth":2},"how-to-apply-the-feedback-loop-to-our-tasks":{"type":"header","text":"How to apply the feedback loop to our tasks","value":"how-to-apply-the-feedback-loop-to-our-tasks","line":80,"column":0,"depth":2},"how-to-improve-feedback":{"type":"header","text":"How to improve feedback","value":"how-to-improve-feedback","line":115,"column":0,"depth":2},"how-to-make-this-easy-in-practice":{"type":"header","text":"How to make this easy in practice","value":"how-to-make-this-easy-in-practice","line":131,"column":0,"depth":2},"be-flexible":{"type":"header","text":"Be flexible!","value":"be-flexible","line":149,"column":0,"depth":2},"get-started":{"type":"header","text":"Get Started!","value":"get-started","line":163,"column":0,"depth":2},"from-sticky-notes-to-receipt-printer":{"type":"header","text":"From sticky notes to receipt printer","value":"from-sticky-notes-to-receipt-printer","line":181,"column":0,"depth":2},"one-more-thing":{"type":"header","text":"One more thing","value":"one-more-thing","line":213,"column":0,"depth":2}},"children":[],"parent":"ettkt3iClONnxpbGwBVLl","data":{}},"body":"<h1 id=\"a-receipt-printer-cured-my-procrastination\">A receipt printer cured my procrastination<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#a-receipt-printer-cured-my-procrastination\"></a></h1>\n<p>I'll use <a href=\"https://www.3m.com/3M/en_US/p/c/office-supplies/flags-tabs-page-markers/i/consumer/office/\">3M Flags, Tabs &#x26; Page Markers</a></p>\n<blockquote>\n<p><a href=\"https://www.laurieherault.com/articles/a-thermal-receipt-printer-cured-my-procrastination\">https://www.laurieherault.com/articles/a-thermal-receipt-printer-cured-my-procrastination</a></p>\n</blockquote>\n<ul>\n<li>Video games are addictive due to their fast feedback loops, providing immediate reactions and rewards.</li>\n<li>To combat procrastination, tasks should be broken down into smaller, manageable micro-tasks.</li>\n<li>Using sticky notes for tasks adds a physical element that makes them harder to ignore and provides satisfying feedback when completed.</li>\n<li>Starting the day with easy tasks builds momentum and encourages continued productivity throughout the day.</li>\n<li>A thermal receipt printer can streamline the task management process by allowing users to print tasks quickly and efficiently.</li>\n<li>The receipt printer reduces the friction of daily preparation and increases the likelihood of completing tasks consistently.</li>\n<li>Custom software can enhance task management by visually organizing tasks and subtasks, making it easier to stay focused.</li>\n<li>Maintaining flexibility in task management allows for adjustments and adaptations as needed, preventing feelings of overwhelm.</li>\n<li>Implementing these strategies can significantly boost productivity, especially for those struggling with procrastination and ADHD.</li>\n</ul>\n<hr>\n<p>Why can I focus for hours on a game but procrastinate on simple tasks? I finally cracked the code using thermal receipt printer and game design.</p>\n<hr>\n<p>By Laurie Hérault</p>\n<hr>\n<p>Why can I focus for hours on a game but procrastinate when writing an email? For over 20 years, I've tried everything to boost my productivity. I've read dozens of books and tested many methods. Nothing made a real difference. But I finally found a solution by understanding what makes video games addictive. And a thermal receipt printer will become the best investment of my life.</p>\n<h2 id=\"my-fight-against-procrastination\">My fight against procrastination<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#my-fight-against-procrastination\"></a></h2>\n<p>I started my business when I was 21 (I'm now 39). I built custom apps and did consulting for accounting software, invoicing systems, and point-of-sale tools.</p>\n<p>Procrastination has always been my biggest struggle. The only way I could get things done was by relying on stress, coming from clients or financial pressure. That worked for a while, but it cost me my health (I burned out) and my business (I went bankrupt).</p>\n<p>I noticed that I have no problem spending hours fully focused on a video game. If I can focus on a game, then my brain must also be capable of focusing on other tasks. So I naturally started asking myself why it's so easy to get hooked by a game, and how I could apply that same effect to tasks I struggle to complete.</p>\n<p>It turns out that many of the struggles I've had throughout my life are linked to ADHD (Attention Deficit Disorder). The goal of this article isn't to focus on ADHD, but it's important to mention. ADHD affects many people, often without them even knowing it, in various ways and at different levels.</p>\n<h2 id=\"why-video-games-hook-us\">Why video games hook us<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#why-video-games-hook-us\"></a></h2>\n<p>To understand what makes a video game addictive, let's take first-person shooters (FPS) as an example. FPS games are among the most popular and addictive games.</p>\n<p>An FPS is built around a simple loop: <strong>Aim</strong> <strong>→</strong> <strong>Shoot</strong> <strong>→</strong> <strong>Hit</strong> or <strong>Miss</strong>. This is the <strong>game loop</strong>. The outcome, hit or miss, is immediately shown through sounds or visuals. This immediate reaction is called <strong>feedback</strong>.</p>\n<p><img src=\"/marketing/game-loop-diagram.png\" alt=\"Game Loop Diagram\"></p>\n<p>For a game to be addictive, the game loop must repeat frequently and give strong feedback. Imagine an FPS where you only meet an enemy every 30 minutes. That wouldn't be engaging. The loop must repeat quickly to keep you interested.</p>\n<p>Feedback in FPS games has improved a lot over time. Early FPS games only showed a simple blood splash when you hit an enemy. Modern games provide much stronger feedback. Now, when you hit an enemy, you might see:</p>\n<ul>\n<li>the crosshair briefly changes to confirm the hit</li>\n<li>damage numbers pop up above the enemy</li>\n<li>sound effects</li>\n<li>enemy death animations</li>\n<li>a progress bar filling up</li>\n<li>a new skill unlocked</li>\n<li>random reward</li>\n<li>and more...</li>\n</ul>\n<p>Note that a game can have several game loops. For example, there can be another loop for finding random equipment for your character. Feedback can also come from outside the main loop, such as loot boxes or side missions.</p>\n<p>For a game loop to be addictive, other factors matter too. You need to personally enjoy the type of game, and the challenge must match your skill level. If it's too easy or too hard, you won't be hooked. There are dozens of other factors, unique to each player's personality and preferences.</p>\n<p>When all these elements come together, each game loop gives you a small dose of dopamine and creates a state of <strong>flow</strong>. In this state, we're fully focused, we lose track of time, and it's easier to handle complex tasks.</p>\n<p>One final point: Video games are <strong>easy to start</strong>. They require very little motivation or discipline to start playing.</p>\n<p>Key Takeaways:</p>\n<ul>\n<li>The game loop should repeat often.</li>\n<li>Feedback from the loop should be strong.</li>\n<li>Games are easy to start, even with low motivation.</li>\n</ul>\n<h2 id=\"how-to-apply-the-feedback-loop-to-our-tasks\">How to apply the feedback loop to our tasks<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#how-to-apply-the-feedback-loop-to-our-tasks\"></a></h2>\n<p>Based on what we've just seen, our real-life <strong>game loop</strong> is made up of completing tasks and habits throughout the day.</p>\n<p>Our first goal is to repeat this game loop as many times as possible each day. A simple solution is breaking tasks into smaller parts. Let's take an example everyone can relate to: cleaning the house. At first glance, you might break down \"Clean the house\" like this:</p>\n<ul>\n<li>Clean the house\n<ul>\n<li>Clean the kitchen</li>\n<li>Clean the office</li>\n<li>Clean the bedroom</li>\n<li>...</li>\n</ul>\n</li>\n</ul>\n<p>If these three tasks take about an hour, that's only three game loops. Another problem is starting a task. Cleaning your bedroom might take 20 minutes, which feels too long when you're not motivated. So you procrastinate.</p>\n<p>My solution is breaking things down even further:</p>\n<ul>\n<li>Clean the house\n<ul>\n<li>Kitchen\n<ul>\n<li>Wash dishes</li>\n<li>Wipe down surfaces</li>\n<li>Clean floor</li>\n<li>Take out trash</li>\n</ul>\n</li>\n<li>Bathroom\n<ul>\n<li>Clean shower</li>\n<li>Clean toilet</li>\n<li>Clean sink and mirror</li>\n<li>Clean floor</li>\n</ul>\n</li>\n<li>Bedroom\n<ul>\n<li>Air out the bed</li>\n<li>Make the bed</li>\n<li>Organize closet</li>\n<li>Clean floor</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p>The rule is simple: the more you procrastinate on a task, the more you should break it down into micro-tasks, even ones that take just 2 to 5 minutes in extreme cases.</p>\n<h2 id=\"how-to-improve-feedback\">How to improve feedback<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#how-to-improve-feedback\"></a></h2>\n<p>Now that we have our game loop, we are going to boost the feedback. To do this, I recommend using sticky notes. Write each task on a sticky note. When you finish the task, crumple the note into a ball and throw it into a clear jar.</p>\n<p>This gives us extra feedback: crumpling the paper, the satisfying sound, and seeing our progress in the clear jar.</p>\n<p>One important point: writing your task on a sticky note makes it real. It's no longer just words on a screen. It's harder to procrastinate on something physically in front of you.</p>\n<p><img src=\"/marketing/sticky-notes-illustration.png\" alt=\"Sticky Notes Illustration\"></p>\n<p>Key Takeaways:</p>\n<ul>\n<li>Use sticky notes for your tasks. (The task becomes hard to ignore.)</li>\n<li>Once the task is done, crumple the note into a ball. (Feedback)</li>\n<li>Drop your ball into a transparent jar. (Feedback)</li>\n</ul>\n<h2 id=\"how-to-make-this-easy-in-practice\">How to make this easy in practice<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#how-to-make-this-easy-in-practice\"></a></h2>\n<p>To make this system easy and get your day started, begin with simple, routine tasks. Think about role-playing games. Early levels are easy and help build momentum for the harder levels later. That's why it's important to put your daily habits on sticky notes. Start your day with easy wins.</p>\n<p>For example, the first sticky note waiting for me each morning is to make coffee. When I sit at my computer, my first task is a quick two-minute warmup. I spend one minute typing text in software to measure my typing speed. Then I spend one minute practicing keyboard shortcuts. I do these two tasks every morning without fail.</p>\n<p>Between waking up and starting work, I complete around ten sticky notes with easy, routine habits. This builds momentum and makes it easier to keep working throughout the day.</p>\n<p>I strongly recommend including these morning habits in your sticky note system. It allows you to start the day with quick and easy tasks. If your first task is the hardest of the day, you're more likely to procrastinate. But when you start with your simple morning routine, you gain momentum that makes the rest of your day easier.</p>\n<p>I also make sure to prepare these tasks the night before. This way, I can immediately start working without having to think about creating sticky notes in the morning.</p>\n<p>Key Takeaways:</p>\n<ul>\n<li>Use sticky notes with your morning routine to start your day strong.</li>\n<li>Begin your workday with quick, easy tasks.</li>\n<li>Prepare your sticky notes the night before, so you can immediately start working in the morning without extra planning.</li>\n</ul>\n<h2 id=\"be-flexible\">Be flexible!<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#be-flexible\"></a></h2>\n<p>My main advice is to stay flexible with this method. I strongly recommend always starting your day with your first tasks and habits on sticky notes. However, this initial momentum might be enough for you to remain productive for the entire day.</p>\n<p>If later in the day you notice you're starting to procrastinate, immediately return to the system. Take a few minutes to refocus, clearly define the next 3 to 5 tasks, write them down on sticky notes, and start working on them right away. Repeat this as many times as necessary.</p>\n<p>Some tasks can't easily be broken into smaller steps. In that case, break them down by time. For example: \"Clean for 10 minutes.\"</p>\n<p>For complex tasks, you might realize your original plan isn't ideal once you begin working. That's fine. You're already in motion, so continue working flexibly, and use your existing sticky notes whenever you feel you've earned feedback.</p>\n<p>You might also have tasks you've procrastinated on for months or even years, causing them to accumulate significantly. For example, maybe your inbox contains thousands of emails. You've probably imagined one day you'll suddenly feel motivated and clear them all at once. That day will never come. Instead, create a daily sticky note that requires you to process all new emails plus a specific number of older emails. It might take months to clear your inbox, but at least you've stopped procrastinating.</p>\n<p>Another scenario that regularly happens to me is planning about ten sticky notes, then completely forgetting about them. I end up doing the tasks but without using the sticky notes for feedback. That's completely fine. In fact, it means I was in a productive flow state, and my objective was accomplished!</p>\n<h2 id=\"get-started\">Get Started!<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#get-started\"></a></h2>\n<p>I'm sure you've already read dozens of articles and watched countless YouTube videos about productivity, procrastination, and efficiency. Now you absolutely need to take action! No excuses.</p>\n<p>Try this method! No sticky notes? Grab some paper and scissors, and prepare your tasks for tomorrow. Don't have a clear jar? Use a regular glass. For the next few days, use this system and see if it helps. Do you find it easier to complete your tasks? Do you forget fewer important things?</p>\n<p>Keep testing for a few weeks. Think of it like going to the gym. You won't become a bodybuilder with huge muscles after your first workout. Turn this system into a habit!</p>\n<p><img src=\"/marketing/two-column-diagram-sticky-notes.png\" alt=\"Two Column Diagram - Sticky Notes\"></p>\n<p>Here's why this system works so well:</p>\n<ul>\n<li>Breaking tasks into small steps allows us to repeat our game loop frequently.</li>\n<li>Starting the day with easy wins builds momentum and makes it easier to continue.</li>\n<li>Crumpling completed tasks and tossing them into a clear jar provides satisfying feedback.</li>\n<li>The clear jar visually highlights progress and strengthens feedback.</li>\n<li>Tasks on sticky notes feel real and tangible.</li>\n</ul>\n<h2 id=\"from-sticky-notes-to-receipt-printer\">From sticky notes to receipt printer<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#from-sticky-notes-to-receipt-printer\"></a></h2>\n<p>Let's be clear. This system works extremely well. It's better than anything else I've tried in my life. And trust me, I've tested many methods that promised to boost productivity. But one big problem remained. It took too long and was painful to write all those sticky notes. Writing only three tasks a day wasn't enough. I needed twenty, thirty, or sometimes even more. On lazy days, I skipped writing notes, and my productivity collapsed.</p>\n<p>One day, I saw a Reddit post about someone using a receipt printer to print daily tasks. I suddenly realized I had the same idea years ago while setting up checkout systems for clients. But, as usual, I procrastinated.</p>\n<p>A receipt printer is perfect for replacing my sticky-note system. I can easily print dozens of habits. These printers are fast, and they automatically cut each ticket. They're also cheap to run. They don't need ink, only paper. A good printer (For example Epson TM-T20III) costs about $150, and each 80-meter roll costs around $3. One roll can print thousands of tasks.</p>\n<p><img src=\"/marketing/receipt-printer-illustration.png\" alt=\"Receipt Printer Illustration\"></p>\n<p>I created a simple script to print my daily habits. I have a separate list for each weekday because my habits and tasks vary.</p>\n<p>Since the printer can handle a large number of tasks, I added habits and tasks I didn't usually write on sticky notes, making my system even more robust.</p>\n<p>I still use sticky notes for my main work, but much of my daily routine is now managed by my receipt printer. After a few weeks, I noticed something important: I haven't missed a single habit, not even one.</p>\n<p>My productivity had already improved significantly with the sticky-note system. But adding the printer made me truly consistent, boosting my productivity even more.</p>\n<p>Ironically, I previously built a habit-tracking app but always forgot to use it. With this new system, I haven't missed tracking my habits even once.</p>\n<p><img src=\"/marketing/two-column-diagram-receipt.png\" alt=\"Two Column Diagram - Receipt\"></p>\n<p>Summary of the benefits of the receipt printer:</p>\n<ul>\n<li>Printing tasks using a receipt printer removes the friction of daily preparation.</li>\n<li>With this system, it will be easy to print more tasks, increasing the system's efficiency.</li>\n<li>Massive reduction in the chances of skipping the system for a day due to procrastination.</li>\n</ul>\n<p><img src=\"/marketing/thermal-receipt-printer-clear-jar.jpeg\" alt=\"To-do list with thermal receipt printer and clear jar\"></p>\n<p>To-do list with thermal receipt printer and clear jar</p>\n<h2 id=\"one-more-thing\">One more thing<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#one-more-thing\"></a></h2>\n<p>But there's still one problem. I still waste time writing tasks on sticky notes during the day. My printing script isn't practical. If I want to add habits or new tasks, I have to edit the script manually. That's inconvenient for everyday use, especially when tasks change daily. I needed a simpler solution.</p>\n<p>My first idea was to connect existing software to my printer. But I'm not happy with most existing task apps. They don't easily break down tasks into smaller pieces. Most task apps use a simple, single-level list. Visually splitting tasks into subtasks is impossible. Some task managers offer hierarchical task lists, allowing subtasks. But this creates another problem: the lists become very long and overwhelming.</p>\n<p>A second issue is losing the big picture. Some tasks need breaking down, others don't. This makes task lists messy and hard to manage.</p>\n<p>My third problem is that I need software that's extremely fast to use (ideally keyboard-only for even more speed), so I can create a lot of tasks without feeling frustrated by the UX.</p>\n<p>I spent a lot of time searching for a solution. I tested multiple ideas, wasting countless hours. But I finally found a simple yet brilliant solution. Instead of displaying hierarchical tasks vertically, why not do it horizontally, dividing each level into columns? Each time I click a task, its subtasks appear clearly in the next column. This helps me keep the big picture, filtering tasks I don't need right now.</p>\n<p>You are currently reading the print version of this article. On the web version, you'll find an interactive demo of the concept in this spot.</p>\n<p>Test the concept in this <strong>interactive</strong> demo:</p>\n<p>I built custom software based on this idea and connected it directly to my printer. When I procrastinate, I can quickly break a task into subtasks without messing with my project structure, because subtasks appear in another column. And I can easily print just that column.</p>\n<p>This method, combined with the printer and my app, has changed my life over the past few months. I now have strong, steady productivity, which is a huge daily victory for someone with ADHD.</p>\n<p>Without exaggerating, I believe I've doubled or tripled my productivity. Of course, before this system, I sometimes had very productive days. But I also had many days when I did almost no meaningful work tasks. Those very low productivity days have completely vanished from my life.</p>\n<p>You can watch the video on the web version of this article.</p>\n<hr>\n<h2 id=\"tags\">Tags<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#tags\"></a></h2>\n<ol>\n<li><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">test (Private)</a></li>\n</ol>","noteIndex":{"id":"Iy0MoL0KnL55Br3AfTS2C","title":"Luke","desc":"","updated":1766965759366,"created":1644449449778,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"a724de3efd251cf89fe82a5860d9008b","links":[{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"life-tips","position":{"start":{"line":43,"column":5,"offset":2710},"end":{"line":43,"column":29,"offset":2734},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"life-tips","anchorHeader":"wodenokoto"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2026.articles","alias":"What I read in 2026","position":{"start":{"line":72,"column":3,"offset":4440},"end":{"line":72,"column":45,"offset":4482},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2026.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2025.articles","alias":"2025","position":{"start":{"line":73,"column":5,"offset":4487},"end":{"line":73,"column":32,"offset":4514},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2025.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2024.articles","alias":"2024","position":{"start":{"line":74,"column":5,"offset":4519},"end":{"line":74,"column":32,"offset":4546},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2024.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2023.articles","alias":"2023","position":{"start":{"line":75,"column":5,"offset":4551},"end":{"line":75,"column":32,"offset":4578},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2023.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2022.articles","alias":"2022","position":{"start":{"line":76,"column":5,"offset":4583},"end":{"line":76,"column":32,"offset":4610},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2022.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"journal.what-i-struggled-brag-in","position":{"start":{"line":82,"column":3,"offset":4746},"end":{"line":82,"column":39,"offset":4782},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"journal.what-i-struggled-brag-in"}}],"anchors":{"what-i-read-in-past":{"type":"header","text":"What I read in past","value":"what-i-read-in-past","line":76,"column":0,"depth":2}},"children":["zd4mq442jike0pr0wba1u3m","6hzeqsofq67gdk88flxlkhp","778ijii93yu5uwnrwmn5zi4","g1fngdjl25nes6fs3lip602","ZbdkdApFqLdks4Moq92R9","uoc5hhki3o4py15cesddu8q","9qf7j06jtdkm6rnx9ymvwb0","5zn10cvj7ajy2gh2is5nqmg","4qo9ma0z0yu1czns6pxl7y5","ok0e729ho7o09xetujkxc0m","GR5x8HnNFEN6fU2UBSEIK","yirtnlj8q24yutcf3ss1xqy","eq0wc6t7wl2wv221yb68ro4","7x2fnv4j6gxts08qk0jguny","ettkt3iClONnxpbGwBVLl","7l4knev6v613tbuoskvmbdg","hvh5bud6yp7dc89tuh95tr9","4fvoqrplw0cweo554usbjos","f8qsfql0a9v8thpeo82udfa","1swsbrhqi9jk41v9eodyi5q","SQqYupi6EFddTerBA8RRD","hjNeNc1F2JUh0lTWanH4h","qf0l4wbrc9jgooyzexmbq5v","o7xruzrah5wzqetottecss7","z1zo2mp6ddji5p317i4x9xw","v06c2tjelh341x4resa50fh","0yqesk4rcffwgyuab5x8rfa","sy2vkbtyu671chkvgn1yt8j","ufixpmxoydiccoh59kphrib","alswadkx4wb05y1z9iwfzfv","1daut9dpw70xd0zh5a7j5p4"],"parent":null,"data":{},"body":"\nHi there 👋. I'm a Front-end developer.\n\n---\n\n- 현실은 인간의 연산으로 완전히 파악할 수 없는 복잡계. 주어진 상황과 능력으로 할 수 있는 최선의 적응은 단순함과 꾸준함.\n\n  - 파산을 면하는 선에서 여러가지를 해보고 자신에게 맞는 걸 위주로 꾸준히. 그를 위해 단순, 편안, 쾌적함이 필요.\n\n- 🥱 -> 🤔💡🌱 - [On The Death of Daydreaming](https://www.afterbabel.com/p/on-the-death-of-daydreaming)\n  - boredom -> easy fun -> art -> profit?\n\n> I've often described my motivation for building software to others using imagery: I like to go find a secluded beach, build a large, magnificent sand castle, and then walk away. Will anyone notice? Probably not. Will the waves eventually destroy it? Yep. Did I still get immense satisfaction? Absolutely. - [aliasxneo](https://news.ycombinator.com/item?id=41497113)\n\n> We love to see the process, not just the result. The imperfections in your work can be beautiful if they show your struggle for perfection, not a lack of care. - [ralphammer](https://ralphammer.com/is-perfection-boring/)\n\n> Simplicity, even if it sacrifices some ideal functionality has better survival characteristics than the-right-thing. - [The Rise of Worse is Better](https://www.dreamsongs.com/RiseOfWorseIsBetter.html)\n\n> [Roberto Blake was talking about making 100 crappy videos](https://www.youtube.com/watch?v=OnUBaQ1Sp_E) to get better over time. Putting in the reps and improving a little bit each time.\n>\n> Putting in the work without expecting any external reward at first (eg views, followers, likes, etc) will pay off in the long run. - [100 Scrappy Things](https://www.florin-pop.com/blog/100-scrappy-things/)\n\n> Make the difficult habitual, the habitual easy, and the easy beautiful. - [Constantin S. Stanislavski](https://www.goodreads.com/quotes/7102271-make-the-difficult-habitual-the-habitual-easy-and-the-easy)\n\n> A good match is a **structured** dance, where players aim to **score** while they are following well-defined **rules**. This **freedom within a structure** is what makes it fun. - [ralphammer](https://ralphammer.com/how-to-get-started/)\n\n- [Pivot Points](https://longform.asmartbear.com/pivot-points/)\n\n  - non-judgmental aspects of personality that can be strengths in some contexts and weaknesses in others\n  - Pivot Points are fixed in the short term\n\n- [Hedged Bets](https://longform.asmartbear.com/predict-the-future/#hedged-bets)\n  - trading slightly less maximum upside for predictable, net-positive outcomes.\n\n> “Motivation often comes after starting, not before. Action produces momentum.”\n> [When you start a new habit, it should take less than two minutes to do.](https://jamesclear.com/how-to-stop-procrastinating)\n>\n> - James Clear\n\n> Focus is more about **not** keeping busy when you need to wait for something.  \n> Eat the boredom for a minute.\n>\n> - [[life-tips#wodenokoto]]\n\n> [4 minutes run hard enough to push heart rate to 90%, 3 minutes recover, repeat 4 times](https://news.ycombinator.com/item?id=34213181)\n>\n> - https://www.ntnu.edu/cerg/advice\n> - [Get running with Couch to 5K](https://www.nhs.uk/live-well/exercise/running-and-aerobic-exercises/get-running-with-couch-to-5k/)\n\n> [recommended routine - bodyweightfitness](https://www.reddit.com/r/bodyweightfitness/wiki/kb/recommended_routine/) - I Don't Have This Much Time!\n>\n> - Don't workout at all (saves anywhere from 20 to 60 minutes, but really, really, really, really, really, really, really, really, really not recommended)\n\n> 도무지 읽히지 않는 책 앞에서 내가 택한 방법은 펼쳐진 페이지 앞에서 멍때리기이다. 다르게 표현하면 이렇다. 펼쳐진 두 페이지 앞에서 오래 머물기.\n>\n> 책을 펼쳐놓는 것으로 충분하다. 읽지 못해도 좋다. 매일 정해진 진도를 나가야 하는 학교 수업이 아니니까. 하지만 읽지 않아도 괜찮다고 해서 펼쳐두지조차 않으면 곤란하다. 가능한 한 자주 책을 펼쳐두도록 하자. 전혀 읽지 않고 멍하니 바라보고 있다가 다시 덮게 되더라도\n>\n> - 막막한 독서. 시로군. P.10~13\n\n> I think it should be everyone's primary focus to sleep well, drink water, get outside, get active, and eat generally decently. I hate to say it, but if you're not eating a good amount of vegetables and fruit, decent protein, sleep, etc, no amount of XYZ will catch up to that detriment. - [CE02](https://news.ycombinator.com/item?id=35056071)\n\n> My real battle is doing good versus doing nothing. - [Deirdre Sullivan](https://www.npr.org/2005/08/08/4785079/always-go-to-the-funeral)\n\n[Kind Engineering](https://kind.engineering/) - How To Engineer Kindness\n\n> Sometimes magic is just someone spending more time on something than anyone else might reasonably expect. - [Teller](https://www.goodreads.com/quotes/6641527-sometimes-magic-is-just-someone-spending-more-time-on-something)\n\n---\n\n## What I read in past\n\n- [[What I read in 2026|read.2026.articles]]\n  - [[2025|read.2025.articles]]\n  - [[2024|read.2024.articles]]\n  - [[2023|read.2023.articles]]\n  - [[2022|read.2022.articles]]\n- 📝 [Gists](https://gist.github.com/Luke-SNAW)\n- 📜 [Journals](https://luke-snaw.github.io/Luke-SNAW__netlify-CMS.github.io/)\n\n---\n\n- [[journal.what-i-struggled-brag-in]]\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":false,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.115.0","enableFullHierarchyNoteTitle":false,"enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Luke SNAW","description":"Personal knowledge space"},"github":{"enableEditLink":false,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","siteUrl":"https://luke-snaw.github.io/","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}