{"pageProps":{"note":{"id":"fxzklk5co9tqhh12ncr7six","title":"Extreme questions to trigger new, better ideas","desc":"","updated":1673250222280,"created":1673250148965,"custom":{},"fname":"life-tips.extreme-questions","type":"note","vault":{"fsPath":"vault"},"contentHash":"bd298ea3e95fac726d429a0910d81b65","links":[],"anchors":{"10x-prices-":{"type":"header","text":"10x prices #","value":"10x-prices-","line":26,"column":0,"depth":2},"no-customers-":{"type":"header","text":"No customers #","value":"no-customers-","line":38,"column":0,"depth":2},"no-tech-support-":{"type":"header","text":"No tech support #","value":"no-tech-support-","line":48,"column":0,"depth":2},"maximize-fun-":{"type":"header","text":"Maximize fun #","value":"maximize-fun-","line":60,"column":0,"depth":2},"complete-rip-off-":{"type":"header","text":"Complete rip-off #","value":"complete-rip-off-","line":70,"column":0,"depth":2},"no-time-":{"type":"header","text":"No time #","value":"no-time-","line":80,"column":0,"depth":2},"flipped-business-model-":{"type":"header","text":"Flipped business model #","value":"flipped-business-model-","line":96,"column":0,"depth":2},"no-website-":{"type":"header","text":"No website #","value":"no-website-","line":110,"column":0,"depth":2},"no-meetings-":{"type":"header","text":"No meetings #","value":"no-meetings-","line":122,"column":0,"depth":2},"no-customer-contact-":{"type":"header","text":"No customer contact #","value":"no-customer-contact-","line":134,"column":0,"depth":2},"cost-is-no-object-":{"type":"header","text":"Cost is no object #","value":"cost-is-no-object-","line":146,"column":0,"depth":2},"sociopathic-ceo-":{"type":"header","text":"Sociopathic CEO #","value":"sociopathic-ceo-","line":158,"column":0,"depth":2},"mortal-wound-":{"type":"header","text":"Mortal wound #","value":"mortal-wound-","line":170,"column":0,"depth":2},"only-one-thing-this-year-":{"type":"header","text":"Only one thing this year #","value":"only-one-thing-this-year-","line":180,"column":0,"depth":2}},"children":[],"parent":"ettkt3iClONnxpbGwBVLl","data":{}},"body":"<h1 id=\"extreme-questions-to-trigger-new-better-ideas\">Extreme questions to trigger new, better ideas<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#extreme-questions-to-trigger-new-better-ideas\"></a></h1>\n<blockquote>\n<p><a href=\"https://longform.asmartbear.com/posts/extreme-questions/\">https://longform.asmartbear.com/posts/extreme-questions/</a></p>\n</blockquote>\n<p>How do you come up with fresh, transformative ideas?</p>\n<p>“Brainstorming” is hard—staring at a blank whiteboard, wondering whether someone could make a real-life “dark mode” whiteboard, then realizing that’s what a blackboard is, only dustier.</p>\n<p>Or the modern version, seventeen pointers flying around a Miro board, zooming to 2000% to read that auto-scaled-down text in each standard-sized virtual sticky-note.</p>\n<p>We’re blinded by our daily work: No forest, all trees. It’s too easy to glom onto an idea that’s been knocking around for year, its importance undeservedly increased by the familiarity of repetition. It’s hard to think past the last seven customer interviews or support tickets or sales calls. Those are great for generating tactical ideas that fuel our roadmaps, but they are tiny incrementalisms that cement us into tiny thinking.</p>\n<p><strong>The following prompts jostle you out of tiny thinking.</strong> Each stretches some dimension of reality to an extreme. So extreme that it is nearly nonsense. But dramatically different perspectives can reveal distinctly new ideas. An idea that would be a 60% solution in an extreme hypothetical case, could be a 2x or even a 10x idea in reality.</p>\n<p>Sometimes the extreme is surprisingly appropriate. Unique business models emerge when at least one dimension is so extreme that it defies critics and competitors to even conceive of its possibility<sup class=\"footnote-ref character-overhang\">1</sup>. A fantastic idea fulfilling the right extreme can be a company’s entire strategy, unlocking a long-term competitive moat.</p>\n<p><sup class=\"footnote-num\">1</sup> All of these were considered impossible barriers or business models, until a company did it anyway and won because of it: Zappos’ free shoe returns 364 days after purchase, Robinhood’s $0 trading fees, Amazon’s free delivery with Prime, Netflix’s mail-order DVD rental, open-source software companies charging for something that’s 100% free and 0% secret intellectual property (now hundreds of billions of dollars in combined public-company value), AirBnB, Uber, and Lyft banking on strangers trusting strangers in the intimate spaces of cars and homes.</p>\n<p>It’s worth a try.</p>\n<h2 id=\"10x-prices-\">10x prices <a href=\"https://longform.asmartbear.com/posts/extreme-questions/#10x-prices\">#</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#10x-prices-\"></a></h2>\n<p>If you were forced to increase your prices by 10x, what would you have to do to justify it?</p>\n<p>What sort of brand looks and feels like something that expensive? What positioning would you take? How would the design of both the website and the product need to change?</p>\n<p>What subset of your market would you have to target? Do they have different problems that need solving, or different needs? Would they consider the high price a positive, because it feeds a need to be seen as someone who is successful, or because they feel “buying from the best” lowers the risk of their decision? What would you need to do for them to be able to display that badge? What sort of relationship would you want to cultivate with each customer?</p>\n<p>What expensive services might you need to supply? Human support? Infrastructure? Is it possible for those costs to be “only” 2x or 3x more than today, so that the net impact is massive profitability?</p>\n<p><em>Often early startups charge too little, and established companies struggle to charge more to existing customers. Thinking about what could justify a massive hike, you might be able to do some of those things and justify at least 2x.</em></p>\n<h2 id=\"no-customers-\">No customers <a href=\"https://longform.asmartbear.com/posts/extreme-questions/#no-customers\">#</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#no-customers-\"></a></h2>\n<p>If all our customers vanished, and we had to earn our growth and brand from scratch, what would we do?</p>\n<p>How would we distinguish ourselves with a unique compelling message, as a fresh competitor in our market? What would we put on our home page? Would we use a different pricing model to compete better? Would our brand need to change to align with the message?</p>\n<p>Would we throw out some features that take a lot of work but not many people actually use (since there’s no pesky customers hanging on to the expectation of the old features)? Would we build some new feature that would make us more competitive? Would we change our infrastructure or architecture or UX dramatically because of what we now know, since we’re not ladened with existing customers?</p>\n<p><em>Often we don’t make important changes because we’ve gotten complacent with our marketing, or we never got around to having a truly compelling unique positioning statement, or we don’t want to incur the penalty of big changes on our customer base, even if it means we’re doing the wrong thing today from a competitive standpoint, and the wrong thing for the future. We don’t want to make even 5% of our customers mad, even if it would be better for the other 95%. There will be 10x more customers in the future than there are now, but only if we build for them, today.</em></p>\n<h2 id=\"no-tech-support-\">No tech support <a href=\"https://longform.asmartbear.com/posts/extreme-questions/#no-tech-support\">#</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#no-tech-support-\"></a></h2>\n<p><a href=\"https://andertoons.com/meeting/cartoon/512/so-as-you-can-see-customer-satisfaction-up-considerably-since-phasing-out-complaint-forms\">(source)</a></p>\n<p>If you were never allowed to provide tech support, in any form, what would have to change?</p>\n<p>How would on-boarding need to be improved, to the point where customers would self-serve and be happy doing it? This might be the hardest step, because the customer is least-familiar with your product, and least-motivated to power through barriers to their success. And setup stuff often has to be done only once, so you might not learn how to improve those things from existing customers.</p>\n<p>Where would the product need provide the user with more control, since they can’t ask Support to do it for them? What information requires better visibility, since they can’t ask Support to look it up for them? What actions would need to be become more intuitive, because they can’t ask Support how to use functionality that they know “is in here somewhere?”</p>\n<p><em>Self-service isn’t just better for your costs and scaling, it also makes customers happier and <a href=\"https://www.amazon.com/Effortless-Experience-Conquering-Battleground-Customer/dp/1591845815\">more loyal</a>. Therefore, dramatically improving self-service is often profitable for both the top- and bottom-line.</em></p>\n<h2 id=\"maximize-fun-\">Maximize fun <a href=\"https://longform.asmartbear.com/posts/extreme-questions/#maximize-fun\">#</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#maximize-fun-\"></a></h2>\n<p>What would be the most <em>fun</em> thing to build?</p>\n<p>It has to be something that makes our product better, not a random technology or unrelated market. Aside from that constraint, it can be anything—building a feature you just think would be cool for customers to use, developing a technology that would be fun to work on (that happens to deliver a feature customers want), refactoring infrastructure or architecture using some interesting modern technology that would also improve something like cost-efficiency, scalability, testability, or maintainability.</p>\n<p>What if you held a one-week hackathon and actually tried to build one of those things?</p>\n<p><em>When we work on things that are fun, we work better and harder, yet are happy to do it. Therefore, biasing towards fun is also biasing towards productivity and long-term fulfillment, which is practical and logical, not merely indulgent as it first appears. Ultimately, work still needs to advance the strategy while improving something substantial for the customer or the team, but typical prioritization under-appreciates the power of fun.</em></p>\n<h2 id=\"complete-rip-off-\">Complete rip-off <a href=\"https://longform.asmartbear.com/posts/extreme-questions/#complete-rip-off\">#</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#complete-rip-off-\"></a></h2>\n<p>If our biggest competitor copied every single feature we have, how do we still win?</p>\n<p>Is the answer inside our product, in something other than the utility of the features? What is something, and how could we make more of that, so we’re differentiated even in the face of a copy-cat? Is it ease of use, ease of sharing, pleasure of great design? Is it building the next feature quickly that no competitor has, and no competitors knows it’s valuable (since in this hypothetical they’re just copying us rather than being insightful on their own), and if so, what is that killer next feature that would leap-frog us from a customer’s perspective?</p>\n<p>If the answer is outside of our product, where is it? A higher purpose or brand-promise that our customers buy into, aside from the product? Is that because we are good at communicating how we make the world better, or because our customers are “rooting for David against Goliath,” or how our culture is special, or because our brand is distinctive (even if just “it’s the best” or “it’s the biggest”), or because our customers trust us, because we were our word, or because of our customer service, or because of how we handle situations that go poorly, or because we “give back” in forms like open-source or community-building or significant philanthropy?</p>\n<p><em>All your good ideas will be copied; it’s just a question of when. Competing only on features results in bullet-point battles; this is the weakest way to win sales. Creating bigger and more emotional distinction is a powerful way to win, and breaks us of the habit of believing that incremental product updates will dramatically increase differentiation, or growth.</em></p>\n<h2 id=\"no-time-\">No time <a href=\"https://longform.asmartbear.com/posts/extreme-questions/#no-time\">#</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#no-time-\"></a></h2>\n<p>What if we are forced to ship a full, completed (at least MVP) new feature, in just two weeks, that would delight and surprise some fraction of our customers.</p>\n<blockquote>\n<p>“To achieve great things, two things are needed: a plan, and not quite enough time.”</p>\n<p>—Leonard Bernstein</p>\n</blockquote>\n<p>Every bit of complexity has to be stripped out—we can add it back later. Scope has to be reduced to a minimum, which reduces how many people can use it on day one, but increases how much we’ll learn on day one.</p>\n<p>Can we stub out an API, implementing it manually for now? Can we hook up some 3rd-party system, implementing something more efficient later? Can we skip documentation and internal support training and perfect error handling, not forever, but just long enough to see how people like this new functionality?</p>\n<p>A 1000-page book can be summarized in a 40-page Cliff’s Notes. The key lessons of Cliff’s Notes can be summarized in a 1-page blog post. The main theme and one unique perspective of the book can be summarized in one sentence. It can always be smaller, if we trade things off.</p>\n<p><em>Hackathons prove that we can code really cool things in a short time, when we want to, and if we make certain trade-offs. It’s not fully finished, not polished, not ready to scale, but it’s something substantial and far more “agile” than teams normally are. If you feel like you’ve lapsed into a waterfall with two-week report-outs, this might be the shake-up everyone needs.</em></p>\n<h2 id=\"flipped-business-model-\">Flipped business model <a href=\"https://longform.asmartbear.com/posts/extreme-questions/#flipped-business-model\">#</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#flipped-business-model-\"></a></h2>\n<p><a href=\"https://andertoons.com/subscription/cartoon/6535/instead-of-allowance-how-about-subscription-model\">(source)</a></p>\n<p>What if you were forced to charge customers in a completely different manner? The product isn’t free, but somehow you have to justify value (and costs) differently. If you’re usage-based, you’re forced to charge a flat monthly rate; if monthly with tiers, you’re forced to measure and charge daily with some formula.</p>\n<p>How would you have to change how you position the value you deliver? Would you have different kinds of customers due to prices effectively being much higher or lower, and how would that affect brand, messaging, marketing, or sales?</p>\n<p>How would costs have to change, so that the vast majority of customers were still profitable? Would software architectures need to change? Would marketing or sales structures change? Is tech support suddenly much more or much less possible?</p>\n<p>Are there features which you’d need to build (e.g. so customers could control their costs), or features you’d now be able to supply (e.g. because customers would now see the utility in it, or would be happy to pay more because of it)? Would you create features which caused higher prices, but in concert with additional value, so that customers would be happy to grow with you?</p>\n<p><em>Business models force you into certain frames of thinking about how to monetize value that you create, and how costs need to scale with sales and infrastructure. The general idea for any company is to generate far more value than it charges for, so customers are genuinely better off in the exchange, and are happy to be long-term customers. Shaking up the business model shakes up the value/cost equation; sometimes a different business model is actually better for everyone.</em></p>\n<h2 id=\"no-website-\">No website <a href=\"https://longform.asmartbear.com/posts/extreme-questions/#no-website\">#</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#no-website-\"></a></h2>\n<p>If you were not allowed to have a website, how would you still grow your business?</p>\n<p>Could you grow by word-of-mouth? Does the product help people do that proactively?</p>\n<p>Could you create advocacy, as in channel partners or ambassadors? Could your social media be so good, someone would sign up for the product without needing to know more?</p>\n<p>Could your product <em>be</em> marketing? Could you cheat, where your “website” is inside the product, where potential customers are caught up learning more and trying things in the moment, so that they become users before they realize what’s happening?</p>\n<p><em>Your advocates are already using your product, yet so often we leave “getting more customers” to the marketing department, rather than realizing the product is already a platform for growth. Truly viral products know this already (e.g. you can’t use a chat service unless you invite other people to the chat service), but non-viral products can still create growth machines from inside the product. What if “in-product marketing” is more impactful on growth than any useful feature?</em></p>\n<h2 id=\"no-meetings-\">No meetings <a href=\"https://longform.asmartbear.com/posts/extreme-questions/#no-meetings\">#</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#no-meetings-\"></a></h2>\n<p>What if you made your most introverted teammates’ dreams come true: No more synchronous meetings, ever again?</p>\n<p>What if you had to on-board new employees without meetings? Or operate the software, deploy the software, find where things are located? What systems would need to exist, and what materials would need to go in there? What format would allow you to update that easily?</p>\n<p>What if you had to make decisions without meetings—the process as well as the result of that decision? Deciding what to build, prioritizing big or small things, brainstorming new things? Is it possible that brainstormed ideas could be even better without meetings (because people aren’t being influenced by other people, ahead of having their own thoughts) or that decisions could be even stronger without meetings (because people have the time and space to think, to research, to try things out, thus more completely exploring the solution space?).</p>\n<p>How would you create social ties and inside jokes and 1:1 as well as group relationships, if you’re never in the same space at the same time?</p>\n<p><em>Meetings are still the best way to accomplish certain things: Social bonding, deep discussions where ideas rapidly ricochet off each other, decisions where it’s important to “look in everyone’s eyes” to get the final agreement, and more. But one of the most common complaints in any company is “too many meetings,” or at least, “too many useless/bad/wasteful/inefficient/boring meetings.” Besides the usual admonitions about meeting hygiene, a bigger question is whether your systems and processes can not only prevent them, but increase utility beyond that. For example, how much faster could a new team member get up-to-speed if they could read “the why” behind the last 20 major decisions?</em></p>\n<h2 id=\"no-customer-contact-\">No customer contact <a href=\"https://longform.asmartbear.com/posts/extreme-questions/#no-customer-contact\">#</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#no-customer-contact-\"></a></h2>\n<p>If we could never talk to our customers again, how would we figure out what to build?</p>\n<p>Could you measure their behavior so well that you could quickly measure whether any change was positive or negative, so at least you could iterate your way to a better product? Are there clear signs of value or happiness that you could use like marketers use conversion with A/B testing?</p>\n<p>Could you be even faster at testing new ideas? Could a feature start out as just a button that says “coming soon” or asks “why did you want this” or “what did you expect to happen” or “get emailed when we make this feature,” so you could directly measure what people are likely to use, before you invest in building it?</p>\n<p>What could you analyze online, in what customers or competitors or observers are saying, that would inform your strategy or even product roadmap? Could you do better than just copying what others are doing? Could you analyze what people are saying about us or competitors online, understanding that the loudest voices aren’t a random sample of the population, but still might have something useful to tell us, even when they’re not being constructive about it?</p>\n<p><em>Sometimes you interview customers and come away with the wrong feature ideas anyway. Sometimes you ask them whether they’d use something, and they say yes, and they even meant it, but after spending five months building it, they don’t actually use it. Stretching your ability to get empirical signal helps you avoid those issues, and might even create breakthrough ideas, or avoid ideas that seem great, but aren’t.</em></p>\n<h2 id=\"cost-is-no-object-\">Cost is no object <a href=\"https://longform.asmartbear.com/posts/extreme-questions/#cost-is-no-object\">#</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#cost-is-no-object-\"></a></h2>\n<p>What if it didn’t matter how unprofitable you were?</p>\n<p>Maybe prices stay the same but you can spend 10x or 100x more, even if that’s wildly unprofitable. Or maybe the product is free, too<sup class=\"footnote-ref character-overhang\">2</sup>. What would you spend it on? How much value could you deliver, if you thought of the product as an exercise in philanthropy?</p>\n<p><sup class=\"footnote-num\">2</sup> Sometimes people under-value things only because they are free, so even if profitability is irrelevant, charging can still be useful. Try it both ways!</p>\n<p>It could be infrastructure or software, but what about the personal touch? What would a dedicated, personal concierge do? If software could do just 30% of that job, but at 1/100th of the cost, that could be a good feature.</p>\n<p><em>It can be surprisingly difficult to convert money to real customer or business value, even when money is free. If there is a way, it might lead to a new pricing tier, leveraging that idea but adding back a sustainable business model.</em></p>\n<h2 id=\"sociopathic-ceo-\">Sociopathic CEO <a href=\"https://longform.asmartbear.com/posts/extreme-questions/#sociopathic-ceo\">#</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#sociopathic-ceo-\"></a></h2>\n<p><a href=\"https://andertoons.com/business/cartoon/7278/restructuring-im-tom-tom-anne-anne-copier-copier-in-charge\">(source)</a></p>\n<p>What if you could change anything, regardless of what anyone thinks or feels?</p>\n<p>Terminating an entire product line would shake the organization, and possibly incur layoffs in multiple departments. But what if it’s the best thing to do, despite that? What if you allowed yourself to explore what that would be like? What if it turns out you can make that pivot by reorganization rather than layoffs, and now company is executing a much better strategy?</p>\n<p>Pivoting the entire company could break the organization, destroy trust in leadership, cause people to leave, and piss off investors. But what if that’s exactly the transformation required to fix the strategy? Is there anything that might actually be worth such a move?</p>\n<p><em>You never want to contemplate catastrophic actions like layoffs, whole-company pivots, terminating an entire product line, and for good reason—the consequences are dire, arguably even inhumane. At the same time, that aversion prevents you from thinking certain thoughts. You should at least be able to explore the thoughts. The very best ideas should not be avoided only because they are hard.</em></p>\n<h2 id=\"mortal-wound-\">Mortal wound <a href=\"https://longform.asmartbear.com/posts/extreme-questions/#mortal-wound\">#</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#mortal-wound-\"></a></h2>\n<p>What externality has the potential to kill the entire company?</p>\n<p>Is there a company X, which released product Y, at price Z, that would reduce your new sales to a trickle, and would mean half your customers leave within a year? Can you think of a security breech so significant, most of the customer base leaves within a year? How could the economy change, in which no one would buy your software?</p>\n<p>Now, is there something you could do to mitigate that effect? Or something that pivots the company such that it is no longer a threat?</p>\n<p><em>I ran this exercise at WP Engine and we came up with 35 existential threats; it’s not wise to worry about all of them, and try to negate all of them. Sometimes, however, you find an idea which is wise to do anyway, that also shores up your defenses. Or, one threat sticks out as being so likely that it warrants acting ahead of time.</em></p>\n<h2 id=\"only-one-thing-this-year-\">Only one thing this year <a href=\"https://longform.asmartbear.com/posts/extreme-questions/#only-one-thing-this-year\">#</a><a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#only-one-thing-this-year-\"></a></h2>\n<p>What if you could only ship one thing this year?</p>\n<p>What single initiative would make the most difference? What’s so impactful that it would actually be OK if we shipped nothing else? You get the entire year, so there’s time for a release, and fixes, and enhancements, but it has to be only one topic.</p>\n<p>What would generate the most revenue? What would be so differentiated in the market, and so desirable, that customers still buy and stay even with your lack of any other substantial product changes? What would be so exciting that customers would stay even if other things are missing or have on-going bugs?</p>\n<p><em>When you look back over years of a business, often the whole trajectory comes down to 1-2 big decisions per year. A critical product launch, a key decision to enter a market for expansion or exit one market to focus on a healthier one, a key hire, a competitive insight. It’s difficult to know in the moment which will be seminal, but thinking this way forces you to think of only the absolutely most impactful ideas, which are probably the ones you should be focused on regardless.</em></p>\n<blockquote>\n<p>“The dangerous man is the one who has only one idea, because then he’ll fight and die for it. The way real science goes is that you come up with lots of ideas, and most of them will be wrong.”</p>\n<p>—Francis Crick</p>\n</blockquote>","noteIndex":{"id":"Iy0MoL0KnL55Br3AfTS2C","title":"Luke","desc":"","updated":1766965759366,"created":1644449449778,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"a724de3efd251cf89fe82a5860d9008b","links":[{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"life-tips","position":{"start":{"line":43,"column":5,"offset":2710},"end":{"line":43,"column":29,"offset":2734},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"life-tips","anchorHeader":"wodenokoto"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2026.articles","alias":"What I read in 2026","position":{"start":{"line":72,"column":3,"offset":4440},"end":{"line":72,"column":45,"offset":4482},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2026.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2025.articles","alias":"2025","position":{"start":{"line":73,"column":5,"offset":4487},"end":{"line":73,"column":32,"offset":4514},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2025.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2024.articles","alias":"2024","position":{"start":{"line":74,"column":5,"offset":4519},"end":{"line":74,"column":32,"offset":4546},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2024.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2023.articles","alias":"2023","position":{"start":{"line":75,"column":5,"offset":4551},"end":{"line":75,"column":32,"offset":4578},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2023.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2022.articles","alias":"2022","position":{"start":{"line":76,"column":5,"offset":4583},"end":{"line":76,"column":32,"offset":4610},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2022.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"journal.what-i-struggled-brag-in","position":{"start":{"line":82,"column":3,"offset":4746},"end":{"line":82,"column":39,"offset":4782},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"journal.what-i-struggled-brag-in"}}],"anchors":{"what-i-read-in-past":{"type":"header","text":"What I read in past","value":"what-i-read-in-past","line":76,"column":0,"depth":2}},"children":["zd4mq442jike0pr0wba1u3m","6hzeqsofq67gdk88flxlkhp","778ijii93yu5uwnrwmn5zi4","g1fngdjl25nes6fs3lip602","ZbdkdApFqLdks4Moq92R9","uoc5hhki3o4py15cesddu8q","9qf7j06jtdkm6rnx9ymvwb0","5zn10cvj7ajy2gh2is5nqmg","4qo9ma0z0yu1czns6pxl7y5","ok0e729ho7o09xetujkxc0m","GR5x8HnNFEN6fU2UBSEIK","yirtnlj8q24yutcf3ss1xqy","eq0wc6t7wl2wv221yb68ro4","7x2fnv4j6gxts08qk0jguny","ettkt3iClONnxpbGwBVLl","7l4knev6v613tbuoskvmbdg","hvh5bud6yp7dc89tuh95tr9","4fvoqrplw0cweo554usbjos","f8qsfql0a9v8thpeo82udfa","1swsbrhqi9jk41v9eodyi5q","SQqYupi6EFddTerBA8RRD","hjNeNc1F2JUh0lTWanH4h","qf0l4wbrc9jgooyzexmbq5v","o7xruzrah5wzqetottecss7","z1zo2mp6ddji5p317i4x9xw","v06c2tjelh341x4resa50fh","0yqesk4rcffwgyuab5x8rfa","sy2vkbtyu671chkvgn1yt8j","ufixpmxoydiccoh59kphrib","alswadkx4wb05y1z9iwfzfv","1daut9dpw70xd0zh5a7j5p4"],"parent":null,"data":{},"body":"\nHi there 👋. I'm a Front-end developer.\n\n---\n\n- 현실은 인간의 연산으로 완전히 파악할 수 없는 복잡계. 주어진 상황과 능력으로 할 수 있는 최선의 적응은 단순함과 꾸준함.\n\n  - 파산을 면하는 선에서 여러가지를 해보고 자신에게 맞는 걸 위주로 꾸준히. 그를 위해 단순, 편안, 쾌적함이 필요.\n\n- 🥱 -> 🤔💡🌱 - [On The Death of Daydreaming](https://www.afterbabel.com/p/on-the-death-of-daydreaming)\n  - boredom -> easy fun -> art -> profit?\n\n> I've often described my motivation for building software to others using imagery: I like to go find a secluded beach, build a large, magnificent sand castle, and then walk away. Will anyone notice? Probably not. Will the waves eventually destroy it? Yep. Did I still get immense satisfaction? Absolutely. - [aliasxneo](https://news.ycombinator.com/item?id=41497113)\n\n> We love to see the process, not just the result. The imperfections in your work can be beautiful if they show your struggle for perfection, not a lack of care. - [ralphammer](https://ralphammer.com/is-perfection-boring/)\n\n> Simplicity, even if it sacrifices some ideal functionality has better survival characteristics than the-right-thing. - [The Rise of Worse is Better](https://www.dreamsongs.com/RiseOfWorseIsBetter.html)\n\n> [Roberto Blake was talking about making 100 crappy videos](https://www.youtube.com/watch?v=OnUBaQ1Sp_E) to get better over time. Putting in the reps and improving a little bit each time.\n>\n> Putting in the work without expecting any external reward at first (eg views, followers, likes, etc) will pay off in the long run. - [100 Scrappy Things](https://www.florin-pop.com/blog/100-scrappy-things/)\n\n> Make the difficult habitual, the habitual easy, and the easy beautiful. - [Constantin S. Stanislavski](https://www.goodreads.com/quotes/7102271-make-the-difficult-habitual-the-habitual-easy-and-the-easy)\n\n> A good match is a **structured** dance, where players aim to **score** while they are following well-defined **rules**. This **freedom within a structure** is what makes it fun. - [ralphammer](https://ralphammer.com/how-to-get-started/)\n\n- [Pivot Points](https://longform.asmartbear.com/pivot-points/)\n\n  - non-judgmental aspects of personality that can be strengths in some contexts and weaknesses in others\n  - Pivot Points are fixed in the short term\n\n- [Hedged Bets](https://longform.asmartbear.com/predict-the-future/#hedged-bets)\n  - trading slightly less maximum upside for predictable, net-positive outcomes.\n\n> “Motivation often comes after starting, not before. Action produces momentum.”\n> [When you start a new habit, it should take less than two minutes to do.](https://jamesclear.com/how-to-stop-procrastinating)\n>\n> - James Clear\n\n> Focus is more about **not** keeping busy when you need to wait for something.  \n> Eat the boredom for a minute.\n>\n> - [[life-tips#wodenokoto]]\n\n> [4 minutes run hard enough to push heart rate to 90%, 3 minutes recover, repeat 4 times](https://news.ycombinator.com/item?id=34213181)\n>\n> - https://www.ntnu.edu/cerg/advice\n> - [Get running with Couch to 5K](https://www.nhs.uk/live-well/exercise/running-and-aerobic-exercises/get-running-with-couch-to-5k/)\n\n> [recommended routine - bodyweightfitness](https://www.reddit.com/r/bodyweightfitness/wiki/kb/recommended_routine/) - I Don't Have This Much Time!\n>\n> - Don't workout at all (saves anywhere from 20 to 60 minutes, but really, really, really, really, really, really, really, really, really not recommended)\n\n> 도무지 읽히지 않는 책 앞에서 내가 택한 방법은 펼쳐진 페이지 앞에서 멍때리기이다. 다르게 표현하면 이렇다. 펼쳐진 두 페이지 앞에서 오래 머물기.\n>\n> 책을 펼쳐놓는 것으로 충분하다. 읽지 못해도 좋다. 매일 정해진 진도를 나가야 하는 학교 수업이 아니니까. 하지만 읽지 않아도 괜찮다고 해서 펼쳐두지조차 않으면 곤란하다. 가능한 한 자주 책을 펼쳐두도록 하자. 전혀 읽지 않고 멍하니 바라보고 있다가 다시 덮게 되더라도\n>\n> - 막막한 독서. 시로군. P.10~13\n\n> I think it should be everyone's primary focus to sleep well, drink water, get outside, get active, and eat generally decently. I hate to say it, but if you're not eating a good amount of vegetables and fruit, decent protein, sleep, etc, no amount of XYZ will catch up to that detriment. - [CE02](https://news.ycombinator.com/item?id=35056071)\n\n> My real battle is doing good versus doing nothing. - [Deirdre Sullivan](https://www.npr.org/2005/08/08/4785079/always-go-to-the-funeral)\n\n[Kind Engineering](https://kind.engineering/) - How To Engineer Kindness\n\n> Sometimes magic is just someone spending more time on something than anyone else might reasonably expect. - [Teller](https://www.goodreads.com/quotes/6641527-sometimes-magic-is-just-someone-spending-more-time-on-something)\n\n---\n\n## What I read in past\n\n- [[What I read in 2026|read.2026.articles]]\n  - [[2025|read.2025.articles]]\n  - [[2024|read.2024.articles]]\n  - [[2023|read.2023.articles]]\n  - [[2022|read.2022.articles]]\n- 📝 [Gists](https://gist.github.com/Luke-SNAW)\n- 📜 [Journals](https://luke-snaw.github.io/Luke-SNAW__netlify-CMS.github.io/)\n\n---\n\n- [[journal.what-i-struggled-brag-in]]\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":false,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.115.0","enableFullHierarchyNoteTitle":false,"enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Luke SNAW","description":"Personal knowledge space"},"github":{"enableEditLink":false,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","siteUrl":"https://luke-snaw.github.io/","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}