{"pageProps":{"note":{"id":"m04i4k6dvri4umvgyvz5q7b","title":"Screw motivation, what you need is discipline.","desc":"","updated":1675815264362,"created":1675813227960,"custom":{},"fname":"life-tips.screw-motivation-what-you-need-is-discipline","type":"note","vault":{"fsPath":"vault"},"contentHash":"4fa4c667f55157b837b250e1faf6002b","links":[{"type":"wiki","from":{"fname":"life-tips.screw-motivation-what-you-need-is-discipline","id":"m04i4k6dvri4umvgyvz5q7b","vaultName":"vault"},"value":"life-tips.practical-discipline","alias":"Part 2","position":{"start":{"line":3,"column":3,"offset":83},"end":{"line":3,"column":46,"offset":126},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"life-tips.practical-discipline"}},{"from":{"fname":"life-tips.practical-discipline","id":"nl25o3bssgrt1f91tiwi3xy","vaultName":"vault"},"type":"backlink","position":{"start":{"line":3,"column":3,"offset":58},"end":{"line":3,"column":70,"offset":125},"indent":[]},"value":"life-tips.screw-motivation-what-you-need-is-discipline"}],"anchors":{},"children":[],"parent":"ettkt3iClONnxpbGwBVLl","data":{}},"body":"<h1 id=\"screw-motivation-what-you-need-is-discipline\">Screw motivation, what you need is discipline.<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#screw-motivation-what-you-need-is-discipline\"></a></h1>\n<blockquote>\n<p><a href=\"https://www.wisdomination.com/screw-motivation-what-you-need-is-discipline/\">https://www.wisdomination.com/screw-motivation-what-you-need-is-discipline/</a><br>\n<a href=\"/notes/nl25o3bssgrt1f91tiwi3xy\">Part 2</a></p>\n</blockquote>\n<p>Motivation is often seen as the key to getting things done, but in reality, discipline is the better option. Discipline separates outward functioning from moods and feelings, and allows us to complete tasks without relying on a particular mental or emotional state. Motivation can lead to procrastination and self-inflicted psychological harm, while discipline is a system that can be built up over time and lead to consistent, long-term results. Discipline is more self-perpetuating and constant, while motivation is a bursty kind of thing. Cultivating discipline requires building habits, starting small and gathering momentum. Motivation is a counterproductive attitude to productivity, and what counts is discipline.</p>\n<ul>\n<li>\n<p>Motivation is trying to feel like doing stuff, while discipline is doing it even if you don't feel like it.</p>\n</li>\n<li>\n<p>Successful completion of tasks brings about the inner states that chronic procrastinators think they need to initiate tasks in the first place.</p>\n</li>\n<li>\n<p>Chasing motivation is an insistence on the infantile fantasy that we should only be doing things we feel like doing.</p>\n</li>\n<li>\n<p>Discipline separates outward functioning from moods and feelings and thereby ironically circumvents the problem by consistently improving them.</p>\n</li>\n<li>\n<p>Trying to drum up enthusiasm for fundamentally dull and soul crushing activities is literally a form of deliberate psychological self-harm.</p>\n</li>\n<li>\n<p>Motivation has a tiny shelf life and needs constant refreshing.</p>\n</li>\n<li>\n<p>Discipline is more or less self-perpetuating and constant, whereas motivation is a bursty kind of thing.</p>\n</li>\n<li>\n<p>Cultivating discipline involves building habits starting as small as you can manage and gathering momentum.</p>\n</li>\n<li>\n<p>Productivity has no requisite mental states.</p>\n</li>\n<li>\n<p>Discipline trumps motivation for consistent, long-term results.</p>\n</li>\n</ul>\n<hr>\n<p>If you want to get anything done, there are two basic ways to get yourself to do it.</p>\n<p>The first, more popular and devastatingly wrong option is to try to motivate yourself.</p>\n<p>The second, somewhat unpopular and entirely correct choice is to cultivate discipline.</p>\n<p>This is one of these situations where adopting a different perspective immediately results in superior outcomes. Few uses of the term “paradigm shift” are actually legitimate, but this one is. It’s a lightbulb moment.</p>\n<p>What’s the difference?</p>\n<p><strong>Motivation, broadly speaking, operates on the erroneous assumption that a particular mental or emotional state is necessary to complete a task.</strong></p>\n<p>That’s completely the wrong way around.</p>\n<p><strong>Discipline, by contrast, separates outwards functioning from moods and feelings <em>and thereby ironically circumvents the problem by consistently improving them</em>.</strong></p>\n<p>The implications are huge.</p>\n<p><strong>Successful completion of tasks brings about the inner states that chronic procrastinators think they need to initiate tasks in the first place.</strong></p>\n<p>Put in simpler form, <strong>you don’t wait until you’re in olympic form to start training. You train to get into olympic form.</strong></p>\n<p>If action is conditional on feelings, waiting for the right mood becomes a particularly insidious form of procrastination. I know that too well, and wish somebody pointed it out for me twenty, fifteen or ten years ago before I learned the difference the hard way.</p>\n<p>If you wait until you feel like doing stuff, you’re fucked. That’s precisely how the dreaded procrastinatory loops come about.</p>\n<p><a href=\"http://www.theatlantic.com/business/archive/2014/08/the-procrastination-loop-and-how-to-break-it/379142/\">Source of picture</a></p>\n<p>At its core, chasing motivation is insistence on the infantile fantasy that we should only be doing things we <em>feel like</em> doing. The problem is then framed thus: “How do I get myself to <em>feel like doing</em> what I have rationally decided to do?”. Bad.</p>\n<p>The proper question is “How do I make my feelings inconsequential and do the things I consciously want to do without being a little bitch about it?”.</p>\n<p>The point is to cut the link between feelings and actions, and do it anyway. You get to feel good and buzzed and energetic and eager <em>afterwards</em>.</p>\n<p>Motivation has this the wrong way around. I am utterly 100% convinced that this faulty frame is the main driver of the “sitting about in underwear playing Xbox, and with yourself” epidemic currently sweeping developed countries.</p>\n<p>There are psychological problems with relying on motivation as well.</p>\n<p>Because real life in the real world occasionally requires people do things that nobody in their right mind can be massively enthusiastic about, “motivation” runs into the insurmountable obstacle of trying to elicit enthusiasm for things that objectively do not merit it. The only solution besides slackery, then, is to put people out of their right minds. That’s a horrible, and fortunately fallacious, dilemma.</p>\n<p>Trying to drum up enthusiasm for fundamentally dull and soul crushing activities is literally a form of deliberate psychological self-harm, a voluntary insanity: “I AM SO PASSIONATE ABOUT THESE SPREADSHEETS, I CAN’T WAIT TO FILL OUT THE EQUATION FOR FUTURE VALUE OF ANNUITY, I LOVE MY JOB SOOO MUCH!”</p>\n<p>I do not consider self-inflicted episodes of hypomania the optimal driver of human activity. A <a href=\"http://en.wikipedia.org/wiki/Dysthymia\">thymic</a> compensation via depressive episodes is inevitable, since the human brain will not tolerate abuse indefinitely. There are stops and safety valves. There are hormonal hangovers.</p>\n<p>The worst thing that can happen is succeeding at the wrong thing – temporarily. A far superior scenario is retaining sanity, which unfortunately tends to be misinterpreted as moral failure: <em>“I still don’t love my pointless paper-shuffling job, I must be doing something wrong.”</em> <em>“I still prefer cake to brocolli and can’t lose weight, maybe I’m just weak”.</em> <em>“I should buy another book about motivation”</em>. Bullshit. The critical error is even approaching those issues in terms of motivation or lack thereof. The answer is discipline, not motivation.</p>\n<p>There is another, practical problem with motivation. It has a tiny shelf life, and needs constant refreshing.</p>\n<p>Motivation is like manually winding up a crank to deliver a burst of force. At best, it stores and converts energy to a particular purpose. There are situations where it is the correct attitude, one-offs where getting psyched and spring-loading a metric fuckton of mental energy upfront is the best course of action. Olympic races and prison breaks come to mind. But it is a horrible basis for regular day-to-day functioning, and anything like consistent long-term results.</p>\n<p>By contrast, discipline is like an engine that, once kickstarted, actually <em>supplies</em> energy to the system.</p>\n<p>Productivity has no requisite mental states. For consistent, long-term results, discipline trumps motivation, runs circles around it, bangs its mom and eats its lunch.</p>\n<p>In summary, motivation is trying to feel like doing stuff. Discipline is doing it even if you don’t feel like it.</p>\n<p>You get to feel good <em>afterwards</em>.</p>\n<p>Discipline, in short, is a system, whereas motivation is analogous to goals. There is a symmetry. Discipline is more or less self-perpetuating and constant, whereas motivation is a bursty kind of thing.</p>\n<p>How do you cultivate discipline? By building habits – starting as small as you can manage, even microscopic, and gathering momentum, reinvesting it in progressively bigger changes to your routine, and building a positive feedback loop.</p>\n<p>Motivation is a counterproductive attitude to productivity. What counts is discipline.</p>\n<hr>\n<blockquote>\n<p><a href=\"https://news.ycombinator.com/item?id=34692816\">https://news.ycombinator.com/item?id=34692816</a></p>\n</blockquote>\n<p>IMO this makes the most important point at the very end. “Being disciplined” itself is a consequence of motivation, or is effectively that. Building habits however, requires very little discipline or motivation so long as you build them strategically - I.e. start so small it’d be ridiculous not to do it regardless of how motivated or disciplined you are.\nAnd by “start small” I mean “floss one tooth per night for 3 months to build a flossing habit” small. Let your good habits progressively and slowly consume more time, similar to what bad habits do.</p>\n<p>For all intents and purposes you should just assume both discipline and motivation are completely mythical and you should construct a system of high-leverage habits to obviate the need for them. You don’t rise to the level of your talents/motivation/discipline, you fall to the level of your habits.\nfj</p>\n<hr>\n<blockquote>\n<p><a href=\"https://news.ycombinator.com/item?id=34696860\">https://news.ycombinator.com/item?id=34696860</a></p>\n</blockquote>\n<p>What you need is happiness!! I’ve had this beaten in to me many times, that you need discipline. But for me, what eventually worked was learning to love myself and to relax. Life is a marathon and tomorrow is another day. Whatever issues I had was not a lack of motivation nor discipline; I had an inner turmoil that was disrupting my ability to execute.</p>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/notes/nl25o3bssgrt1f91tiwi3xy\">Practical Discipline</a></li>\n</ul>","noteIndex":{"id":"Iy0MoL0KnL55Br3AfTS2C","title":"Luke","desc":"","updated":1766965759366,"created":1644449449778,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"a724de3efd251cf89fe82a5860d9008b","links":[{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"life-tips","position":{"start":{"line":43,"column":5,"offset":2710},"end":{"line":43,"column":29,"offset":2734},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"life-tips","anchorHeader":"wodenokoto"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2026.articles","alias":"What I read in 2026","position":{"start":{"line":72,"column":3,"offset":4440},"end":{"line":72,"column":45,"offset":4482},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2026.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2025.articles","alias":"2025","position":{"start":{"line":73,"column":5,"offset":4487},"end":{"line":73,"column":32,"offset":4514},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2025.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2024.articles","alias":"2024","position":{"start":{"line":74,"column":5,"offset":4519},"end":{"line":74,"column":32,"offset":4546},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2024.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2023.articles","alias":"2023","position":{"start":{"line":75,"column":5,"offset":4551},"end":{"line":75,"column":32,"offset":4578},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2023.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2022.articles","alias":"2022","position":{"start":{"line":76,"column":5,"offset":4583},"end":{"line":76,"column":32,"offset":4610},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2022.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"journal.what-i-struggled-brag-in","position":{"start":{"line":82,"column":3,"offset":4746},"end":{"line":82,"column":39,"offset":4782},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"journal.what-i-struggled-brag-in"}}],"anchors":{"what-i-read-in-past":{"type":"header","text":"What I read in past","value":"what-i-read-in-past","line":76,"column":0,"depth":2}},"children":["zd4mq442jike0pr0wba1u3m","6hzeqsofq67gdk88flxlkhp","778ijii93yu5uwnrwmn5zi4","g1fngdjl25nes6fs3lip602","ZbdkdApFqLdks4Moq92R9","uoc5hhki3o4py15cesddu8q","9qf7j06jtdkm6rnx9ymvwb0","5zn10cvj7ajy2gh2is5nqmg","4qo9ma0z0yu1czns6pxl7y5","ok0e729ho7o09xetujkxc0m","GR5x8HnNFEN6fU2UBSEIK","yirtnlj8q24yutcf3ss1xqy","eq0wc6t7wl2wv221yb68ro4","7x2fnv4j6gxts08qk0jguny","ettkt3iClONnxpbGwBVLl","7l4knev6v613tbuoskvmbdg","hvh5bud6yp7dc89tuh95tr9","4fvoqrplw0cweo554usbjos","f8qsfql0a9v8thpeo82udfa","1swsbrhqi9jk41v9eodyi5q","SQqYupi6EFddTerBA8RRD","hjNeNc1F2JUh0lTWanH4h","qf0l4wbrc9jgooyzexmbq5v","o7xruzrah5wzqetottecss7","z1zo2mp6ddji5p317i4x9xw","v06c2tjelh341x4resa50fh","0yqesk4rcffwgyuab5x8rfa","sy2vkbtyu671chkvgn1yt8j","ufixpmxoydiccoh59kphrib","alswadkx4wb05y1z9iwfzfv","1daut9dpw70xd0zh5a7j5p4"],"parent":null,"data":{},"body":"\nHi there 👋. I'm a Front-end developer.\n\n---\n\n- 현실은 인간의 연산으로 완전히 파악할 수 없는 복잡계. 주어진 상황과 능력으로 할 수 있는 최선의 적응은 단순함과 꾸준함.\n\n  - 파산을 면하는 선에서 여러가지를 해보고 자신에게 맞는 걸 위주로 꾸준히. 그를 위해 단순, 편안, 쾌적함이 필요.\n\n- 🥱 -> 🤔💡🌱 - [On The Death of Daydreaming](https://www.afterbabel.com/p/on-the-death-of-daydreaming)\n  - boredom -> easy fun -> art -> profit?\n\n> I've often described my motivation for building software to others using imagery: I like to go find a secluded beach, build a large, magnificent sand castle, and then walk away. Will anyone notice? Probably not. Will the waves eventually destroy it? Yep. Did I still get immense satisfaction? Absolutely. - [aliasxneo](https://news.ycombinator.com/item?id=41497113)\n\n> We love to see the process, not just the result. The imperfections in your work can be beautiful if they show your struggle for perfection, not a lack of care. - [ralphammer](https://ralphammer.com/is-perfection-boring/)\n\n> Simplicity, even if it sacrifices some ideal functionality has better survival characteristics than the-right-thing. - [The Rise of Worse is Better](https://www.dreamsongs.com/RiseOfWorseIsBetter.html)\n\n> [Roberto Blake was talking about making 100 crappy videos](https://www.youtube.com/watch?v=OnUBaQ1Sp_E) to get better over time. Putting in the reps and improving a little bit each time.\n>\n> Putting in the work without expecting any external reward at first (eg views, followers, likes, etc) will pay off in the long run. - [100 Scrappy Things](https://www.florin-pop.com/blog/100-scrappy-things/)\n\n> Make the difficult habitual, the habitual easy, and the easy beautiful. - [Constantin S. Stanislavski](https://www.goodreads.com/quotes/7102271-make-the-difficult-habitual-the-habitual-easy-and-the-easy)\n\n> A good match is a **structured** dance, where players aim to **score** while they are following well-defined **rules**. This **freedom within a structure** is what makes it fun. - [ralphammer](https://ralphammer.com/how-to-get-started/)\n\n- [Pivot Points](https://longform.asmartbear.com/pivot-points/)\n\n  - non-judgmental aspects of personality that can be strengths in some contexts and weaknesses in others\n  - Pivot Points are fixed in the short term\n\n- [Hedged Bets](https://longform.asmartbear.com/predict-the-future/#hedged-bets)\n  - trading slightly less maximum upside for predictable, net-positive outcomes.\n\n> “Motivation often comes after starting, not before. Action produces momentum.”\n> [When you start a new habit, it should take less than two minutes to do.](https://jamesclear.com/how-to-stop-procrastinating)\n>\n> - James Clear\n\n> Focus is more about **not** keeping busy when you need to wait for something.  \n> Eat the boredom for a minute.\n>\n> - [[life-tips#wodenokoto]]\n\n> [4 minutes run hard enough to push heart rate to 90%, 3 minutes recover, repeat 4 times](https://news.ycombinator.com/item?id=34213181)\n>\n> - https://www.ntnu.edu/cerg/advice\n> - [Get running with Couch to 5K](https://www.nhs.uk/live-well/exercise/running-and-aerobic-exercises/get-running-with-couch-to-5k/)\n\n> [recommended routine - bodyweightfitness](https://www.reddit.com/r/bodyweightfitness/wiki/kb/recommended_routine/) - I Don't Have This Much Time!\n>\n> - Don't workout at all (saves anywhere from 20 to 60 minutes, but really, really, really, really, really, really, really, really, really not recommended)\n\n> 도무지 읽히지 않는 책 앞에서 내가 택한 방법은 펼쳐진 페이지 앞에서 멍때리기이다. 다르게 표현하면 이렇다. 펼쳐진 두 페이지 앞에서 오래 머물기.\n>\n> 책을 펼쳐놓는 것으로 충분하다. 읽지 못해도 좋다. 매일 정해진 진도를 나가야 하는 학교 수업이 아니니까. 하지만 읽지 않아도 괜찮다고 해서 펼쳐두지조차 않으면 곤란하다. 가능한 한 자주 책을 펼쳐두도록 하자. 전혀 읽지 않고 멍하니 바라보고 있다가 다시 덮게 되더라도\n>\n> - 막막한 독서. 시로군. P.10~13\n\n> I think it should be everyone's primary focus to sleep well, drink water, get outside, get active, and eat generally decently. I hate to say it, but if you're not eating a good amount of vegetables and fruit, decent protein, sleep, etc, no amount of XYZ will catch up to that detriment. - [CE02](https://news.ycombinator.com/item?id=35056071)\n\n> My real battle is doing good versus doing nothing. - [Deirdre Sullivan](https://www.npr.org/2005/08/08/4785079/always-go-to-the-funeral)\n\n[Kind Engineering](https://kind.engineering/) - How To Engineer Kindness\n\n> Sometimes magic is just someone spending more time on something than anyone else might reasonably expect. - [Teller](https://www.goodreads.com/quotes/6641527-sometimes-magic-is-just-someone-spending-more-time-on-something)\n\n---\n\n## What I read in past\n\n- [[What I read in 2026|read.2026.articles]]\n  - [[2025|read.2025.articles]]\n  - [[2024|read.2024.articles]]\n  - [[2023|read.2023.articles]]\n  - [[2022|read.2022.articles]]\n- 📝 [Gists](https://gist.github.com/Luke-SNAW)\n- 📜 [Journals](https://luke-snaw.github.io/Luke-SNAW__netlify-CMS.github.io/)\n\n---\n\n- [[journal.what-i-struggled-brag-in]]\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":false,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.115.0","enableFullHierarchyNoteTitle":false,"enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Luke SNAW","description":"Personal knowledge space"},"github":{"enableEditLink":false,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","siteUrl":"https://luke-snaw.github.io/","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}