{"pageProps":{"note":{"id":"mqfe4h2emzl9tv9liagw7y1","title":"Unpacking API Management policies [Part 2]: 5 ways to handle REST API authentication","desc":"","updated":1676417932445,"created":1676417841320,"custom":{},"fname":"dev.auth.5-ways-to-implement-rest-api-authentication","type":"note","vault":{"fsPath":"vault"},"contentHash":"ba8be9a7cb24908ee4c121d795e7303b","links":[],"anchors":{"learning-the-fundamentals-identity-authentication-and-authorization":{"type":"header","text":"Learning the fundamentals: Identity, authentication, and authorization","value":"learning-the-fundamentals-identity-authentication-and-authorization","line":18,"column":0,"depth":2},"implementing-authentication-in-apigee":{"type":"header","text":"Implementing authentication in Apigee","value":"implementing-authentication-in-apigee","line":28,"column":0,"depth":2},"choosing-the-right-authentication-method-for-your-api-use-case":{"type":"header","text":"Choosing the right authentication method for your API use case","value":"choosing-the-right-authentication-method-for-your-api-use-case","line":36,"column":0,"depth":2},"1-api-key-identification-only":{"type":"header","text":"#1 API Key (identification only)","value":"1-api-key-identification-only","line":51,"column":0,"depth":3},"2-oauth2-token":{"type":"header","text":"#2 OAuth2 token","value":"2-oauth2-token","line":59,"column":0,"depth":3},"3-external-token-or-assertion":{"type":"header","text":"#3 External token or assertion","value":"3-external-token-or-assertion","line":67,"column":0,"depth":3},"4-token-exchange":{"type":"header","text":"#4 Token Exchange","value":"4-token-exchange","line":77,"column":0,"depth":3},"5-identity-facade-for-3-legged-oauth":{"type":"header","text":"#5 Identity facade for 3 legged OAuth","value":"5-identity-facade-for-3-legged-oauth","line":87,"column":0,"depth":3},"get-started-with-authentication-policies-in-apigee":{"type":"header","text":"Get started with authentication policies in Apigee?","value":"get-started-with-authentication-policies-in-apigee","line":99,"column":0,"depth":3}},"children":[],"parent":"v45kc46huiqczj6vx691qf9","data":{}},"body":"<h1 id=\"unpacking-api-management-policies-part-2-5-ways-to-handle-rest-api-authentication\">Unpacking API Management policies [Part 2]: 5 ways to handle REST API authentication<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#unpacking-api-management-policies-part-2-5-ways-to-handle-rest-api-authentication\"></a></h1>\n<blockquote>\n<p><a href=\"https://cloud.google.com/blog/products/api-management/5-ways-to-implement-rest-api-authentication/?hl=en\">https://cloud.google.com/blog/products/api-management/5-ways-to-implement-rest-api-authentication/?hl=en</a></p>\n</blockquote>\n<p>APIs power every digital interaction we experience today – from ordering your favorite coffee on your mobile device, to checking the live scores on your sports app, to even reading this blog on your device. With the growing surface of interactions powered by APIs, even the surface area for a potential attack is increasing. Google Cloud’s 2022 report on <a href=\"https://cloud.google.com/resources/api-security-research-report\">API security insights and trends</a> notes that more than 50% of organizations faced an API-related security threat at least once in 2021, confirming that APIs have become a favorite target for threat actors. Securing your APIs requires a <a href=\"https://cloud.google.com/blog/products/identity-security/build-your-api-security-strategy-on-these-4-pillars\">prudent strategy</a> and a <a href=\"https://cloud.google.com/apigee#section-9\">multi-layered approach</a>. But the bedrock of any good API strategy is <em>authenticating</em> the identity of a user trying to access the API. Authentication helps prevent unauthorized access or abuse, which can have security and performance implications for the API and the backend systems it connects to.</p>\n<p>Authentication in <a href=\"http://cloud.google.com/apigee\">Apigee</a> is primarily handled through <em>policies</em> – rules that an API gateway enforces when processing incoming requests. But choosing the right authentication policies requires a balance of security, usability, and simplicity tailored for your API and use case.</p>\n<p>In this second blog of the series which unpacks <a href=\"http://cloud.google.com/apigee\">Apigee’s</a> API management policies, we will explore different authentication policies that help prevent unauthorized access or abuse. Before we dive deeper into the topic, let’s start with a few basic concepts.</p>\n<h2 id=\"learning-the-fundamentals-identity-authentication-and-authorization\">Learning the fundamentals: Identity, authentication, and authorization<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#learning-the-fundamentals-identity-authentication-and-authorization\"></a></h2>\n<p><strong>Identity</strong> is a digital user account that requires access to your resources (Ex: API, system, services etc.,). A user account can also represent non-humans, such as software, Internet of Things devices, or robotics.</p>\n<p><strong>Authentication</strong> is the process of verifying the digital identity of a client or a user before granting access to an API. Someone (or something) authenticates to prove that they’re the user they claim to be.</p>\n<p><strong>Authorization</strong> is the process of determining what resources a user can access.</p>\n<p><strong>Identity Provider (IdP)</strong> is a system entity that creates, maintains, and manages identity information and provides authentication services.</p>\n<h2 id=\"implementing-authentication-in-apigee\">Implementing authentication in Apigee<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#implementing-authentication-in-apigee\"></a></h2>\n<p>Authentication is typically done by requiring the client to provide some form of credentials – such as a user name and password, an OAuth token, or a JSON Web Token (JWT). As an API owner, you can implement authentication in Apigee using policies. Specifically, security policies in Apigee allow you to authenticate and authorize every request, and protect your content.</p>\n<p>Apigee offers <a href=\"https://cloud.google.com/apigee/docs/api-platform/reference/policies/reference-overview-policy\">50+ policies</a> out of the box. As part of these policies, there are several different API authentication policies, including basic authentication, OAuth 2.0, SAML, mutual SSL, and API keys. In this blog post, we will explore the functionality of some authentication policies, when to use them, and how you can implement them based on your application needs</p>\n<p>You're not limited to the set of policy types provided by Apigee. You can also write custom scripts and code (such as JavaScript applications and Java), that extend API proxy functionality and enable you to innovate on top of the basic management capabilities supported by Apigee policies.</p>\n<h2 id=\"choosing-the-right-authentication-method-for-your-api-use-case\">Choosing the right authentication method for your API use case<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#choosing-the-right-authentication-method-for-your-api-use-case\"></a></h2>\n<p>Choosing a specific authentication method used will depend on the requirements of the API and the needs of the API client or user. Prior to choosing a given authentication method, practitioners should address the following design considerations</p>\n<ol>\n<li>Compatibility with API and client application: Consider addressing questions about the client – if it is a mobile or web application and if it requires assertion, and whether the end user has given the application consent to access resources on their behalf.</li>\n<li>Identity provider: API Management solutions (like Apigee) generally provide few out-of-the-box capabilities like automatically issuing client credentials. But organizations might want to manage user identities using custom capabilities or choose to use an external IdP to ensure consistency across multiple platforms.</li>\n<li>Security: Different authentication methods provide varying levels of security for your API and its resources. For example, if your API handles sensitive data, you may want to use a stronger authentication method such as OAuth 2.0 or mutual SSL.</li>\n<li>Self-service onboarding support: Consider the onboarding flow of your consumer developers. Specifically if the authentication method should support them in onboarding to an API with self-service</li>\n<li>End user authentication: Should your method also support authentication calls with end users (human only)?</li>\n<li>Developer engagement analytics: Should your authentication method also allow you to capture analytics data about the developers and apps using your APIs?</li>\n</ol>\n<p>Based on these criteria, we have identified a few commonly used authentication methods that can be implemented in Apigee. With the framework below, you can choose the authentication method that best suits your API use case</p>\n<p><img src=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/1_REST_API_authentication.max-1400x1400.jpg\" alt=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/1_REST_API_authentication.max-1400x1400.jpg\"></p>\n<h3 id=\"1-api-key-identification-only\">#1 API Key (identification only)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#1-api-key-identification-only\"></a></h3>\n<p>One of the easiest ways to identify an API client is by using an API key. Apigee’s built-in identity provider can issue client identifiers to be used as API keys and validated with the out-of-the-box <a href=\"https://cloud.google.com/apigee/docs/api-platform/reference/policies/verify-api-key-policy\">VerifyAPIKey</a> policy.</p>\n<p>The simplicity of API keys comes with the caveat that this mechanism can only be used for identifying incoming requests. It should not be used as an authentication mechanism in untrusted environments. API keys are generally long-lived and can often be read from access logs or are not properly masked in tooling.</p>\n<p><img src=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/2_REST_API_authentication.max-600x600.jpg\" alt=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/2_REST_API_authentication.max-600x600.jpg\"></p>\n<h3 id=\"2-oauth2-token\">#2 OAuth2 token<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#2-oauth2-token\"></a></h3>\n<p>OAuth2 is a comprehensive industry standard that is widely used across API providers. Apigee supports a variety of different grant types for OAuth2 — as described in the official <a href=\"https://cloud.google.com/apigee/docs/api-platform/security/oauth/oauth-home\">documentation</a> — and most widely-adapted Apigee authentication mechanisms are built using the OAuth2 standard.</p>\n<p>A common implementation is to access APIs with the OAuth2 client credentials grant type. In this scenario, the API client uses its client ID and client secret to request an access token. The access token is then used on subsequent calls against the protected endpoints to authenticate the API client. Both the issuance of access tokens and their verification can be achieved using the built-in Apigee policy, as described <a href=\"https://cloud.google.com/apigee/docs/api-platform/security/oauth/oauth-20-client-credentials-grant-type\">here</a>.</p>\n<p><img src=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/3_REST_API_authentication.max-1000x1000.jpg\" alt=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/3_REST_API_authentication.max-1000x1000.jpg\"></p>\n<h3 id=\"3-external-token-or-assertion\">#3 External token or assertion<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#3-external-token-or-assertion\"></a></h3>\n<p>By using externally generated tokens, Apigee only cryptographically verifies that the token is issued by a trusted issuer. Apigee is not involved in issuing the token and does not automatically hold any information about the application, developer, or API product that is associated with the API request.</p>\n<p>For scenarios where some of these aspects are required — such as providing insights into developer engagement or easily restricting the usage of a token to a specific Apigee environment — additional synchronization of the Apigee identities and the externally managed identities is required. One common way to associate externally-managed identities with Apigee resources is to synchronize the Apigee and external IdPs through automation and the <a href=\"https://cloud.google.com/apigee/docs/reference/apis/apigee/rest/v1/organizations.developers.apps.keys\">Apigee API</a>. Technically, this means that the client ID — or API key — of an Apigee app can be included within the claims of a third party token so that the Apigee proxy can identify the client application after the authentication through the <a href=\"https://cloud.google.com/apigee/docs/api-platform/reference/policies/verify-jwt-policy\">JWT signature validation</a>.</p>\n<p>Alternatively the POST request to /token for the external IdP can be proxied through Apigee, and the externally-created token can be imported via the Apigee OAuth2 policy and used in subsequent calls, as documented <a href=\"https://cloud.google.com/apigee/docs/api-platform/security/oauth/use-third-party-oauth-system#policyflowforthirdpartyoauthonapigee-externalvalidationofclientcredentials\">here</a>.</p>\n<p><img src=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/4_REST_API_authentication.max-1000x1000.jpg\" alt=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/4_REST_API_authentication.max-1000x1000.jpg\"></p>\n<h3 id=\"4-token-exchange\">#4 Token Exchange<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#4-token-exchange\"></a></h3>\n<p>In Apigee, a SAML (Security Assertion Markup Language) assertion can be used to exchange a token between an identity provider (IdP) and a service provider (SP). SAML is a standard protocol that allows the exchange of authentication and authorization data between different systems. In the context of token exchange, a SAML assertion is a signed XML document that contains information about the authenticated user, such as their identity and any authorization permissions they may have.</p>\n<p>A token exchange — as described in <a href=\"https://datatracker.ietf.org/doc/html/rfc8693\">RFC8693</a> — starts the same way as the external token approach described above. In this case however, the externally issued token is exchanged for an Apigee-issued token. The process of exchanging an external token or <a href=\"https://cloud.google.com/apigee/docs/api-platform/reference/policies/saml-assertion-policy#validate-saml-assertion\">SAML assertion</a> for an Apigee-issued token adds an additional layer of trust as the external token can only be used to obtain an Apigee token through authorized applications rather than accessing the resource APIs directly. Additionally, you can automatically make the Apigee application, developer, and API product contexts available if they can be gained through the verification of the exchanging client application’s client credentials.</p>\n<p>Using SAML assertions to exchange tokens in this way can allow client applications to take advantage of existing authentication systems, while still being able to access protected resources through the service provider.</p>\n<p><img src=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/5_REST_API_authentication.max-1000x1000.jpg\" alt=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/5_REST_API_authentication.max-1000x1000.jpg\"></p>\n<h3 id=\"5-identity-facade-for-3-legged-oauth\">#5 Identity facade for 3 legged OAuth<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#5-identity-facade-for-3-legged-oauth\"></a></h3>\n<p>Identity facade is a layer that sits between a client application and an OAuth authorization server. Its primary purpose is to abstract the underlying authentication mechanisms from the client application, so that the client does not need to be aware of the specific details of how user authentication is implemented. This can make it easier for developers to build client applications that support OAuth, as they do not need to be familiar with the details of the OAuth protocol.</p>\n<p>In addition to abstracting the authentication and authorization mechanisms, an identity facade can also provide other services, such as handling user management and providing additional security measures. But the main disadvantage of the token exchange (explained in the earlier section) is that the burden of exchanging the external IdP token for an Apigee token is on the API consumer. Consumers have to explicitly make an additional call to exchange the token and are temporarily holding on to the external token.</p>\n<p>Identity facade for 3 legged OAuth avoids that burden by creating a facade for an external token. This facade proxy calls the token endpoint and then mints an Apigee-issued token that links to the external token. This way, a token validation in Apigee makes the external token available within the flow such that it can be used to call downstream systems.</p>\n<p>Because the token is intercepted through the facade, the API client doesn’t have access to the external token directly, meaning that clients won’t be able to circumvent the API proxy by calling the backends directly and using the external token. From a client perspective, the facade nature is transparent and the OAuth flow looks identical to any other authorization code flow.</p>\n<p>To simplify the implementation of this pattern we provide a <a href=\"https://github.com/apigee/devrel/tree/main/references/identity-facade\">reference implementation</a> of an identity facade that can be used to front any OIDC compliant IdP.</p>\n<h3 id=\"get-started-with-authentication-policies-in-apigee\">Get started with authentication policies in Apigee?<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#get-started-with-authentication-policies-in-apigee\"></a></h3>\n<p>These are just a few of the many other security policies that you can use with Apigee. You can even write custom scripts that extend API proxy functionalities for specialized use cases. For hands-on experience on implementing authentication and other security policies in Apigee, check out our <a href=\"https://www.cloudskillsboost.google/course_templates/255\">Skillsboost lab</a> or watch this <a href=\"https://cloudonair.withgoogle.com/events/innovators-api-security-apigee\">API Security webinar</a> on demand. For a deep dive on authentication, reference architectures, and comprehensive examples check out our repository on <a href=\"https://github.com/apigee/devrel/tree/main/references/auth-schemes\">GitHub</a>.</p>\n<p>Get started with <a href=\"https://cloud.google.com/apigee\">Apigee</a> today or check out our <a href=\"https://cloud.google.com/apigee/docs/api-monitoring\">documentation</a> for additional information. Or if you are interested in continuing the conversation, join our <a href=\"https://cloud.google.com/apigee/resources\">Google Cloud Innovator community</a>.</p>","noteIndex":{"id":"Iy0MoL0KnL55Br3AfTS2C","title":"Luke","desc":"","updated":1766965759366,"created":1644449449778,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"a724de3efd251cf89fe82a5860d9008b","links":[{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"life-tips","position":{"start":{"line":43,"column":5,"offset":2710},"end":{"line":43,"column":29,"offset":2734},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"life-tips","anchorHeader":"wodenokoto"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2026.articles","alias":"What I read in 2026","position":{"start":{"line":72,"column":3,"offset":4440},"end":{"line":72,"column":45,"offset":4482},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2026.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2025.articles","alias":"2025","position":{"start":{"line":73,"column":5,"offset":4487},"end":{"line":73,"column":32,"offset":4514},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2025.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2024.articles","alias":"2024","position":{"start":{"line":74,"column":5,"offset":4519},"end":{"line":74,"column":32,"offset":4546},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2024.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2023.articles","alias":"2023","position":{"start":{"line":75,"column":5,"offset":4551},"end":{"line":75,"column":32,"offset":4578},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2023.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2022.articles","alias":"2022","position":{"start":{"line":76,"column":5,"offset":4583},"end":{"line":76,"column":32,"offset":4610},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2022.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"journal.what-i-struggled-brag-in","position":{"start":{"line":82,"column":3,"offset":4746},"end":{"line":82,"column":39,"offset":4782},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"journal.what-i-struggled-brag-in"}}],"anchors":{"what-i-read-in-past":{"type":"header","text":"What I read in past","value":"what-i-read-in-past","line":76,"column":0,"depth":2}},"children":["zd4mq442jike0pr0wba1u3m","6hzeqsofq67gdk88flxlkhp","778ijii93yu5uwnrwmn5zi4","g1fngdjl25nes6fs3lip602","ZbdkdApFqLdks4Moq92R9","uoc5hhki3o4py15cesddu8q","9qf7j06jtdkm6rnx9ymvwb0","5zn10cvj7ajy2gh2is5nqmg","4qo9ma0z0yu1czns6pxl7y5","ok0e729ho7o09xetujkxc0m","GR5x8HnNFEN6fU2UBSEIK","yirtnlj8q24yutcf3ss1xqy","eq0wc6t7wl2wv221yb68ro4","7x2fnv4j6gxts08qk0jguny","ettkt3iClONnxpbGwBVLl","7l4knev6v613tbuoskvmbdg","hvh5bud6yp7dc89tuh95tr9","4fvoqrplw0cweo554usbjos","f8qsfql0a9v8thpeo82udfa","1swsbrhqi9jk41v9eodyi5q","SQqYupi6EFddTerBA8RRD","hjNeNc1F2JUh0lTWanH4h","qf0l4wbrc9jgooyzexmbq5v","o7xruzrah5wzqetottecss7","z1zo2mp6ddji5p317i4x9xw","v06c2tjelh341x4resa50fh","0yqesk4rcffwgyuab5x8rfa","sy2vkbtyu671chkvgn1yt8j","ufixpmxoydiccoh59kphrib","alswadkx4wb05y1z9iwfzfv","1daut9dpw70xd0zh5a7j5p4"],"parent":null,"data":{},"body":"\nHi there 👋. I'm a Front-end developer.\n\n---\n\n- 현실은 인간의 연산으로 완전히 파악할 수 없는 복잡계. 주어진 상황과 능력으로 할 수 있는 최선의 적응은 단순함과 꾸준함.\n\n  - 파산을 면하는 선에서 여러가지를 해보고 자신에게 맞는 걸 위주로 꾸준히. 그를 위해 단순, 편안, 쾌적함이 필요.\n\n- 🥱 -> 🤔💡🌱 - [On The Death of Daydreaming](https://www.afterbabel.com/p/on-the-death-of-daydreaming)\n  - boredom -> easy fun -> art -> profit?\n\n> I've often described my motivation for building software to others using imagery: I like to go find a secluded beach, build a large, magnificent sand castle, and then walk away. Will anyone notice? Probably not. Will the waves eventually destroy it? Yep. Did I still get immense satisfaction? Absolutely. - [aliasxneo](https://news.ycombinator.com/item?id=41497113)\n\n> We love to see the process, not just the result. The imperfections in your work can be beautiful if they show your struggle for perfection, not a lack of care. - [ralphammer](https://ralphammer.com/is-perfection-boring/)\n\n> Simplicity, even if it sacrifices some ideal functionality has better survival characteristics than the-right-thing. - [The Rise of Worse is Better](https://www.dreamsongs.com/RiseOfWorseIsBetter.html)\n\n> [Roberto Blake was talking about making 100 crappy videos](https://www.youtube.com/watch?v=OnUBaQ1Sp_E) to get better over time. Putting in the reps and improving a little bit each time.\n>\n> Putting in the work without expecting any external reward at first (eg views, followers, likes, etc) will pay off in the long run. - [100 Scrappy Things](https://www.florin-pop.com/blog/100-scrappy-things/)\n\n> Make the difficult habitual, the habitual easy, and the easy beautiful. - [Constantin S. Stanislavski](https://www.goodreads.com/quotes/7102271-make-the-difficult-habitual-the-habitual-easy-and-the-easy)\n\n> A good match is a **structured** dance, where players aim to **score** while they are following well-defined **rules**. This **freedom within a structure** is what makes it fun. - [ralphammer](https://ralphammer.com/how-to-get-started/)\n\n- [Pivot Points](https://longform.asmartbear.com/pivot-points/)\n\n  - non-judgmental aspects of personality that can be strengths in some contexts and weaknesses in others\n  - Pivot Points are fixed in the short term\n\n- [Hedged Bets](https://longform.asmartbear.com/predict-the-future/#hedged-bets)\n  - trading slightly less maximum upside for predictable, net-positive outcomes.\n\n> “Motivation often comes after starting, not before. Action produces momentum.”\n> [When you start a new habit, it should take less than two minutes to do.](https://jamesclear.com/how-to-stop-procrastinating)\n>\n> - James Clear\n\n> Focus is more about **not** keeping busy when you need to wait for something.  \n> Eat the boredom for a minute.\n>\n> - [[life-tips#wodenokoto]]\n\n> [4 minutes run hard enough to push heart rate to 90%, 3 minutes recover, repeat 4 times](https://news.ycombinator.com/item?id=34213181)\n>\n> - https://www.ntnu.edu/cerg/advice\n> - [Get running with Couch to 5K](https://www.nhs.uk/live-well/exercise/running-and-aerobic-exercises/get-running-with-couch-to-5k/)\n\n> [recommended routine - bodyweightfitness](https://www.reddit.com/r/bodyweightfitness/wiki/kb/recommended_routine/) - I Don't Have This Much Time!\n>\n> - Don't workout at all (saves anywhere from 20 to 60 minutes, but really, really, really, really, really, really, really, really, really not recommended)\n\n> 도무지 읽히지 않는 책 앞에서 내가 택한 방법은 펼쳐진 페이지 앞에서 멍때리기이다. 다르게 표현하면 이렇다. 펼쳐진 두 페이지 앞에서 오래 머물기.\n>\n> 책을 펼쳐놓는 것으로 충분하다. 읽지 못해도 좋다. 매일 정해진 진도를 나가야 하는 학교 수업이 아니니까. 하지만 읽지 않아도 괜찮다고 해서 펼쳐두지조차 않으면 곤란하다. 가능한 한 자주 책을 펼쳐두도록 하자. 전혀 읽지 않고 멍하니 바라보고 있다가 다시 덮게 되더라도\n>\n> - 막막한 독서. 시로군. P.10~13\n\n> I think it should be everyone's primary focus to sleep well, drink water, get outside, get active, and eat generally decently. I hate to say it, but if you're not eating a good amount of vegetables and fruit, decent protein, sleep, etc, no amount of XYZ will catch up to that detriment. - [CE02](https://news.ycombinator.com/item?id=35056071)\n\n> My real battle is doing good versus doing nothing. - [Deirdre Sullivan](https://www.npr.org/2005/08/08/4785079/always-go-to-the-funeral)\n\n[Kind Engineering](https://kind.engineering/) - How To Engineer Kindness\n\n> Sometimes magic is just someone spending more time on something than anyone else might reasonably expect. - [Teller](https://www.goodreads.com/quotes/6641527-sometimes-magic-is-just-someone-spending-more-time-on-something)\n\n---\n\n## What I read in past\n\n- [[What I read in 2026|read.2026.articles]]\n  - [[2025|read.2025.articles]]\n  - [[2024|read.2024.articles]]\n  - [[2023|read.2023.articles]]\n  - [[2022|read.2022.articles]]\n- 📝 [Gists](https://gist.github.com/Luke-SNAW)\n- 📜 [Journals](https://luke-snaw.github.io/Luke-SNAW__netlify-CMS.github.io/)\n\n---\n\n- [[journal.what-i-struggled-brag-in]]\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":false,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.115.0","enableFullHierarchyNoteTitle":false,"enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Luke SNAW","description":"Personal knowledge space"},"github":{"enableEditLink":false,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","siteUrl":"https://luke-snaw.github.io/","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}