{"pageProps":{"note":{"id":"qau8nrcnn6buzigodgxga74","title":"Postgres is eating the database world","desc":"","updated":1712276262788,"created":1712275400115,"custom":{},"fname":"dev.DB.postgres.postgres-is-eating-the-database-world","type":"note","vault":{"fsPath":"vault"},"contentHash":"30764737680e1f7a43da1c3e0c79894a","links":[],"anchors":{"olaps-new-challenger":{"type":"header","text":"OLAP’s New Challenger","value":"olaps-new-challenger","line":14,"column":0,"depth":2},"the-pendulum-of-database-realm":{"type":"header","text":"The Pendulum of Database Realm","value":"the-pendulum-of-database-realm","line":32,"column":0,"depth":2},"postgresql-the-database-world-eater":{"type":"header","text":"PostgreSQL: The Database World Eater","value":"postgresql-the-database-world-eater","line":54,"column":0,"depth":2},"the-magic-of-extreme-extensibility":{"type":"header","text":"The Magic of Extreme Extensibility","value":"the-magic-of-extreme-extensibility","line":68,"column":0,"depth":2},"game-changer-in-the-db-arena":{"type":"header","text":"Game Changer in the DB Arena","value":"game-changer-in-the-db-arena","line":88,"column":0,"depth":2},"what-else-can-be-done":{"type":"header","text":"What Else Can Be Done?","value":"what-else-can-be-done","line":105,"column":0,"depth":2},"our-resolution-pigsty":{"type":"header","text":"Our Resolution: Pigsty","value":"our-resolution-pigsty","line":127,"column":0,"depth":2}},"children":[],"parent":"xyg5ao6vugkef44ahxssq60","data":{}},"body":"<h1 id=\"postgres-is-eating-the-database-world\">Postgres is eating the database world<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#postgres-is-eating-the-database-world\"></a></h1>\n<blockquote>\n<p><a href=\"https://medium.com/@fengruohang/postgres-is-eating-the-database-world-157c204dcfc4\">https://medium.com/@fengruohang/postgres-is-eating-the-database-world-157c204dcfc4</a></p>\n<p>PostgreSQL is emerging as a dominant database platform that is capable of handling a wide range of use cases, from OLTP to OLAP workloads. Its extensibility through a thriving ecosystem of add-ons and integrations allows it to compete with specialized databases across various domains like time-series, geospatial, and vector data. The rise of analytical extensions like ParadeDB and DuckDB have further bolstered PostgreSQL's capabilities, making it a viable alternative to dedicated data warehousing solutions. As hardware advancements have addressed performance and scalability concerns, the need for separate OLTP and OLAP systems is diminishing, leading to a convergence where PostgreSQL can serve as a unified, multi-model database. The author argues that the real competitive frontier now lies in leveraging PostgreSQL's extensibility through integrated distributions and services, rather than focusing on the core database kernel.</p>\n</blockquote>\n<p>PostgreSQL isn’t just a simple relational database; it’s a data management framework with the potential to engulf the entire database realm. The trend of “Using Postgres for Everything” is no longer limited to a few elite teams but is becoming a mainstream best practice.</p>\n<h2 id=\"olaps-new-challenger\">OLAP’s New Challenger<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#olaps-new-challenger\"></a></h2>\n<p>In a 2016 database meetup, I argued that a significant gap in the PostgreSQL ecosystem was the lack of a <strong>sufficiently good</strong> columnar storage engine for OLAP workloads. While PostgreSQL itself offers lots of analysis features, its performance in full-scale analysis on larger datasets doesn’t quite measure up to dedicated real-time data warehouses.</p>\n<p>Consider <a href=\"https://benchmark.clickhouse.com/\">ClickBench</a>, an analytics performance benchmark, where we’ve documented the performance of PostgreSQL, its ecosystem extensions, and derivative databases. The untuned PostgreSQL performs poorly (<strong>x1050</strong>), but it can reach (<strong>x47</strong>) with optimization. Additionally, there are three analysis-related extensions: columnar store <strong>Hydra</strong> (<strong>x42</strong>), time-series <strong>TimescaleDB</strong> (<strong>x103</strong>), and distributed <strong>Citus</strong> (<strong>x262</strong>).</p>\n<blockquote>\n<p>Clickbench c6a.4xlarge, 500gb gp2 results in relative time (<a href=\"https://miro.medium.com/v2/resize:fit:700/0*D9Q_NCCY_vjWQEeI.png\">image</a>)</p>\n</blockquote>\n<p>This performance can’t be considered bad, especially compared to pure OLTP databases like MySQL and MariaDB (<strong>x3065, x19700</strong>); however, its third-tier performance is not “good enough,” lagging behind the first-tier OLAP components like Umbra, ClickHouse, Databend, SelectDB (<strong>x3~x4</strong>) by an order of magnitude. It’s a tough spot — not satisfying enough to use, but too good to discard.</p>\n<p>However, the arrival of <a href=\"https://www.paradedb.com/\"><strong>ParadeDB</strong></a> and <a href=\"https://duckdb.org/\"><strong>DuckDB</strong></a> changed the game!</p>\n<p><strong>ParadeDB</strong>’s native PG extension <strong>pg_analytics</strong> achieves second-tier performance (<strong>x10</strong>), narrowing the gap to the top tier to just 3–4x. Given the additional benefits, this level of performance discrepancy is often acceptable — ACID, freshness and real-time data without ETL, no additional learning curve, no maintenance of separate services, not to mention its ElasticSearch grade full-text search capabilities.</p>\n<p><strong>DuckDB</strong> focuses on pure OLAP, pushing analysis performance to the extreme (<strong>x3.2</strong>) — excluding the academically focused, closed-source database Umbra, DuckDB is arguably the fastest for practical OLAP performance. It’s not a PG extension, but PostgreSQL can fully leverage DuckDB’s analysis performance boost as an embedded file database through projects like <a href=\"https://github.com/alitrack/duckdb_fdw\"><strong>DuckDB FDW</strong></a> and <a href=\"https://github.com/hydradatabase/pg_quack\"><strong>pg_quack</strong></a>.</p>\n<p>The emergence of ParadeDB and DuckDB propels PostgreSQL’s analysis capabilities to the top tier of OLAP, filling the last crucial gap in its analytic performance.</p>\n<h2 id=\"the-pendulum-of-database-realm\">The Pendulum of Database Realm<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-pendulum-of-database-realm\"></a></h2>\n<p>The distinction between OLTP and OLAP didn’t exist at the inception of databases. The separation of OLAP data warehouses from databases emerged in the 1990s due to traditional OLTP databases struggling to support analytics scenarios' query patterns and performance demands.</p>\n<p>For a long time, best practice in data processing involved using MySQL/PostgreSQL for OLTP workloads and syncing data to specialized OLAP systems like Greenplum, ClickHouse, Doris, Snowflake, etc., through ETL processes.</p>\n<blockquote>\n<p>DDIA ch3: Republic of OLTP &#x26; Kingdom of Analytics (<a href=\"https://miro.medium.com/v2/resize:fit:700/0*e4vzZ5k5BLRthQzb.png\">image</a>)</p>\n</blockquote>\n<p>Like many “specialized databases,” the strength of dedicated OLAP systems often lies in <strong>performance</strong> — achieving 1–3 orders of magnitude improvement over native PostgreSQL or MySQL. The <strong>cost</strong>, however, is redundant data, excessive data movement, lack of agreement on data values among distributed components, extra labor expense for specialized skills, extra licensing costs, limited query language power, programmability and extensibility, limited tool integration, poor data integrity and availability compared with a complete DMBS.</p>\n<p>However, as the saying goes, “What goes around comes around”. With <a href=\"https://pigsty.io/blog/cloud/bonus/\">hardware improving over thirty years following Moore’s Law</a>, performance has increased exponentially while costs have plummeted. In 2024, a single x86 server can have hundreds of cores (512 vCPU, <a href=\"https://www.amd.com/zh-hans/products/cpu/amd-epyc-9754\">EPYC 9754</a> x2), several TBs of RAM, a <a href=\"https://www.storagereview.com/review/kioxia-cm7-gen5-enterprise-ssd-review\">single</a> NVMe SSD can hold <strong>up to</strong> 64TB / 3M 4K rand IOPS / 14GB /s, and a single all-flash rack can reach several PB; object storage like S3 offers virtually unlimited storage.</p>\n<blockquote>\n<p>I/O Bandwidth doubles every 3 years (<a href=\"https://miro.medium.com/v2/resize:fit:700/0*EPklhaQZ0cWx1_k9.png\">image</a>)</p>\n</blockquote>\n<p>Hardware advancements have solved the data volume and performance issue, while database software developments (PostgreSQL, ParadeDB, DuckDB) have addressed access method challenges. This puts the fundamental assumptions of the analytics sector — the so-called “big data” industry — <strong>under scrutiny</strong>.</p>\n<p>As DuckDB’s manifesto <a href=\"https://motherduck.com/blog/big-data-is-dead/\">“<strong>Big Data is Dead</strong>”</a> suggests, <strong>the era of big data is over</strong>. Most people don’t have that much data, and most data is seldom queried. The frontier of big data recedes as hardware and software evolve, rendering “big data” unnecessary for 99% of scenarios.</p>\n<p>If 99% of use cases can now be handled on a single machine with standalone PostgreSQL / DuckDB (and its replicas), what’s the point of using dedicated analytics components? If every smartphone can send and receive text freely, what’s the point of pagers? (With the caveat that North American hospitals still use pagers, indicating that maybe less than 1% of scenarios might genuinely need “big data.”)</p>\n<p>The shift in fundamental assumptions is steering the database world from a phase of diversification back to convergence, from a big bang to a mass extinction. In this process, a new era of unified, multi-modeled, super-converged databases will emerge, reuniting OLTP and OLAP. But who will lead this monumental task of reconsolidating the database field?</p>\n<h2 id=\"postgresql-the-database-world-eater\">PostgreSQL: The Database World Eater<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#postgresql-the-database-world-eater\"></a></h2>\n<p>There are a plethora of niches in the database realm: time-series, geospatial, document, search, graph, vector databases, message queues, and object databases. PostgreSQL makes its presence felt across all these domains.</p>\n<p>A case in point is the PostGIS extension, which sets the de facto standard in geospatial databases; the TimescaleDB extension awkwardly positions “generic” time-series databases; and the vector extension, <strong>PGVector</strong>, turns the dedicated vector database niche into a punchline.</p>\n<p>This isn’t the first time; we’re witnessing it again in the oldest and largest subdomain: OLAP analytics. But PostgreSQL’s ambition doesn’t stop at OLAP; it’s eyeing the entire database world!</p>\n<blockquote>\n<p>PostgreSQL Ecosystem (<a href=\"https://miro.medium.com/v2/resize:fit:700/1*LS0j83YKz6ravfRVYpyAZw.png\">image</a>)</p>\n</blockquote>\n<p>What makes PostgreSQL so capable? Sure, it’s advanced, but so is Oracle; it’s open-source, as is MySQL. PostgreSQL’s edge comes from being <strong>both advanced and open-source</strong>, allowing it to compete with Oracle/MySQL. But its true uniqueness lies in its <strong>extreme extensibility and thriving extension ecosystem</strong>.</p>\n<p><em>Reasons users</em> <a href=\"https://www.timescale.com/state-of-postgres/2022\"><em>choose PostgreSQL</em></a><em>:</em> <strong><em>Open-Source, Reliable, Extensible</em></strong> (<a href=\"https://miro.medium.com/v2/resize:fit:700/0*XErRY2DBfSm1V65H.png\">image</a>)</p>\n<h2 id=\"the-magic-of-extreme-extensibility\">The Magic of Extreme Extensibility<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-magic-of-extreme-extensibility\"></a></h2>\n<p>PostgreSQL isn’t just a relational database; it’s a data management framework capable of engulfing the entire database galaxy. Besides being open-source and advanced, its core competitiveness stems from <strong>extensibility</strong>, i.e., its infra’s reusability and extension's composability.</p>\n<p>PostgreSQL allows users to develop extensions, leveraging the database’s common infra to deliver features at minimal cost. For instance, the vector database extension <a href=\"https://github.com/pgvector/pgvector\">pgvector</a>, with just several thousand lines of code, is negligible in complexity compared to PostgreSQL’s millions of lines. Yet, this “insignificant” extension achieves complete vector data types and indexing capabilities, <a href=\"https://supabase.com/blog/pgvector-vs-pinecone\">outperforming</a> lots of specialized vector databases.</p>\n<p>Why? Because pgvector’s creators didn’t need to worry about the database’s general additional complexities: ACID, recovery, backup &#x26; PITR, high availability, access control, monitoring, deployment, 3rd-party ecosystem tools, client drivers, etc., which require millions of lines of code to solve well. They only focused on the essential complexity of their problem.</p>\n<p>For example, ElasticSearch was developed on the Lucene search library, while the Rust ecosystem has an improved next-gen full-text search library, <a href=\"https://github.com/quickwit-oss/tantivy\"><strong>Tantivy</strong></a>, as a Lucene alternative. ParadeDB only needs to wrap and connect it to PostgreSQL’s interface to offer search services comparable to ElasticSearch. More importantly, it can stand on the shoulders of PostgreSQL, leveraging the entire PG ecosystem’s united strength (e.g., hybrid search with pgvector) to “unfairly” compete with another dedicated database.</p>\n<blockquote>\n<p><em>Pigsty &#x26; PGDG has 234</em> <a href=\"https://pigsty.io/docs/reference/extension/\"><strong><em>extensions</em></strong></a> <em>available. And there are</em> <a href=\"https://gist.github.com/joelonsql/e5aa27f8cc9bd22b8999b7de8aee9d47\"><em>1000+</em></a> <em>more in the ecosystem</em> (<a href=\"https://miro.medium.com/v2/resize:fit:700/1*TkYEVy5Urb5k5DiF4o67tA.png\">image</a>)</p>\n</blockquote>\n<p>The extensibility brings another huge advantage: the <strong>composability</strong> of extensions, allowing different extensions to work together, creating a synergistic effect where 1+1 » 2. For instance, TimescaleDB can be combined with PostGIS for spatial-temporal data support; the BM25 extension for full-text search can be combined with the PGVector extension, providing hybrid search capabilities.</p>\n<p>Furthermore, the <strong>distributive</strong> extension <a href=\"https://www.citusdata.com/\"><strong>Citus</strong></a> can transparently transform a standalone cluster into a horizontally partitioned distributed database cluster. This capability can be orthogonally combined with other features, making PostGIS a distributed geospatial database, PGVector a distributed vector database, ParadeDB a distributed full-text search database, and so on.</p>\n<p>What’s more powerful is that extensions <strong>evolve independently</strong>, without the cumbersome need for main branch merges and coordination. This allows for scaling — PG’s extensibility lets numerous teams explore database possibilities in parallel, with all extensions being optional, not affecting the core functionality’s reliability. Those features that are mature and robust have the chance to be stably integrated into the main branch.</p>\n<p>PostgreSQL achieves both foundational <strong>reliability</strong> and <strong>agile functionality</strong> through the magic of extreme extensibility, making it an outlier in the database world and changing the game rules of the database landscape.</p>\n<h2 id=\"game-changer-in-the-db-arena\">Game Changer in the DB Arena<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#game-changer-in-the-db-arena\"></a></h2>\n<p><strong>The emergence of PostgreSQL has shifted the paradigms in the database domain</strong>: Teams endeavoring to craft a “new database kernel” now face a formidable trial — how to stand out against the open-source, feature-rich Postgres. What’s their unique value proposition?</p>\n<p>Until a revolutionary hardware breakthrough occurs, the advent of practical, new, general-purpose database kernels seems unlikely. No singular database can match the overall prowess of PG, bolstered by all its extensions — not even Oracle, given PG’s ace of being open-source and free ;-)</p>\n<p>A niche database product might carve out a space for itself if it can outperform PostgreSQL by an order of magnitude in specific aspects (typically performance). However, it usually doesn’t take long before the PostgreSQL ecosystem spawns open-source extension alternatives. Opting to develop a PG extension rather than a whole new database gives teams a crushing speed advantage in playing catch-up!</p>\n<p>Following this logic, the PostgreSQL ecosystem is poised to snowball, accruing advantages and inevitably moving towards a monopoly, mirroring the Linux kernel’s status in server OS within a few years. Developer surveys and database trend reports confirm this trajectory.</p>\n<blockquote>\n<p><a href=\"https://survey.stackoverflow.co/2023/#section-most-popular-technologies-databases\"><strong><em>StackOverflow 2023 Survey: PostgreSQL, the Decathlete</em></strong></a> (<a href=\"https://miro.medium.com/v2/resize:fit:700/0*8tDNQcORMvKKknHq.png\">image</a>)<br>\n<a href=\"https://demo.pigsty.cc/d/sf-survey\"><strong><em>StackOverflow’s Database Trends Over the Past 7 Years</em></strong></a> (<a href=\"https://miro.medium.com/v2/resize:fit:700/1*pHzfwBtDYSgVU7SVAZCGMg.png\">image</a>)</p>\n</blockquote>\n<p>PostgreSQL has long been the favorite database in HackerNews &#x26; StackOverflow. Many new open-source projects default to PostgreSQL as their primary, if not only, database choice. And many new-gen companies are going All in PostgreSQL.</p>\n<p>As “<a href=\"https://www.amazingcto.com/postgres-for-everything/\"><strong>Radical Simplicity: Just Use Postgres</strong></a>” says, Simplifying tech stacks, reducing components, accelerating development, lowering risks, and adding more features can be achieved by <strong>“Just Use Postgres.”</strong> Postgres can replace many backend technologies, including MySQL, Kafka, RabbitMQ, ElasticSearch, Mongo, and Redis, effortlessly serving millions of users. <strong>Just Use Postgres</strong> is no longer limited to a few elite teams but becoming a mainstream best practice.</p>\n<h2 id=\"what-else-can-be-done\">What Else Can Be Done?<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#what-else-can-be-done\"></a></h2>\n<p>The endgame for the database domain seems predictable. But what can we do, and what should we do?</p>\n<p>PostgreSQL is already a near-perfect database kernel for the vast majority of scenarios, making the idea of a kernel “bottleneck” absurd. Forks of PostgreSQL and MySQL that tout kernel modifications as selling points are essentially going nowhere.</p>\n<p>This is similar to the situation with the Linux OS kernel today; despite the plethora of Linux distros, everyone opts for the same kernel. Forking the Linux kernel is seen as creating unnecessary difficulties, and the industry frowns upon it.</p>\n<p>Accordingly, the main conflict is no longer the database kernel itself but two directions— database <strong>extensions</strong> and <strong>services</strong>! The former pertains to internal extensibility, while the latter relates to external composability. Much like the OS ecosystem, the competitive landscape will concentrate on <strong>database distributions</strong>. In the database domain, only those distributions centered around extensions and services stand a chance for ultimate success.</p>\n<p>Kernel remains lukewarm, with MariaDB, the fork of MySQL’s parent, nearing delisting, while AWS, profiting from offering services and extensions on top of the free kernel, thrives. Investment has flowed into numerous PG ecosystem extensions and service distributions: Citus, TimescaleDB, Hydra, PostgresML, ParadeDB, FerretDB, StackGres, Aiven, Neon, Supabase, Tembo, PostgresAI, and our own PG distro — — <a href=\"https://pigsty.io/\">Pigsty</a>.</p>\n<p>A dilemma within the PostgreSQL ecosystem is the independent evolution of many extensions and tools, lacking a unifier to synergize them. For instance, Hydra releases its own package and Docker image, and so does PostgresML, each distributing PostgreSQL images with their own extensions and only their own. These images and packages are far from comprehensive database services like AWS RDS.</p>\n<p>Even service providers and ecosystem integrators like AWS fall short in front of numerous extensions, unable to include many due to various reasons (AGPLv3 license, security challenges with multi-tenancy), thus failing to leverage the synergistic amplification potential of PostgreSQL ecosystem extensions.</p>\n<blockquote>\n<p><em>Many important extensions are not available on Cloud RDS (PG 16, 2024–02–29), Check the full extension list for details:</em> <a href=\"https://pigsty.io/docs/reference/extension/\"><strong>Pigsty RDS &#x26; PGDG</strong></a> <strong>/</strong> <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/PostgreSQLReleaseNotes/postgresql-extensions.html\"><strong>AWS RDS PG</strong></a> <strong>/</strong> <a href=\"https://help.aliyun.com/zh/rds/apsaradb-rds-for-postgresql/extensions-supported-by-apsaradb-rds-for-postgresql\"><strong>Aliyun RDS PG</strong></a> (<a href=\"https://miro.medium.com/v2/resize:fit:700/1*DDrfCcJuFvsNeTLmP2Vl_A.png\">image</a>)</p>\n</blockquote>\n<p>Extensions are the soul of PostgreSQL. A Postgres without the freedom to use extensions is like cooking without salt, a giant constrained.</p>\n<p>Addressing this issue is one of our primary goals.</p>\n<h2 id=\"our-resolution-pigsty\">Our Resolution: Pigsty<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#our-resolution-pigsty\"></a></h2>\n<p>Despite earlier exposure to MySQL and MSSQL, when I first used PostgreSQL in 2015, I was convinced of its future dominance in the database realm. Nearly a decade later, I’ve transitioned from a user and administrator to a contributor and developer, witnessing PG’s march toward that goal.</p>\n<p>Interactions with diverse users revealed that the shortcoming in the database field isn’t the kernel anymore— PostgreSQL is already sufficient. The real issue is <strong>leveraging the kernel’s capabilities</strong>, which is the reason behind RDS’s booming success.</p>\n<p>However, I believe this capability should be as accessible as free software, like the PostgreSQL kernel itself — available to every user, not just renting from cyber feudal lords.</p>\n<p>Thus, I created <a href=\"https://pigsty.io/\"><strong>Pigsty</strong></a>, a battery-included, local-first PostgreSQL distribution as an open-source RDS Alternative, which aims to harness the collective power of PostgreSQL ecosystem <strong>extensions</strong> and democratize access to production-grade database <strong>services</strong>.</p>\n<p><img src=\"https://miro.medium.com/v2/resize:fit:700/0*k_M_SD4L10w1kL-Y.png\" alt=\"Pigsty\"></p>\n<p><em>Pigsty stands for</em> <strong><em>P</em></strong><em>ostgreSQL</em> <strong><em>i</em></strong><em>n</em> <strong><em>G</em></strong><em>reat</em> <strong><em>STY</em></strong><em>le</em></p>\n<p>We’ve defined six core propositions addressing the central issues in PostgreSQL database services: <strong>Extensible Postgres</strong>, <strong>Reliable Infras</strong>, <strong>Observable Graphics</strong>, <strong>Available Services</strong>, <strong>Maintainable Toolbox</strong>, and <strong>Composable Modules</strong>.</p>\n<p>The initials of these value propositions offer another acronym for Pigsty:</p>\n<blockquote>\n<p><strong><em>P</em></strong><em>ostgres,</em> <strong><em>I</em></strong><em>nfras,</em> <strong><em>G</em></strong><em>raphics,</em> <strong><em>S</em></strong><em>ervice,</em> <strong><em>T</em></strong><em>oolbox,</em> <strong><em>Y</em></strong><em>ours.</em></p>\n<p><em>Your graphical Postgres infrastructure service toolbox.</em></p>\n</blockquote>\n<p><strong>Extensible PostgreSQL</strong> is the linchpin of this distribution. In the recently launched <a href=\"https://github.com/Vonng/pigsty/releases/tag/v2.6.0\"><strong>Pigsty v2.6</strong></a>, we integrated DuckDB FDW and ParadeDB extensions, massively boosting PostgreSQL’s analytical capabilities and ensuring every user can easily harness this power.</p>\n<p>Our aim is to integrate the strengths within the PostgreSQL ecosystem, creating a synergistic force akin to the <strong>Ubuntu</strong> of the database world. I believe the kernel debate is settled, and the real competitive frontier lies here.</p>\n<p><img src=\"https://miro.medium.com/v2/resize:fit:700/1*8_vl0EPM5B9Uyl0T3vFKfg.png\" alt=\"https://pigsty.io\"></p>\n<ul>\n<li><a href=\"https://pigsty.io/\">https://pigsty.io</a></li>\n</ul>\n<p>Developers, your choices will shape the future of the database world. I hope my work helps you better utilize the world’s most advanced open-source database kernel: <strong>PostgreSQL</strong>.</p>\n<blockquote>\n<p><a href=\"https://pigsty.io/blog/pg/pg-eat-db-world/\">Read in Pigsty’s Blog</a> | <a href=\"https://github.com/Vonng/pigsty\">GitHub Repo: Pigsty</a> | <a href=\"https://pigsty.io/\">Pigsty Website</a></p>\n</blockquote>","noteIndex":{"id":"Iy0MoL0KnL55Br3AfTS2C","title":"Luke","desc":"","updated":1766965759366,"created":1644449449778,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"a724de3efd251cf89fe82a5860d9008b","links":[{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"life-tips","position":{"start":{"line":43,"column":5,"offset":2710},"end":{"line":43,"column":29,"offset":2734},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"life-tips","anchorHeader":"wodenokoto"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2026.articles","alias":"What I read in 2026","position":{"start":{"line":72,"column":3,"offset":4440},"end":{"line":72,"column":45,"offset":4482},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2026.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2025.articles","alias":"2025","position":{"start":{"line":73,"column":5,"offset":4487},"end":{"line":73,"column":32,"offset":4514},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2025.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2024.articles","alias":"2024","position":{"start":{"line":74,"column":5,"offset":4519},"end":{"line":74,"column":32,"offset":4546},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2024.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2023.articles","alias":"2023","position":{"start":{"line":75,"column":5,"offset":4551},"end":{"line":75,"column":32,"offset":4578},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2023.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2022.articles","alias":"2022","position":{"start":{"line":76,"column":5,"offset":4583},"end":{"line":76,"column":32,"offset":4610},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2022.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"journal.what-i-struggled-brag-in","position":{"start":{"line":82,"column":3,"offset":4746},"end":{"line":82,"column":39,"offset":4782},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"journal.what-i-struggled-brag-in"}}],"anchors":{"what-i-read-in-past":{"type":"header","text":"What I read in past","value":"what-i-read-in-past","line":76,"column":0,"depth":2}},"children":["zd4mq442jike0pr0wba1u3m","6hzeqsofq67gdk88flxlkhp","778ijii93yu5uwnrwmn5zi4","g1fngdjl25nes6fs3lip602","ZbdkdApFqLdks4Moq92R9","uoc5hhki3o4py15cesddu8q","9qf7j06jtdkm6rnx9ymvwb0","5zn10cvj7ajy2gh2is5nqmg","4qo9ma0z0yu1czns6pxl7y5","ok0e729ho7o09xetujkxc0m","GR5x8HnNFEN6fU2UBSEIK","yirtnlj8q24yutcf3ss1xqy","eq0wc6t7wl2wv221yb68ro4","7x2fnv4j6gxts08qk0jguny","ettkt3iClONnxpbGwBVLl","7l4knev6v613tbuoskvmbdg","hvh5bud6yp7dc89tuh95tr9","4fvoqrplw0cweo554usbjos","f8qsfql0a9v8thpeo82udfa","1swsbrhqi9jk41v9eodyi5q","SQqYupi6EFddTerBA8RRD","hjNeNc1F2JUh0lTWanH4h","qf0l4wbrc9jgooyzexmbq5v","o7xruzrah5wzqetottecss7","z1zo2mp6ddji5p317i4x9xw","v06c2tjelh341x4resa50fh","0yqesk4rcffwgyuab5x8rfa","sy2vkbtyu671chkvgn1yt8j","ufixpmxoydiccoh59kphrib","alswadkx4wb05y1z9iwfzfv","1daut9dpw70xd0zh5a7j5p4"],"parent":null,"data":{},"body":"\nHi there 👋. I'm a Front-end developer.\n\n---\n\n- 현실은 인간의 연산으로 완전히 파악할 수 없는 복잡계. 주어진 상황과 능력으로 할 수 있는 최선의 적응은 단순함과 꾸준함.\n\n  - 파산을 면하는 선에서 여러가지를 해보고 자신에게 맞는 걸 위주로 꾸준히. 그를 위해 단순, 편안, 쾌적함이 필요.\n\n- 🥱 -> 🤔💡🌱 - [On The Death of Daydreaming](https://www.afterbabel.com/p/on-the-death-of-daydreaming)\n  - boredom -> easy fun -> art -> profit?\n\n> I've often described my motivation for building software to others using imagery: I like to go find a secluded beach, build a large, magnificent sand castle, and then walk away. Will anyone notice? Probably not. Will the waves eventually destroy it? Yep. Did I still get immense satisfaction? Absolutely. - [aliasxneo](https://news.ycombinator.com/item?id=41497113)\n\n> We love to see the process, not just the result. The imperfections in your work can be beautiful if they show your struggle for perfection, not a lack of care. - [ralphammer](https://ralphammer.com/is-perfection-boring/)\n\n> Simplicity, even if it sacrifices some ideal functionality has better survival characteristics than the-right-thing. - [The Rise of Worse is Better](https://www.dreamsongs.com/RiseOfWorseIsBetter.html)\n\n> [Roberto Blake was talking about making 100 crappy videos](https://www.youtube.com/watch?v=OnUBaQ1Sp_E) to get better over time. Putting in the reps and improving a little bit each time.\n>\n> Putting in the work without expecting any external reward at first (eg views, followers, likes, etc) will pay off in the long run. - [100 Scrappy Things](https://www.florin-pop.com/blog/100-scrappy-things/)\n\n> Make the difficult habitual, the habitual easy, and the easy beautiful. - [Constantin S. Stanislavski](https://www.goodreads.com/quotes/7102271-make-the-difficult-habitual-the-habitual-easy-and-the-easy)\n\n> A good match is a **structured** dance, where players aim to **score** while they are following well-defined **rules**. This **freedom within a structure** is what makes it fun. - [ralphammer](https://ralphammer.com/how-to-get-started/)\n\n- [Pivot Points](https://longform.asmartbear.com/pivot-points/)\n\n  - non-judgmental aspects of personality that can be strengths in some contexts and weaknesses in others\n  - Pivot Points are fixed in the short term\n\n- [Hedged Bets](https://longform.asmartbear.com/predict-the-future/#hedged-bets)\n  - trading slightly less maximum upside for predictable, net-positive outcomes.\n\n> “Motivation often comes after starting, not before. Action produces momentum.”\n> [When you start a new habit, it should take less than two minutes to do.](https://jamesclear.com/how-to-stop-procrastinating)\n>\n> - James Clear\n\n> Focus is more about **not** keeping busy when you need to wait for something.  \n> Eat the boredom for a minute.\n>\n> - [[life-tips#wodenokoto]]\n\n> [4 minutes run hard enough to push heart rate to 90%, 3 minutes recover, repeat 4 times](https://news.ycombinator.com/item?id=34213181)\n>\n> - https://www.ntnu.edu/cerg/advice\n> - [Get running with Couch to 5K](https://www.nhs.uk/live-well/exercise/running-and-aerobic-exercises/get-running-with-couch-to-5k/)\n\n> [recommended routine - bodyweightfitness](https://www.reddit.com/r/bodyweightfitness/wiki/kb/recommended_routine/) - I Don't Have This Much Time!\n>\n> - Don't workout at all (saves anywhere from 20 to 60 minutes, but really, really, really, really, really, really, really, really, really not recommended)\n\n> 도무지 읽히지 않는 책 앞에서 내가 택한 방법은 펼쳐진 페이지 앞에서 멍때리기이다. 다르게 표현하면 이렇다. 펼쳐진 두 페이지 앞에서 오래 머물기.\n>\n> 책을 펼쳐놓는 것으로 충분하다. 읽지 못해도 좋다. 매일 정해진 진도를 나가야 하는 학교 수업이 아니니까. 하지만 읽지 않아도 괜찮다고 해서 펼쳐두지조차 않으면 곤란하다. 가능한 한 자주 책을 펼쳐두도록 하자. 전혀 읽지 않고 멍하니 바라보고 있다가 다시 덮게 되더라도\n>\n> - 막막한 독서. 시로군. P.10~13\n\n> I think it should be everyone's primary focus to sleep well, drink water, get outside, get active, and eat generally decently. I hate to say it, but if you're not eating a good amount of vegetables and fruit, decent protein, sleep, etc, no amount of XYZ will catch up to that detriment. - [CE02](https://news.ycombinator.com/item?id=35056071)\n\n> My real battle is doing good versus doing nothing. - [Deirdre Sullivan](https://www.npr.org/2005/08/08/4785079/always-go-to-the-funeral)\n\n[Kind Engineering](https://kind.engineering/) - How To Engineer Kindness\n\n> Sometimes magic is just someone spending more time on something than anyone else might reasonably expect. - [Teller](https://www.goodreads.com/quotes/6641527-sometimes-magic-is-just-someone-spending-more-time-on-something)\n\n---\n\n## What I read in past\n\n- [[What I read in 2026|read.2026.articles]]\n  - [[2025|read.2025.articles]]\n  - [[2024|read.2024.articles]]\n  - [[2023|read.2023.articles]]\n  - [[2022|read.2022.articles]]\n- 📝 [Gists](https://gist.github.com/Luke-SNAW)\n- 📜 [Journals](https://luke-snaw.github.io/Luke-SNAW__netlify-CMS.github.io/)\n\n---\n\n- [[journal.what-i-struggled-brag-in]]\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":false,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.115.0","enableFullHierarchyNoteTitle":false,"enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Luke SNAW","description":"Personal knowledge space"},"github":{"enableEditLink":false,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","siteUrl":"https://luke-snaw.github.io/","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}