{"pageProps":{"note":{"id":"yd43ib2w3aqxgg4teuy3frg","title":"The Intermediate Plateau: What Causes It? How Can We Move Beyond It?","desc":"","updated":1675914637894,"created":1675914577153,"custom":{},"fname":"life-tips.intermediate-plateau","type":"note","vault":{"fsPath":"vault"},"contentHash":"ac7dba7213f146d57666856cd4a47a7b","links":[],"anchors":{"three-theories-for-why-we-get-stuck":{"type":"header","text":"Three Theories for Why We Get Stuck","value":"three-theories-for-why-we-get-stuck","line":26,"column":0,"depth":2},"the-exponential-explosion-of-knowledge":{"type":"header","text":"The Exponential Explosion of Knowledge","value":"the-exponential-explosion-of-knowledge","line":34,"column":0,"depth":2},"unlearning-and-local-maxima":{"type":"header","text":"Unlearning and Local Maxima","value":"unlearning-and-local-maxima","line":50,"column":0,"depth":2},"the-copying-creating-barrier":{"type":"header","text":"The Copying-Creating Barrier","value":"the-copying-creating-barrier","line":60,"column":0,"depth":2},"how-can-you-move-beyond-intermediacy":{"type":"header","text":"How Can You Move Beyond Intermediacy?","value":"how-can-you-move-beyond-intermediacy","line":72,"column":0,"depth":2},"exponential-effort-for-exponentially-growing-knowledge":{"type":"header","text":"Exponential Effort for Exponentially Growing Knowledge","value":"exponential-effort-for-exponentially-growing-knowledge","line":80,"column":0,"depth":2},"unlearning-requires-deliberate-practice":{"type":"header","text":"Unlearning Requires Deliberate Practice","value":"unlearning-requires-deliberate-practice","line":90,"column":0,"depth":2},"creativity-is-enhanced-by-expert-mentorship":{"type":"header","text":"Creativity is Enhanced By Expert Mentorship","value":"creativity-is-enhanced-by-expert-mentorship","line":104,"column":0,"depth":2},"is-mastery-worth-it":{"type":"header","text":"Is Mastery Worth It?","value":"is-mastery-worth-it","line":112,"column":0,"depth":2},"footnotes":{"type":"header","text":"Footnotes","value":"footnotes","line":120,"column":0,"depth":4}},"children":[],"parent":"ettkt3iClONnxpbGwBVLl","data":{}},"body":"<h1 id=\"the-intermediate-plateau-what-causes-it-how-can-we-move-beyond-it\">The Intermediate Plateau: What Causes It? How Can We Move Beyond It?<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-intermediate-plateau-what-causes-it-how-can-we-move-beyond-it\"></a></h1>\n<blockquote>\n<p><a href=\"https://www.scotthyoung.com/blog/2023/01/03/intermediate-plateau/\">https://www.scotthyoung.com/blog/2023/01/03/intermediate-plateau/</a></p>\n</blockquote>\n<p>The intermediate plateau is a frustrating stage of learning where progress slows and diminishing returns are seen from additional study and practice. It is seen in almost every field, and can be caused by the exponential growth of knowledge, the need to unlearn bad habits, or the difficulty of creative problem-solving. To move beyond the plateau, one must put in exponential effort, practice deliberately, or seek expert mentorship. It is important to consider whether mastery is necessary, as there is a lot one can do with being good enough. Despite the difficulty of the intermediate plateau, it is nothing to be ashamed of, and can be a great opportunity to reflect on what is necessary to get the job done.</p>\n<hr>\n<p>I remember having a conversation with my friend <a href=\"https://www.hackingchinese.com/\">Olle Linge</a> about learning Chinese. I had already spent a couple of years studying, and while I could converse and read some books, I still struggled in more complicated situations. My progress had slowed, and I was in an awkward phase where I sometimes felt confident and other times not.</p>\n<p>“Yeah, that’s what it’s like from now on,” was Olle’s half-joking reply.</p>\n<p>The intermediate plateau contrasts sharply with the beginning phase of immersive language learning. While those early efforts are marked by some intense difficulties, they are also a period of incredible progress. In a narrow window of time, you go from total incompetence to being able to do quite a bit!</p>\n<p>In contrast, intermediacy is frustrating. You don’t feel good enough to claim the work of learning is over, but you see diminishing returns from additional study and practice.</p>\n<p><img src=\"https://www.scotthyoung.com/blog/wp-content/uploads/2022/12/The-Intermediate-Plateau1-1024x512.jpg\"></p>\n<p>The intermediate plateau shows up in almost every field. As a writer for over half my life, I still wish I were better at it. And yet it’s hard to tell whether my efforts are paying off in terms of better prose. Programmers, managers, architects and doctors all have to deal with the difficulty of being neither a beginner nor the best.</p>\n<h2 id=\"three-theories-for-why-we-get-stuck\">Three Theories for Why We Get Stuck<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#three-theories-for-why-we-get-stuck\"></a></h2>\n<p>I’d like to review three explanations for what causes the intermediate plateau, each having some relevance depending on the skills. Those are:</p>\n<ol>\n<li>Knowledge grows exponentially with the level of expertise.</li>\n<li>Progress comes to rely more on unlearning than new learning.</li>\n<li>Creative problem-solving overtakes (and is harder than!) imitating others.</li>\n</ol>\n<h2 id=\"the-exponential-explosion-of-knowledge\">The Exponential Explosion of Knowledge<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-exponential-explosion-of-knowledge\"></a></h2>\n<p>One explanation for the intermediate plateau is that skill building is based on knowledge, and knowledge grows exponentially as you progress in a discipline.</p>\n<p>Consider a highly simplified model of language learning, where the only thing that matters are the words you have in your lexicon. According to <a href=\"https://en.wikipedia.org/wiki/Zipf%27s_law\">Zipf’s Law</a>, the usage frequency of a word is roughly proportional to the inverse of its rank in an ordered list of usage frequency.</p>\n<p>The most frequently used word in English is “the,” which occurs 7% of the time, about once per 14 words. The second most frequent word is “of,” which occurs 3.5% of the time, about once per 29 words. By this formula, the ten-thousandth most-common word (which <a href=\"https://en.wiktionary.org/wiki/Wiktionary:Frequency_lists/PG/2006/04/1-10000\">apparently</a> is “calves”) would occur roughly 7% x (1 ÷ 10000) = 0.0007% of the time, or about once every 143,000 words.</p>\n<p><img src=\"https://www.scotthyoung.com/blog/wp-content/uploads/2022/12/The-Intermediate-Plateau2-1024x512.jpg\"></p>\n<p>Each newly learned word takes (roughly) the same amount of mental effort to learn, but the frequency drop-off means that each word contributes less and less to your proficiency.<a href=\"https://www.scotthyoung.com/blog/2023/01/03/intermediate-plateau/#easy-footnote-bottom-1-14804\"><sup>1</sup></a></p>\n<p>In fact, the situation is even worse than this! Knowledge isn’t acquired once and then preserved forever. We often require multiple exposures to learn a word and spaced exposures to sustain it in memory. Because rarer words are used less frequently, they take far longer to become permanent parts of our linguistic repertoire.</p>\n<p>Given the rate of forgetting, and the slow accumulation of new words, the intermediate plateau may be the equilibrium point where new learning equals old forgetting. At this level, we forget infrequently-used words as quickly as we learn them, and improvement stops entirely.</p>\n<h2 id=\"unlearning-and-local-maxima\">Unlearning and Local Maxima<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#unlearning-and-local-maxima\"></a></h2>\n<p>The knowledge-explosion account of the intermediate plateau assumes learning is monotonic. That is, learning is strictly additive—each new word only makes you more proficient, never less.</p>\n<p>However, a lot of learning isn’t like this. A person who is learning to type by hunting and pecking on a keyboard further entrenches that method every time they use it. It won’t spontaneously evolve into touch typing, regardless of how much they practice. Similarly, pronunciation often “fossilizes” in language learning, likely because a “good enough” articulation of the language’s phonemes becomes ingrained through repetitive practice and becomes automatic. This makes you more fluent, but it means shaking off a bad accent is even harder than learning new words!</p>\n<p><img src=\"https://www.scotthyoung.com/blog/wp-content/uploads/2022/12/The-Intermediate-Plateau3-1024x512.jpg\"></p>\n<p>In this account of the intermediate plateau, our lack of progress is due to getting ever-more proficient in mediocre methods. Progress requires interrupting this natural process, fine-tuning our performance, and then rebuilding automaticity on the parts.</p>\n<h2 id=\"the-copying-creating-barrier\">The Copying-Creating Barrier<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-copying-creating-barrier\"></a></h2>\n<p>A third reason we get stuck in our progress is that humans are excellent imitators and only lackluster problem-solvers. Crows can figure out how to extract food from a bottle by improvising a metal hook, but only 10% of fifth-graders can <a href=\"https://srcd.onlinelibrary.wiley.com/doi/full/10.1111/cdep.12451\">do the same</a>.</p>\n<p>Anthropologist Joseph Heinrich argues that our <a href=\"https://www.amazon.ca/Secret-Our-Success-Evolution-Domesticating/dp/0691178437/ref=asc_df_0691178437/?tag=googleshopc0c-20&#x26;linkCode=df0&#x26;hvadid=296000230213&#x26;hvpos=&#x26;hvnetw=g&#x26;hvrand=2843798282727759334&#x26;hvpone=&#x26;hvptwo=&#x26;hvqmt=&#x26;hvdev=c&#x26;hvdvcmdl=&#x26;hvlocint=&#x26;hvlocphy=9001556&#x26;hvtargid=pla-416687851149&#x26;psc=1\">capacity to imitate</a>—if one person solves a problem, everyone else can copy their solution—is what truly separates us from other species, not our innate problem-solving abilities. Our ability to stand on the shoulders of the countless generations that have come before us is what enables us to make progress.</p>\n<p><img src=\"https://www.scotthyoung.com/blog/wp-content/uploads/2022/12/The-Intermediate-Plateau4-1024x512.jpg\"></p>\n<p>Unfortunately, this means there’s a sharp distinction between mastering an old trick and inventing a new one. Learning from others is fast, but it is limited to situations that are routine or allow the easy application of an old principle. New circumstances, in contrast, require an extensive problem-solving search in order to make progress.</p>\n<p>The intermediate plateau, by this account, can also be a switch from learning from others, to learning by trial-and-error, with the latter being much slower and more painstaking.</p>\n<h2 id=\"how-can-you-move-beyond-intermediacy\">How Can You Move Beyond Intermediacy?<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#how-can-you-move-beyond-intermediacy\"></a></h2>\n<p>Each of the three theories suggests a different potential escape route:</p>\n<ol>\n<li>Exponential knowledge requires exponential effort.</li>\n<li>Unlearning requires deliberate practice.</li>\n<li>Expert mentorship nurtures creativity.</li>\n</ol>\n<h2 id=\"exponential-effort-for-exponentially-growing-knowledge\">Exponential Effort for Exponentially Growing Knowledge<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#exponential-effort-for-exponentially-growing-knowledge\"></a></h2>\n<p>The unfortunate fact of mastering a language is that, after gaining basic fluency, further learning requires a disproportionate step-up in effort. The only way to overcome the dwindling usefulness of new vocabulary and the regular atrophy of forgetting is to spend more time in practice. That said, I do suspect there are more efficient ways to do this than simply using the language a lot.</p>\n<p>Wordsmiths in a non-native language tend to love collecting new words for their lexicon. I suspect the desire to look words up in the dictionary and memorize their meanings is a trait that leads to better performance than someone who only acquires vocabulary when they have to.</p>\n<p>Similarly, reading more advanced literature or attending challenging classes can push one into the frontier of seldom-used words and will increase the the usage frequency of the specialized words. Unfortunately, this also increases cognitive load since comprehensibility declines as you delve deeper into the new vocabulary.</p>\n<p>Ultimately, it’s probably a mixture of comprehensible input, which ensures fluency and low-effort practice, and more challenging reading or conversations with easy access to definitions/explanations that will matter.</p>\n<h2 id=\"unlearning-requires-deliberate-practice\">Unlearning Requires Deliberate Practice<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#unlearning-requires-deliberate-practice\"></a></h2>\n<p>Unlearning to progress in skill development was a theory favored by <a href=\"https://en.wikipedia.org/wiki/Practice_(learning_method)#Deliberate_practice\">Anders Ericsson</a>. Building on Fitts and Posner’s influential three-stage model of skill development, he argued that automaticity was a major barrier to improvement.</p>\n<p>Fitts and Posner’s model of skill acquisition has three stages:</p>\n<ul>\n<li><strong>Cognitive</strong> – When you learn the basics of a skill and understand how it works.</li>\n<li><strong>Associative</strong> – When you begin practicing, combining the parts of a skill into larger chunks and weeding out significant mistakes.</li>\n<li><strong>Autonomous</strong> – As errors decline, you perform the skill with less and less conscious effort.</li>\n</ul>\n<p>The “deliberate” part of deliberate practice refers to both the need for practice sessions outside of work and play, and the mental effort needed to bring the skill out of the automatic state and back to the cognitive/associative state where deliberate effort can be applied.</p>\n<p>Essentially, we’re not trying to add to our knowledge so much as weed inefficiencies from our well-learned routines.</p>\n<h2 id=\"creativity-is-enhanced-by-expert-mentorship\">Creativity is Enhanced By Expert Mentorship<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#creativity-is-enhanced-by-expert-mentorship\"></a></h2>\n<p>In problem-solving, we can get further if we see better ways of doing things. Sometimes we get stuck on the intermediate plateau because we have learned everything we can from those around us, and now improvement depends on our own inventiveness. The people who succeed are often those who can find better mentors and, therefore, can continue the relatively efficient learning-from-others path.</p>\n<p>Support for the importance of expert mentorship can be seen in the history of scientific accomplishments. Harriet Zuckerman <a href=\"https://www.amazon.ca/Scientific-Elite-Harriet-Zuckerman/dp/1560008555\">famously analyzed</a> the path of American Nobel laureates. She found that a significant proportion of those who won a Nobel prize were mentored by someone who also won it. Interestingly, most won the prize before their mentor did, so the role of mentorship seems to be much more than just institutional prestige.</p>\n<p>Mentorship needn’t be an official relationship. Even having a knowledgeable peer network can help. The more you can learn from others, rather than having to invent on your own, the faster you will progress. Those who are isolated from the help of other people will hit the problem-solving barrier earlier, and thus their progress will slow.</p>\n<h2 id=\"is-mastery-worth-it\">Is Mastery Worth It?<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#is-mastery-worth-it\"></a></h2>\n<p>Whether it’s extensive (and time-consuming) knowledge acquisition, effortful deliberate practice, or seeking access to elite guidance, mastery doesn’t come easily. In some cases, it’s worth wondering whether it’s necessary.</p>\n<p>Despite my focus on learning, I’m firmly in the intermediate camp for all of the skills I’ve spent time on. Intermediacy is nothing to be ashamed of. For many skills, there’s a lot you can do with being “good enough” rather than world-class.</p>\n<p>Still, if going beyond your current level is necessary, it’s helpful to think in terms of what is required to get the job done.</p>\n<h4 id=\"footnotes\">Footnotes<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#footnotes\"></a></h4>\n<ol>\n<li>Words likely are easier to learn as you learn more. But this effect is dwarfed by the drop-off in word frequency.<a href=\"https://www.scotthyoung.com/blog/2023/01/03/intermediate-plateau/#easy-footnote-1-14804\"></a></li>\n</ol>","noteIndex":{"id":"Iy0MoL0KnL55Br3AfTS2C","title":"Luke","desc":"","updated":1766965759366,"created":1644449449778,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"a724de3efd251cf89fe82a5860d9008b","links":[{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"life-tips","position":{"start":{"line":43,"column":5,"offset":2710},"end":{"line":43,"column":29,"offset":2734},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"life-tips","anchorHeader":"wodenokoto"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2026.articles","alias":"What I read in 2026","position":{"start":{"line":72,"column":3,"offset":4440},"end":{"line":72,"column":45,"offset":4482},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2026.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2025.articles","alias":"2025","position":{"start":{"line":73,"column":5,"offset":4487},"end":{"line":73,"column":32,"offset":4514},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2025.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2024.articles","alias":"2024","position":{"start":{"line":74,"column":5,"offset":4519},"end":{"line":74,"column":32,"offset":4546},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2024.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2023.articles","alias":"2023","position":{"start":{"line":75,"column":5,"offset":4551},"end":{"line":75,"column":32,"offset":4578},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2023.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2022.articles","alias":"2022","position":{"start":{"line":76,"column":5,"offset":4583},"end":{"line":76,"column":32,"offset":4610},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2022.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"journal.what-i-struggled-brag-in","position":{"start":{"line":82,"column":3,"offset":4746},"end":{"line":82,"column":39,"offset":4782},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"journal.what-i-struggled-brag-in"}}],"anchors":{"what-i-read-in-past":{"type":"header","text":"What I read in past","value":"what-i-read-in-past","line":76,"column":0,"depth":2}},"children":["zd4mq442jike0pr0wba1u3m","6hzeqsofq67gdk88flxlkhp","778ijii93yu5uwnrwmn5zi4","g1fngdjl25nes6fs3lip602","ZbdkdApFqLdks4Moq92R9","uoc5hhki3o4py15cesddu8q","9qf7j06jtdkm6rnx9ymvwb0","5zn10cvj7ajy2gh2is5nqmg","4qo9ma0z0yu1czns6pxl7y5","ok0e729ho7o09xetujkxc0m","GR5x8HnNFEN6fU2UBSEIK","yirtnlj8q24yutcf3ss1xqy","eq0wc6t7wl2wv221yb68ro4","7x2fnv4j6gxts08qk0jguny","ettkt3iClONnxpbGwBVLl","7l4knev6v613tbuoskvmbdg","hvh5bud6yp7dc89tuh95tr9","4fvoqrplw0cweo554usbjos","f8qsfql0a9v8thpeo82udfa","1swsbrhqi9jk41v9eodyi5q","SQqYupi6EFddTerBA8RRD","hjNeNc1F2JUh0lTWanH4h","qf0l4wbrc9jgooyzexmbq5v","o7xruzrah5wzqetottecss7","z1zo2mp6ddji5p317i4x9xw","v06c2tjelh341x4resa50fh","0yqesk4rcffwgyuab5x8rfa","sy2vkbtyu671chkvgn1yt8j","ufixpmxoydiccoh59kphrib","alswadkx4wb05y1z9iwfzfv","1daut9dpw70xd0zh5a7j5p4"],"parent":null,"data":{},"body":"\nHi there 👋. I'm a Front-end developer.\n\n---\n\n- 현실은 인간의 연산으로 완전히 파악할 수 없는 복잡계. 주어진 상황과 능력으로 할 수 있는 최선의 적응은 단순함과 꾸준함.\n\n  - 파산을 면하는 선에서 여러가지를 해보고 자신에게 맞는 걸 위주로 꾸준히. 그를 위해 단순, 편안, 쾌적함이 필요.\n\n- 🥱 -> 🤔💡🌱 - [On The Death of Daydreaming](https://www.afterbabel.com/p/on-the-death-of-daydreaming)\n  - boredom -> easy fun -> art -> profit?\n\n> I've often described my motivation for building software to others using imagery: I like to go find a secluded beach, build a large, magnificent sand castle, and then walk away. Will anyone notice? Probably not. Will the waves eventually destroy it? Yep. Did I still get immense satisfaction? Absolutely. - [aliasxneo](https://news.ycombinator.com/item?id=41497113)\n\n> We love to see the process, not just the result. The imperfections in your work can be beautiful if they show your struggle for perfection, not a lack of care. - [ralphammer](https://ralphammer.com/is-perfection-boring/)\n\n> Simplicity, even if it sacrifices some ideal functionality has better survival characteristics than the-right-thing. - [The Rise of Worse is Better](https://www.dreamsongs.com/RiseOfWorseIsBetter.html)\n\n> [Roberto Blake was talking about making 100 crappy videos](https://www.youtube.com/watch?v=OnUBaQ1Sp_E) to get better over time. Putting in the reps and improving a little bit each time.\n>\n> Putting in the work without expecting any external reward at first (eg views, followers, likes, etc) will pay off in the long run. - [100 Scrappy Things](https://www.florin-pop.com/blog/100-scrappy-things/)\n\n> Make the difficult habitual, the habitual easy, and the easy beautiful. - [Constantin S. Stanislavski](https://www.goodreads.com/quotes/7102271-make-the-difficult-habitual-the-habitual-easy-and-the-easy)\n\n> A good match is a **structured** dance, where players aim to **score** while they are following well-defined **rules**. This **freedom within a structure** is what makes it fun. - [ralphammer](https://ralphammer.com/how-to-get-started/)\n\n- [Pivot Points](https://longform.asmartbear.com/pivot-points/)\n\n  - non-judgmental aspects of personality that can be strengths in some contexts and weaknesses in others\n  - Pivot Points are fixed in the short term\n\n- [Hedged Bets](https://longform.asmartbear.com/predict-the-future/#hedged-bets)\n  - trading slightly less maximum upside for predictable, net-positive outcomes.\n\n> “Motivation often comes after starting, not before. Action produces momentum.”\n> [When you start a new habit, it should take less than two minutes to do.](https://jamesclear.com/how-to-stop-procrastinating)\n>\n> - James Clear\n\n> Focus is more about **not** keeping busy when you need to wait for something.  \n> Eat the boredom for a minute.\n>\n> - [[life-tips#wodenokoto]]\n\n> [4 minutes run hard enough to push heart rate to 90%, 3 minutes recover, repeat 4 times](https://news.ycombinator.com/item?id=34213181)\n>\n> - https://www.ntnu.edu/cerg/advice\n> - [Get running with Couch to 5K](https://www.nhs.uk/live-well/exercise/running-and-aerobic-exercises/get-running-with-couch-to-5k/)\n\n> [recommended routine - bodyweightfitness](https://www.reddit.com/r/bodyweightfitness/wiki/kb/recommended_routine/) - I Don't Have This Much Time!\n>\n> - Don't workout at all (saves anywhere from 20 to 60 minutes, but really, really, really, really, really, really, really, really, really not recommended)\n\n> 도무지 읽히지 않는 책 앞에서 내가 택한 방법은 펼쳐진 페이지 앞에서 멍때리기이다. 다르게 표현하면 이렇다. 펼쳐진 두 페이지 앞에서 오래 머물기.\n>\n> 책을 펼쳐놓는 것으로 충분하다. 읽지 못해도 좋다. 매일 정해진 진도를 나가야 하는 학교 수업이 아니니까. 하지만 읽지 않아도 괜찮다고 해서 펼쳐두지조차 않으면 곤란하다. 가능한 한 자주 책을 펼쳐두도록 하자. 전혀 읽지 않고 멍하니 바라보고 있다가 다시 덮게 되더라도\n>\n> - 막막한 독서. 시로군. P.10~13\n\n> I think it should be everyone's primary focus to sleep well, drink water, get outside, get active, and eat generally decently. I hate to say it, but if you're not eating a good amount of vegetables and fruit, decent protein, sleep, etc, no amount of XYZ will catch up to that detriment. - [CE02](https://news.ycombinator.com/item?id=35056071)\n\n> My real battle is doing good versus doing nothing. - [Deirdre Sullivan](https://www.npr.org/2005/08/08/4785079/always-go-to-the-funeral)\n\n[Kind Engineering](https://kind.engineering/) - How To Engineer Kindness\n\n> Sometimes magic is just someone spending more time on something than anyone else might reasonably expect. - [Teller](https://www.goodreads.com/quotes/6641527-sometimes-magic-is-just-someone-spending-more-time-on-something)\n\n---\n\n## What I read in past\n\n- [[What I read in 2026|read.2026.articles]]\n  - [[2025|read.2025.articles]]\n  - [[2024|read.2024.articles]]\n  - [[2023|read.2023.articles]]\n  - [[2022|read.2022.articles]]\n- 📝 [Gists](https://gist.github.com/Luke-SNAW)\n- 📜 [Journals](https://luke-snaw.github.io/Luke-SNAW__netlify-CMS.github.io/)\n\n---\n\n- [[journal.what-i-struggled-brag-in]]\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":false,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.115.0","enableFullHierarchyNoteTitle":false,"enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Luke SNAW","description":"Personal knowledge space"},"github":{"enableEditLink":false,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","siteUrl":"https://luke-snaw.github.io/","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}