{"pageProps":{"note":{"id":"yvcgbt36vp86t68y13j1wjh","title":"Post 43: Intentionally Making Close Friends","desc":"","updated":1669684004415,"created":1669683974327,"custom":{},"fname":"communication.43-making-friends","type":"note","vault":{"fsPath":"vault"},"contentHash":"d399a180e93a4276ad1c7e35f34463d0","links":[],"anchors":{"introduction":{"type":"header","text":"Introduction","value":"introduction","line":10,"column":0,"depth":2},"my-story":{"type":"header","text":"My story","value":"my-story","line":22,"column":0,"depth":2},"the-problem":{"type":"header","text":"The Problem","value":"the-problem","line":24,"column":0,"depth":3},"the-solution":{"type":"header","text":"The solution","value":"the-solution","line":32,"column":0,"depth":3},"retrospective":{"type":"header","text":"Retrospective","value":"retrospective","line":59,"column":0,"depth":3},"advice":{"type":"header","text":"Advice","value":"advice","line":69,"column":0,"depth":2},"seek-excitement":{"type":"header","text":"Seek excitement","value":"seek-excitement","line":75,"column":0,"depth":3},"being-vulnerable":{"type":"header","text":"Being vulnerable","value":"being-vulnerable","line":89,"column":0,"depth":3},"hits-based-befriending":{"type":"header","text":"Hits-based Befriending","value":"hits-based-befriending","line":101,"column":0,"depth":3},"take-social-initiative":{"type":"header","text":"Take Social Initiative","value":"take-social-initiative","line":127,"column":0,"depth":3},"deepening-friendships":{"type":"header","text":"Deepening Friendships","value":"deepening-friendships","line":143,"column":0,"depth":3},"conclusion":{"type":"header","text":"Conclusion","value":"conclusion","line":172,"column":0,"depth":2}},"children":[],"parent":"g1fngdjl25nes6fs3lip602","data":{}},"body":"<h1 id=\"post-43-intentionally-making-close-friends\">Post 43: Intentionally Making Close Friends<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#post-43-intentionally-making-close-friends\"></a></h1>\n<blockquote>\n<p><a href=\"https://www.neelnanda.io/blog/43-making-friends\">https://www.neelnanda.io/blog/43-making-friends</a></p>\n</blockquote>\n<h2 id=\"introduction\">Introduction<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#introduction\"></a></h2>\n<p>One of the greatest sources of joy in my life are my close friends. People who bring excitement and novelty into my life. Who expose me to new experiences, and ways of seeing the world. Who help me learn, point out my blind spots, and correct me when I am wrong. Who I can lean on when I need support, and who lean on me in turn. Friends who help me grow more into the kind of person I want to be.</p>\n<p>I am especially grateful for this, because up until about 4 years ago, I didn’t have <em>any</em> close friends in my life. I had friends, but struggled to form real emotional connections. Moreover, it didn’t even occur to me that I <em>could</em> try to do this. It wasn’t that I knew how to form close friends but was too anxious to try, rather, ‘try to form close friendships’ was a <strong>non-standard action</strong>, something that never even crossed my mind. And one of my most life-changing experiments was realising that this was something I wanted, and actually trying to intentionally form close friends.</p>\n<p>It’s easy to slip into a passive mindset here, to think of emotional connections as ‘something that take time’ or ‘need to happen naturally’. That to be intentional about things is ‘inauthentic’. I think this mindset is absolutely crazy. My close friendships are one of the most important components of my life happiness. Leaving it up to chance feels like passing up an incredible opportunity. As with all important things in life, <a href=\"https://www.neelnanda.io/blog/mini-blog-post-9-what-it-means-to-optimise\">this can be optimised</a> - further, if done right, this adds a massive amount to the lives of me <em>and</em> of my future close friends.</p>\n<p>The first half of this post is the story of how I approached intentionally forming close friends, and the second half is an attempt to distill the lessons I learned from this. As such, this post is more autobiographical than most. Feel free to skip to the advice section if you don’t want that. Further, what you value in close friendships is highly personal - this post will focus on what <em>I</em> want in friendships and how I try to get it, but you should adapt this to your own situation, values, and what feels missing in your life!</p>\n<p><strong>Exercise:</strong> Think about your closest friends, and how these friendships happened. What needs are you fulfilling in each other’s lives? Are you happy with this state of affairs, or is something missing? What could be better?</p>\n<h2 id=\"my-story\">My story<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#my-story\"></a></h2>\n<h3 id=\"the-problem\">The Problem<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-problem\"></a></h3>\n<p>Back when I was in school, I never had close friends. I had <em>friends</em>, people I liked, people I spent time with, whose company I genuinely enjoyed. But I was pretty terrible at being vulnerable and forming emotional connections. These friendships rarely went beyond the surface level. In hindsight, I expect these <em>could</em> have been far richer (and I’ve formed much stronger friendships with some of these friends since!), but I never really tried.</p>\n<p>I find it hard to introspect on exactly what the internal experience of past Neel was like, but I think the core was that trying wasn’t <strong>available</strong> as a possible action. That I spent much of my life doing what felt socially conventional, normal and expected, for the role I saw myself in. And ‘go out of your way to form emotional connections’ wasn’t part of that. It wasn’t an action I considered, weighed up the costs and benefits, and decided against - it never even occurred to me to try. It didn’t feel like a void missing from my life - things just felt normal. It was like playing a video game, and having a list of actions to choose from, like ‘ask about their day’, ‘complain about a shared experience’ or ‘discuss something cool I learned recently’; but this list contained nothing about ‘intentionally form an emotional connection’. It wasn’t in my reference class of things I could do.</p>\n<p>One of the core parts of my life philosophy now is the skill of <strong>agency</strong>, of <a href=\"https://www.neelnanda.io/blog/become-a-person-who-actually-does-things\">actually doing things</a>. The skill of going out of your way to <em>make</em> opportunities. To identify what’s missing in my life, and in the world. Finding the actions that I don’t <em>need</em> to take, that no one else will make me take, or do for me, and deciding to take them anyway. Fixing that which is broken. Finding that which is <em>not</em> broken, and deciding to make it better anyway. Exploring and trying new things. Challenging my self-image and growing. Fundamentally escaping the mindset of needing permission, and breaking past the <a href=\"https://www.neelnanda.io/blog/mini-blog-post-15-the-illusion-of-doing-nothing\">illusion of doing nothing</a>. I think this is one of the most valuable skills anyone can learn, and one I cherish, though I am far from perfect at it. And this experience is a large part of why I value it. Not realising I could make close friends was a <strong>failure of agency</strong>, an <strong>unknown-unknown</strong> that cut out a massive amount of potential happiness, without even realising it.</p>\n<h3 id=\"the-solution\">The solution<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-solution\"></a></h3>\n<p>Despite all this talk of agency, I stumbled my way out of this problem pretty much by accident. When I was 18, in my final year in school, I ended up in a long-term romantic relationship (with a girl who, thankfully, was far better at taking initiative than me!). And this was one of my first times really feeling a deep, emotional connection with someone. And, surprisingly, found that this was great, and added a ton to my life! And further, got a bunch of surface area on what emotional connections actually felt like, and how they formed.</p>\n<p>That relationship ended in my first year of university. And as part of trying to move on and recover, I did a lot of introspection on how the relationship had changed me, and what now felt missing from my life. And one of the biggest things missing was having a deep emotional connection with someone. So I decided to fix this.</p>\n<p>The obvious next question was, what to actually do? In full 19-year-old-Neel fashion, I took a pretty reductionist approach to this. I made a list of all the people I considered close or close-ish friends, and tried to figure out how we became close friends. And in each case, I identified the main shifts in our relationship after intense, 1-1 conversations, where we were both being emotionally vulnerable and authentic, and talking about personal things. So, to make <em>more</em> close friends, all I needed to do was engineer more of these 1-1 conversations!</p>\n<p>This was also inspired by a time when I was 17, and at a <a href=\"https://espr-camp.org/\">rationality camp for high-schoolers</a>. We were doing a workshop on Comfort Zone Expansion (CoZE), where the intention was to identify something we were uncomfortable with but wanted to explore and try in a safe environment. I and another participant noticed we were both uncomfortable with being vulnerable and authentic, and tended to use humour to deflect from anything personal. So, we decided to find a private place and spend two hours having a fully authentic conversation, with no deflection allowed. This was kinda terrifying, but also a <em>really</em> great comfort zone expansion experience, and I felt much closer to him afterwards.</p>\n<p>One decent way of engineering an authentic 1-1 conversation is to go through a bunch of personal and vulnerability-inducing questions together, a la <a href=\"https://mobile.nytimes.com/2015/01/11/fashion/no-37-big-wedding-or-small.html?_r=2&#x26;referer=&#x26;referer=\">36 Questions that Lead in Love</a> (after cutting the ⅔ of questions that I found dull). So I made a list of questions I considered interesting, which I expected to lead to authentic and vulnerable conversations. And then went up to the 10-20 people I felt most friendly with, explained the experiment, and asked if they’d be interested in blocking out a few hours, and going through the list together.</p>\n<p>Somehow, this worked! About 80% of the people I asked said yes, and I felt much closer with about 50% of them afterwards. Some people were weirded out, but most of my friends were down to try the experiment. With some people the questions felt awkward, but with some people I <em>really</em> vibed. And some people were <em>extremely</em> enthusiastic about the idea from the start - I explained the idea to a guy I vaguely knew, he loved the idea and suggested doing it together, we hit it off immediately, and he’s now probably my closest friend.</p>\n<p>If you’re interested in the questions, you can see the full list <a href=\"https://mobile.nytimes.com/2015/01/11/fashion/no-37-big-wedding-or-small.html?_r=2&#x26;referer=&#x26;referer=\">here</a>. Some of my favourites:</p>\n<ul>\n<li>What’s the best way to get to know you as a person?</li>\n<li>What’s your life story?</li>\n<li>What traits do you envy/value in those around you?</li>\n<li>What do you feel insecure about?\n<ul>\n<li>This one is higher variance - I don’t recommend leading with it!</li>\n</ul>\n</li>\n<li>What do you value in friendships? What are the best ways they add to your life?</li>\n<li>How, historically, have you become close to people?</li>\n<li>If you could design a personal set of social norms for how your friends interact with you, what would they be?</li>\n<li>How would other people describe you? How does this compare to how you want to be perceived?</li>\n<li>What in life do you get truly excited about?</li>\n</ul>\n<h3 id=\"retrospective\">Retrospective<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#retrospective\"></a></h3>\n<p>I am <em>incredibly</em> happy I ran this experiment. It has made my life massively better. And, in hindsight, I am still really surprised that the success rate was so high! If this idea sounds compelling, I would highly recommend people try it - it was an excellent growth experience.</p>\n<p>That said, I still somewhat cringe looking back on that. I think having a literal list of questions made the interactions much more artificial. Since then, my conversational style has evolved to be a lot more natural, while trying to preserve the spirit. <a href=\"https://www.neelnanda.io/blog/mini-blog-post-5-how-to-learn-from-conversations\">I really like asking questions</a>, and will often weave these questions into a conversation if appropriate. And strongly try to create an atmosphere where people are comfortable being honest and vulnerable, and where I show vulnerability in turn.</p>\n<p>One of the main reasons I’d recommend others try this is that it <strong>broke me out of a bad equilibria</strong>. I was trapped in a ‘normal’ mode of conversation - making small talk, being inoffensive, feeling aversion to being weird, respecting where I <em>thought</em> other people’s boundaries were. But when I tried something totally different and super weird, it often went great! Sometimes other people hate small talk too, and also seek a genuine connection. But by default, this would never have happened - it took one of us taking initiative to break past the trap of social norms. And only by having a bunch of unusual and scary conversations yet having them go great did I develop the courage to be weird. Respecting other people’s <em>actual</em> boundaries is important, but the conventional approach assumes an un-negotiable, one-size-fits-all to boundaries. And empirically, this picture is often totally off - some people think <em>I</em> want them to act normally, but are open to a much wider range of conversational styles if I initiate it.</p>\n<p>Another key lesson is that closeness isn’t just about spending a lot of time being friends - intentional, authentic, 1-1 time together makes a big difference. Sometimes I feel closer to someone after a single <em>amazing</em> conversation, than to people I’ve considered friends for years. Emotional connections aren’t something that just happen to me - they’re something I need to actually try to form. And effort, intelligently applied, can really pay off.</p>\n<h2 id=\"advice\">Advice<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#advice\"></a></h2>\n<p>So, that was my story. Now, I want to try distilling some key lessons that I think might apply to other people’s quests to form close friends.</p>\n<p>A key caveat to everything that follows: I argue for being much more intentional about social things than normal. When doing this, it’s easy to come across as cold and calculating. I think it’s super important to try to remain authentic, and to <em>signal</em> authenticity. I find it helpful to generally be friendly, make jokes, be honest and transparent, and be willing to be vulnerable. Eg, being open about the strategies I’m running and why, if it ever comes up.</p>\n<h3 id=\"seek-excitement\">Seek excitement<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#seek-excitement\"></a></h3>\n<p>A key mindset I use when forming connections via conversation is: <strong>“If we aren’t both excited about this conversation, do something differently”</strong>. This applies especially when talking to someone I don’t know well, and want to figure out whether we might become good friends.</p>\n<p>Most social norms optimise for conversations that feel safe, not ones that feel exciting, so I need to do something differently! This means asking the other person questions. This means taking a genuine interest in what we’re talking about - and if I <em>can’t</em> take a genuine interest, then I am doing something wrong.</p>\n<p>A tactic I find helpful here is what I call <strong>recursive curiosity</strong>. I lead by asking an open-ended question that invites a detailed answer. Then, I introspect and try to <a href=\"https://www.lesswrong.com/posts/GLPaZamxqkx7XJbXv/the-skill-of-noticing-emotions\">notice excitement</a>, find the part of their answer I find most interesting, and ask a follow-up open-ended question about it. Then, I repeat this process on their new answer. After about 3-4 iterations, we’ve normally gotten somewhere that feels alive and novel, where we’re both learning, rather than the same stale conversations they have all the time. The follow-up questions don’t need to be thoughtful or elaborate, often just ‘[specific detail] sounds interesting, tell me more’ or ‘[specific detail] didn’t really make sense to me, can you clarify? Did you mean [naive interpretation]?’ are more than enough. Introspecting on confusion or curiosity also works well. Often, rather than having a clear purpose to my questions I try to <strong>maximise surface area</strong> - just asking questions that point at my confusions and try to maximise the new information I gain, and the amount that I learn. This tends to feel fairly reactive - just responding to whatever was most interesting in the last thing said.</p>\n<p>Sometimes I feel trapped in a boring conversation direction because the structure of small talk feels hard to break out of. When this happens, I like to go meta, eg observing ‘man, I feel like I keep having the same kinds of conversations at these places’ or ‘let’s get the boring questions out of the way - [standard small talk done rapidly]’. If they seem to empathise, this is a good opener for a more fun question, eg: ’what kind of things do you get excited about?’, ‘what’s something cool you learned recently?’, or ‘have you had any particularly memorable conversations in [this context]?’</p>\n<p>I’ve found that practicing this skill has made me <em>much</em> better at forming instant connections when meeting new people, and is <em>much</em> more fun than small talk! Even beyond meeting new people or following concrete algorithms, the spirit of ‘seek the most exciting thread of the conversation’ makes talking to friends <em>way</em> more fun!</p>\n<p><strong>Warning:</strong> these tactics sometimes get the other person to monologue - I am fine with this, and most people enjoy talking to an engaged audience, but some people feel bad at one-sided conversations. If you apply these techniques, I recommend being willing to monologue in turn if the other person seems interested - otherwise it can feel like you’re being insincere.</p>\n<h3 id=\"being-vulnerable\">Being vulnerable<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#being-vulnerable\"></a></h3>\n<p>For me, vulnerability, and especially shared vulnerability, are really core to forming emotional connections. But this is difficult to manage because vulnerability, by definition, is hard. Different people have very different boundaries and comfort levels, and respecting boundaries is <em>super</em> important here. But, conversely, successfully creating shared vulnerability is really valuable and worth striving for.</p>\n<p>My main approach is to create a space in which it feels safe to be vulnerable, but try to avoid creating obligations. I try to be honest and vulnerable myself, and freely share things that feel authentic throughout the conversation. I prefer to express lots of small vulnerabilities throughout the conversation rather than sharing something major and making it feel like a big deal - the latter tends to create an obligation/expectation of reciprocation, while the former better establishes a ‘I consider this fine and normal’ norm. I also find that both are effective for breaking people’s social scripts/default ways of acting by being weird and unexpected - I find this is often a good first step to actually having a meaningful conversation. I find that sharing anxieties and insecurities can work particularly well here - almost everyone has them, it feels stigmatised to discuss them but people tend to respect you when you do, and they’re often much more common and relatable than people think. I’ve had a bunch of these conversations, and still find it exciting (and sad) when I meet someone with really similar problems to me!</p>\n<p>The ‘without obligations’ point is particularly important here, and hard to thread - sometimes people would enjoy sharing something vulnerable, but fear that it would make me uncomfortable. I like to ask questions that invite a vulnerable response, but to give the person an ‘out’, some kind of reasonable excuse they could use to deflect without losing face. And by gauging their reactions, and seeing how much further to probe.</p>\n<p>Overall, this is pretty hard to gauge and balance. It definitely takes a lot of practice, and I’m far from perfect at it. But I find it very worthwhile to practice.</p>\n<p>Personally, I tend to be very anxious about whether I’m making other people uncomfortable, so I find this technique pretty aversive at times. My main approach to motivation here is internalising that I want to be <a href=\"https://www.neelnanda.io/blog/become-a-person-who-actually-does-things\">a person who actually does things</a> - that being vulnerable and welcoming vulnerable are skills I find uncomfortable but value, and I am growing as a person if I cultivate them. And, empirically, I’ve found this <em>really</em> useful to practice. I find this often leads to really awesome interactions, often in my first interaction with someone.</p>\n<h3 id=\"hits-based-befriending\"><a href=\"https://www.openphilanthropy.org/blog/hits-based-giving\">Hits-based</a> Befriending<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#hits-based-befriending\"></a></h3>\n<p><em>Alternate title: Making friends like an</em> <a href=\"https://www.wikiwand.com/en/R/K_selection_theory\" title=\"https://www.wikiwand.com/en/R/K_selection_theory\"><em>r-strategist</em></a></p>\n<p>Another key insight about friendship is that it’s <a href=\"https://www.neelnanda.io/blog/33-upside-risk\">all about upside risk</a>. I will meet many, many more people in my life than I could ever sustain friendships with, let alone close friendships. Thus, if I am meeting new people and want to find potential close friends, I want to <strong>filter fast</strong> for compatible people. Further, compatibility is heavy-tailed - I won’t really vibe with most people, but some people are <em>awesome</em>. I want to explore and optimise for information. This pushed towards high-variance strategies. If I meet 100 people, and want to pursue a friendship with just a handful, this is great!</p>\n<p>This is a very, very different mindset from standard social norms, which push me towards being bland and inoffensive, and minimising the probability of bad interactions. A bad interaction (so long as it doesn’t damage my reputation) is just as useless as a mediocre interaction for finding potential friends. Instead I want to maximise the probability that, if someone <em>is</em> compatible with me, we have an awesome interaction. This is a key part of why I push for excitement and vulnerability - many people won’t vibe with that, but it makes it much more likely that I hit it off with the right kind of person.</p>\n<p>Further, I am not constrained by the number of people I could meet - there are a lot of interesting people in the world. This means it’s OK (but sad) if some people I <em>could</em> be compatible with don’t vibe with my approach. Some people are pretty closed at first, and take a while to warm up to new people, but are awesome once this happens - my strategies around eg minimising small talk work much less well on this kind of person, which is sad. But the ability to filter <em>fast</em> is crucial. (Note: The trade-off between efficiency and precision depends on your situation, and I expect I’m further towards efficiency than most readers)</p>\n<p>An important part of this is that a good filter is something that identifies people I’m compatible with <em>and</em> convinces them that they’re compatible with me - if it feels like I’m coldly analysing or interviewing them, this is unlikely to go well. This is another part of why I am excited about approaches centred on excitement + vulnerability, those tend to go well if reciprocated.</p>\n<p><strong>Warning</strong>: This logic does not apply with people who I will need to interact with regularly anyway, eg co-workers/classmates. Social norms around minimising weirdness/potential for bad outcomes make much more sense in those situations, since downside risk is much higher. These mindsets work best when eg meeting people at a party or meetup or friends of friends, where I won’t necessarily interact with them again.</p>\n<p>Another key part of hits-based befriending is meeting lots of people, and exposing myself to lots of possible hits. Some of my favourite approaches:</p>\n<ul>\n<li>Going to meetups</li>\n<li>Going to events that will attract people with similar interests</li>\n<li>Talking to people around me in talks/lectures</li>\n<li>Asking my friends for intros to their friends - both generically (‘do you know anyone I might get on with?’) and specifically (‘can you introduce me to [specific person]?’)</li>\n<li>Proactively reaching out to people who seem interesting\n<ul>\n<li>I find this pretty anxiety-inducing, but it has a surprisingly high success rate. Most people are flattered!</li>\n</ul>\n</li>\n<li>Having public forms on my website for people who want to have a <a href=\"https://bit.ly/neelchat\" title=\"https://bit.ly/neelchat\">chat</a> or go on a date</li>\n</ul>\n<p><strong>Exercise:</strong> What traits do you value in your friends? What kind of person would you love to be friends with? How could you identify these traits in someone in a first meeting?</p>\n<h3 id=\"take-social-initiative\">Take Social Initiative<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#take-social-initiative\"></a></h3>\n<p><em>See longer form thoughts on this in</em> <a href=\"https://www.neelnanda.io/blog/mini-blog-post-23-taking-social-initiative\"><em>Taking Social Initiative</em></a></p>\n<p>A key second step to the hits-based befriending mindset is to <strong>follow-up</strong> once I identify someone cool! I try to make sure I get their contact info, and reach out shortly after meeting them trying to arrange a call/meetup. I find that many people are too socially anxious to do this, but <strong>this is a really useful skill to practice</strong>. The vast majority of my current friendships would not exist if I was bad at reaching out. Most people find this great and flattering, don’t overthink it.</p>\n<p>If you feel convinced of this logic, but still feel anxious about it, my main advice is to <strong>practice</strong>. Find some safe-ish ways to try it at first, eg with people you <em>really</em> hit it off with, or who seem incredibly friendly, or who you feel really comfortable around. If you’re overthinking it, talk it through with a trusted friend and let them talk you into it. If you’re concerned you won’t know what to talk about, do some research on the person and make an agenda: a list of possible topics or questions to ask them. Initially, it takes a lot of willpower and effort, and may feel super anxiety inducing - this is normal. But after I did it a few times and it went well, my mind started to update, and it now feels like a habit. I find that a similar strategy works for most forms of comfort zone expansion.</p>\n<p>Another tactic for overcoming anxiety is to <strong>other-ise</strong>. Imagine you met someone at a party, <em>they</em> thought you were cool, and messaged you afterwards asking to meet up again. I don’t know about you, but I’d find that pretty flattering. Or, imagine a specific friend coming to you with an analogous situation, asking whether they should follow-up. What advice would you give to the friend? And, if it differs from your internal thoughts about <em>your</em> situation, why? Personally, I have yet to find a situation where the advice I give to the friend is worse than the advice I give myself.</p>\n<p>A related and important skill is keeping in touch. Most people are really bad at keeping in touch, especially without a structure like university that keeps you in frequent contact. This means that many friendships fizzle without this structure. And this is really sad! I find a common mindset is ‘if friend X really valued this friendship, I wouldn’t be the one to always reach out’. But, empirically, I am confident many of my friends value our friendship, but also suck at reaching out. Being conscientious and organised is just hard, and varies a lot between people. Some people are very organised and keep in touch with everyone with ease, others easily lose track of close friends. ‘Does this friend reach out to me?’ is an <em>incredibly</em> noisy signal for how much they like you, and I consider it to convey approximately no information. I want to be good at keeping in touch, because I want to be able to remain friends with less conscientious people. And if I want to know if a friend actually likes me, there are much more direct ways of asking them.</p>\n<p>But, fundamentally, keeping in touch should <em>not</em> be that hard - you just need to regularly reach out to arrange a call/meetup. This <em>can</em> be solved by being highly conscientious and having a good memory, but if you’re lazy like me, <a href=\"https://www.neelnanda.io/blog/mini-blog-post-19-on-systems-living-a-life-of-zero-willpower\">the correct way to solve this is with systems</a>. I have a pretty barebones spreadsheet (<a href=\"https://docs.google.com/spreadsheets/d/1y7mdfeVTiCeoGf5EbaMHq9R8Dsp10RPFLuuljsBZyYU/edit#gid=1958275080\">see template</a>) that lets me set an interval of N days to reach out to each friend, and reminds me to reach out N days after our last call, which has completely solved this problem. Other systems, such as <a href=\"http://calendly.com/\">Calendly</a>, are great for streamlining both following-up and keeping in touch, by making it trivial to schedule things.</p>\n<p>For me, much of the anxiety around following-up and keeping in touch centre on being a burden, and bothering other people. A mindset I find helpful is reframing it all as <strong>providing a public good</strong>. Taking social initiative is <em>hard</em> and most people aren’t very good at it. But most people <em>do</em> value fun social interactions. And, for some reason, people often enjoy interacting with me. This means that by taking social initiative, I am creating more opportunities for both of our lives to be better, which <em>is</em> something I find deeply motivating. ‘I want to be a person who creates win-win situations’ is fairly core to my identity. Whether it’s following-up, keeping in touch, organising parties, suggesting group activities, etc, I want there to be more people in the world who do this. So I want to cultivate this skill myself.</p>\n<h3 id=\"deepening-friendships\">Deepening Friendships<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#deepening-friendships\"></a></h3>\n<p><em>See my post on</em> <a href=\"https://www.neelnanda.io/blog/25-friendship\"><em>Friendships</em></a> <em>for a deeper dive into what</em> my <em>ideal friendship looks like</em></p>\n<p>My guess is that a surprising amount of the variance in friendship quality comes from finding the right people, and that things can often flow easily from there. But I think that it is also clearly valuable to practice the skill of deepening existing friendships. I have less time actively optimising this skill, and feedback loops are harder, but here are some thoughts:</p>\n<ul>\n<li>All my thoughts so far on vulnerability, excitement and authenticity also work for deepening friendships - I find that having regular authentic and meaningful conversations really help me feel closer to people</li>\n<li>Spending time together\n<ul>\n<li>In particular, searching for unusually fun/fulfilling ways to spend time together. Pay attention to their interests, experiment, and take social initiative!</li>\n<li>Relatedly, actually <em>make</em> time to spend together. <a href=\"https://www.neelnanda.io/blog/38-slack\">Protect your Slack</a>, and spend it on the people you care about. It’s easy to make the mistake of considering social stuff the low priority thing to cut when I’m busy.</li>\n</ul>\n</li>\n<li><em>Don’t feel constrained by fear of seeming weird, or social norms</em>\n<ul>\n<li>Some social norms are good, some are bad. But if I really care about someone, I want our relationship to be optimised for <em>their</em> preferences. And this means figuring out what <em>they</em> want, and setting explicit boundaries and norms with each other\n<ul>\n<li>Eg, do they value honesty? Politeness? Bluntness? Proactivity? Compliments? Affection?</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Relatedly, have good and clear communication about what we both want out of the friendship, and how the other person adds to our life\n<ul>\n<li>People often find this hard - it’s hard to eg communicate about ways the other person annoys you without harming them. For me, a key is creating clear and explicit common knowledge that we both value this friendship and are invested in it. This frames all clear communication as <strong>being on the same team</strong> - we’re trying to work together and share information, so we can both forge a better friendship</li>\n</ul>\n</li>\n<li><a href=\"https://www.neelnanda.io/blog/mini-blog-post-10-seek-positive-externalities\">Seek positive externalities</a> - be a pleasant person to be around, and find ways to add joy to the lives of those around you</li>\n<li>Try to form a coherent model of how they add value to my life and vice versa. Once identified, try to actively optimise for the ways I add value.\n<ul>\n<li><a href=\"https://www.neelnanda.io/blog/mini-blog-post-9-what-it-means-to-optimise\">Obvious caveats</a>: Make sure to remain authentic, account for uncertainty in the model, check for consent, etc</li>\n</ul>\n</li>\n<li>Practice relevant skills:\n<ul>\n<li>As above, good communication</li>\n<li><strong>Love languages</strong> - different people have very different ways of expressing affection, and it’s easy to <a href=\"https://www.lesswrong.com/posts/baTWMegR42PAsH9qJ/generalizing-from-one-example\">typical mind fallacy</a>. Some people really value appreciation, others value your time, others value gifts, others value physical affection, etc. I find it hard to empathise with people with different love languages, so it’s important to explicitly notice and account for this, and understand what my friends want</li>\n<li><strong>Emotional support/debugging</strong> - one of the most valuable parts friends play in my life is providing emotional support, and help solving my problems. And I want to be able to provide this in turn. But this is really hard, and definitely a practicable skill!\n<ul>\n<li>My main tip is to avoid jumping to conclusions about the problem and what is needed, and instead to explore the problem more than feels necessary. I often explicitly ask ‘what kind of help are you looking for?’ - sometimes they want a solution, sometimes they just want to vent</li>\n<li>See <a href=\"https://www.neelnanda.io/blog/30-debugging-others\">this post</a> for more advice</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p>But remember, these are just my takes, according to my friends and my values. You should experiment, try things, and figure out what works best for you!</p>\n<p><strong>Exercise:</strong> Make a list of your good friends. Which of them do you feel closest to, and what has led to this? What blocks are there to being closer to some, and what are you going to do about it?</p>\n<h2 id=\"conclusion\">Conclusion<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#conclusion\"></a></h2>\n<p>Close friends are very important to my life. And solving the problem of intentionally making close friends has added a <em>ton</em> of value, helped me make many friendships I cherish. Further, I’ve managed to add a lot of value to <em>their</em> lives. Friendship is one of the best mutually beneficial trades I’ve ever made.</p>\n<p>The ideas in this post are all specialised to my tastes, and my experiences. I am a massive fan of 1-1 conversations, and of shared vulnerability. But your mileage may vary! You should experiment, try things, and forge your own vision of what intentionally forming close friendships looks like for you.</p>\n<p>A point I’ve made throughout is that <strong>this is a skill</strong>. These are all things you can practice, experiment, iterate and get better at. It’s easy to think of friendships as just something that happens to you. But I assert that, for most people, the cap on how awesome their friendships can be is <em>far</em> higher than where they are right now - it would be weird if that wasn’t the case! Relationships are complex.</p>\n<p>Finally, my key lesson from all this is that I need to take <strong>agency</strong>. It’s easy to go through life never solving this problem, never even noticing the lack. Nothing will go visibly wrong. Nobody will stop you, or solve this for you. If you need permission from someone to do something differently, let this post be it - if you want your social life to be better, the only one who will fix this is you.</p>\n<p>If the ideas in this post have resonated, I encourage you to take a moment to stop and reflect on your social life: Are you happy with how things are going? Do you feel happy with your ability to emotionally connect? Could it be better, and if so, how? What have you tried to do about this so far? And looking forwards, what are you <em>going</em> to do about this?</p>\n<p><strong>Exercise:</strong> Set a 5 minute timer, and list as many concrete ideas as you can for experiments to run, and things to try doing differently.</p>\n<p><strong>Bonus exercise:</strong> <a href=\"https://www.neelnanda.io/blog/become-a-person-who-actually-does-things\">Actually do something about it</a>.</p>","noteIndex":{"id":"Iy0MoL0KnL55Br3AfTS2C","title":"Luke","desc":"","updated":1766965759366,"created":1644449449778,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"a724de3efd251cf89fe82a5860d9008b","links":[{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"life-tips","position":{"start":{"line":43,"column":5,"offset":2710},"end":{"line":43,"column":29,"offset":2734},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"life-tips","anchorHeader":"wodenokoto"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2026.articles","alias":"What I read in 2026","position":{"start":{"line":72,"column":3,"offset":4440},"end":{"line":72,"column":45,"offset":4482},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2026.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2025.articles","alias":"2025","position":{"start":{"line":73,"column":5,"offset":4487},"end":{"line":73,"column":32,"offset":4514},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2025.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2024.articles","alias":"2024","position":{"start":{"line":74,"column":5,"offset":4519},"end":{"line":74,"column":32,"offset":4546},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2024.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2023.articles","alias":"2023","position":{"start":{"line":75,"column":5,"offset":4551},"end":{"line":75,"column":32,"offset":4578},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2023.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"read.2022.articles","alias":"2022","position":{"start":{"line":76,"column":5,"offset":4583},"end":{"line":76,"column":32,"offset":4610},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"read.2022.articles"}},{"type":"wiki","from":{"fname":"root","id":"Iy0MoL0KnL55Br3AfTS2C","vaultName":"vault"},"value":"journal.what-i-struggled-brag-in","position":{"start":{"line":82,"column":3,"offset":4746},"end":{"line":82,"column":39,"offset":4782},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"journal.what-i-struggled-brag-in"}}],"anchors":{"what-i-read-in-past":{"type":"header","text":"What I read in past","value":"what-i-read-in-past","line":76,"column":0,"depth":2}},"children":["zd4mq442jike0pr0wba1u3m","6hzeqsofq67gdk88flxlkhp","778ijii93yu5uwnrwmn5zi4","g1fngdjl25nes6fs3lip602","ZbdkdApFqLdks4Moq92R9","uoc5hhki3o4py15cesddu8q","9qf7j06jtdkm6rnx9ymvwb0","5zn10cvj7ajy2gh2is5nqmg","4qo9ma0z0yu1czns6pxl7y5","ok0e729ho7o09xetujkxc0m","GR5x8HnNFEN6fU2UBSEIK","yirtnlj8q24yutcf3ss1xqy","eq0wc6t7wl2wv221yb68ro4","7x2fnv4j6gxts08qk0jguny","ettkt3iClONnxpbGwBVLl","7l4knev6v613tbuoskvmbdg","hvh5bud6yp7dc89tuh95tr9","4fvoqrplw0cweo554usbjos","f8qsfql0a9v8thpeo82udfa","1swsbrhqi9jk41v9eodyi5q","SQqYupi6EFddTerBA8RRD","hjNeNc1F2JUh0lTWanH4h","qf0l4wbrc9jgooyzexmbq5v","o7xruzrah5wzqetottecss7","z1zo2mp6ddji5p317i4x9xw","v06c2tjelh341x4resa50fh","0yqesk4rcffwgyuab5x8rfa","sy2vkbtyu671chkvgn1yt8j","ufixpmxoydiccoh59kphrib","alswadkx4wb05y1z9iwfzfv","1daut9dpw70xd0zh5a7j5p4"],"parent":null,"data":{},"body":"\nHi there 👋. I'm a Front-end developer.\n\n---\n\n- 현실은 인간의 연산으로 완전히 파악할 수 없는 복잡계. 주어진 상황과 능력으로 할 수 있는 최선의 적응은 단순함과 꾸준함.\n\n  - 파산을 면하는 선에서 여러가지를 해보고 자신에게 맞는 걸 위주로 꾸준히. 그를 위해 단순, 편안, 쾌적함이 필요.\n\n- 🥱 -> 🤔💡🌱 - [On The Death of Daydreaming](https://www.afterbabel.com/p/on-the-death-of-daydreaming)\n  - boredom -> easy fun -> art -> profit?\n\n> I've often described my motivation for building software to others using imagery: I like to go find a secluded beach, build a large, magnificent sand castle, and then walk away. Will anyone notice? Probably not. Will the waves eventually destroy it? Yep. Did I still get immense satisfaction? Absolutely. - [aliasxneo](https://news.ycombinator.com/item?id=41497113)\n\n> We love to see the process, not just the result. The imperfections in your work can be beautiful if they show your struggle for perfection, not a lack of care. - [ralphammer](https://ralphammer.com/is-perfection-boring/)\n\n> Simplicity, even if it sacrifices some ideal functionality has better survival characteristics than the-right-thing. - [The Rise of Worse is Better](https://www.dreamsongs.com/RiseOfWorseIsBetter.html)\n\n> [Roberto Blake was talking about making 100 crappy videos](https://www.youtube.com/watch?v=OnUBaQ1Sp_E) to get better over time. Putting in the reps and improving a little bit each time.\n>\n> Putting in the work without expecting any external reward at first (eg views, followers, likes, etc) will pay off in the long run. - [100 Scrappy Things](https://www.florin-pop.com/blog/100-scrappy-things/)\n\n> Make the difficult habitual, the habitual easy, and the easy beautiful. - [Constantin S. Stanislavski](https://www.goodreads.com/quotes/7102271-make-the-difficult-habitual-the-habitual-easy-and-the-easy)\n\n> A good match is a **structured** dance, where players aim to **score** while they are following well-defined **rules**. This **freedom within a structure** is what makes it fun. - [ralphammer](https://ralphammer.com/how-to-get-started/)\n\n- [Pivot Points](https://longform.asmartbear.com/pivot-points/)\n\n  - non-judgmental aspects of personality that can be strengths in some contexts and weaknesses in others\n  - Pivot Points are fixed in the short term\n\n- [Hedged Bets](https://longform.asmartbear.com/predict-the-future/#hedged-bets)\n  - trading slightly less maximum upside for predictable, net-positive outcomes.\n\n> “Motivation often comes after starting, not before. Action produces momentum.”\n> [When you start a new habit, it should take less than two minutes to do.](https://jamesclear.com/how-to-stop-procrastinating)\n>\n> - James Clear\n\n> Focus is more about **not** keeping busy when you need to wait for something.  \n> Eat the boredom for a minute.\n>\n> - [[life-tips#wodenokoto]]\n\n> [4 minutes run hard enough to push heart rate to 90%, 3 minutes recover, repeat 4 times](https://news.ycombinator.com/item?id=34213181)\n>\n> - https://www.ntnu.edu/cerg/advice\n> - [Get running with Couch to 5K](https://www.nhs.uk/live-well/exercise/running-and-aerobic-exercises/get-running-with-couch-to-5k/)\n\n> [recommended routine - bodyweightfitness](https://www.reddit.com/r/bodyweightfitness/wiki/kb/recommended_routine/) - I Don't Have This Much Time!\n>\n> - Don't workout at all (saves anywhere from 20 to 60 minutes, but really, really, really, really, really, really, really, really, really not recommended)\n\n> 도무지 읽히지 않는 책 앞에서 내가 택한 방법은 펼쳐진 페이지 앞에서 멍때리기이다. 다르게 표현하면 이렇다. 펼쳐진 두 페이지 앞에서 오래 머물기.\n>\n> 책을 펼쳐놓는 것으로 충분하다. 읽지 못해도 좋다. 매일 정해진 진도를 나가야 하는 학교 수업이 아니니까. 하지만 읽지 않아도 괜찮다고 해서 펼쳐두지조차 않으면 곤란하다. 가능한 한 자주 책을 펼쳐두도록 하자. 전혀 읽지 않고 멍하니 바라보고 있다가 다시 덮게 되더라도\n>\n> - 막막한 독서. 시로군. P.10~13\n\n> I think it should be everyone's primary focus to sleep well, drink water, get outside, get active, and eat generally decently. I hate to say it, but if you're not eating a good amount of vegetables and fruit, decent protein, sleep, etc, no amount of XYZ will catch up to that detriment. - [CE02](https://news.ycombinator.com/item?id=35056071)\n\n> My real battle is doing good versus doing nothing. - [Deirdre Sullivan](https://www.npr.org/2005/08/08/4785079/always-go-to-the-funeral)\n\n[Kind Engineering](https://kind.engineering/) - How To Engineer Kindness\n\n> Sometimes magic is just someone spending more time on something than anyone else might reasonably expect. - [Teller](https://www.goodreads.com/quotes/6641527-sometimes-magic-is-just-someone-spending-more-time-on-something)\n\n---\n\n## What I read in past\n\n- [[What I read in 2026|read.2026.articles]]\n  - [[2025|read.2025.articles]]\n  - [[2024|read.2024.articles]]\n  - [[2023|read.2023.articles]]\n  - [[2022|read.2022.articles]]\n- 📝 [Gists](https://gist.github.com/Luke-SNAW)\n- 📜 [Journals](https://luke-snaw.github.io/Luke-SNAW__netlify-CMS.github.io/)\n\n---\n\n- [[journal.what-i-struggled-brag-in]]\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":false,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.115.0","enableFullHierarchyNoteTitle":false,"enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Luke SNAW","description":"Personal knowledge space"},"github":{"enableEditLink":false,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","siteUrl":"https://luke-snaw.github.io/","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}